{
  "MSH": {
    "1": {
      "field_id": "MSH.1",
      "name": "Field Separator",
      "description": "This field contains the separator between the segment ID and the first real field, MSH-2-encoding characters . As such it serves as the separator and defines the character to be used as a separator for the rest of the message. Recommended value is |, (ASCII 124).",
      "length": "1",
      "data_type": "ST - String Data",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "MSH.2",
      "name": "Encoding Characters",
      "description": "This field contains the four characters in the following order: the component separator, repetition separator, escape character, and subcomponent separator. Recommended values are ^~\\& (ASCII 94, 126, 92, and 38, respectively). See Section 2.5.4, \"Message delimiters'.",
      "length": "4",
      "data_type": "ST - String Data",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "MSH.3",
      "name": "Sending Application",
      "description": "This field uniquely identifies the sending application among all other applications within the network enterprise. The network enterprise consists of all those applications that participate in the exchange of HL7 messages within the enterprise. Entirely site-defined. User-defined Table 0361- Application is used as the user-defined table of values for the first component.",
      "length": "227",
      "data_type": "HD - Hierarchic Designator",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "4": {
      "field_id": "MSH.4",
      "name": "Sending Facility",
      "description": "This field further describes the sending application, MSH-3-sending application. With the promotion of this field to an HD data type, the usage has been broadened to include not just the sending facility but other organizational entities such as a) the organizational entity responsible for sending application; b) the responsible unit; c) a product or vendors identifier, etc. Entirely site-defined. User-defined Table 0362 - Facility is used as the HL7 identifier for the user-defined table of values for the first component.",
      "length": "227",
      "data_type": "HD - Hierarchic Designator",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "MSH.5",
      "name": "Receiving Application",
      "description": "This field uniquely identifies the receiving application among all other applications within the network enterprise. The network enterprise consists of all those applications that participate in the exchange of HL7 messages within the enterprise. Entirely site-defined User-defined Table 0361- Application is used as the HL7 identifier for the user-defined table of values for the first component.",
      "length": "227",
      "data_type": "HD - Hierarchic Designator",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "6": {
      "field_id": "MSH.6",
      "name": "Receiving Facility",
      "description": "This field identifies the receiving application among multiple identical instances of the application running on behalf of different organizations. User-defined Table 0362 - Facility is used as the HL7 identifier for the user-defined table of values for the first component. Entirely site-defined.",
      "length": "227",
      "data_type": "HD - Hierarchic Designator",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "7": {
      "field_id": "MSH.7",
      "name": "Date/Time Of Message",
      "description": "This field contains the date/time that the sending system created the message. If the time zone is specified, it will be used throughout the message as the default time zone.",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "8": {
      "field_id": "MSH.8",
      "name": "Security",
      "description": "In some applications of HL7, this field is used to implement security features. Its use is not yet further specified.",
      "length": "40",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "9": {
      "field_id": "MSH.9",
      "name": "Message Type",
      "description": "This field contains the message type, trigger event, and the message structure ID for the message.",
      "length": "15",
      "data_type": "MSG - Message Type",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "10": {
      "field_id": "MSH.10",
      "name": "Message Control ID",
      "description": "This field contains a number or other identifier that uniquely identifies the message. The receiving system echoes this ID back to the sending system in the Message acknowledgment segment (MSA).",
      "length": "20",
      "data_type": "ST - String Data",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "11": {
      "field_id": "MSH.11",
      "name": "Processing ID",
      "description": "This field is used to decide whether to process the message as defined in HL7 Application (level 7) Processing rules.",
      "length": "3",
      "data_type": "PT - Processing Type",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "12": {
      "field_id": "MSH.12",
      "name": "Version ID",
      "description": "This field is matched by the receiving system to its own version to be sure the message will be interpreted correctly. Beginning with Version 2.3.1, it has two additional internationalization components, for use by HL7 international affiliates. The <internationalization code> is CE data type (using the ISO country codes where appropriate) which represents the HL7 affiliate. The <internal version ID> is used if the HL7 Affiliate has more than a single local version associated with a single US version. The <international version ID> has a CE data type, since the table values vary for each HL7 Affiliate.",
      "length": "60",
      "data_type": "VID - Version Identifier",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "13": {
      "field_id": "MSH.13",
      "name": "Sequence Number",
      "description": "A non-null value in this field implies that the sequence number protocol is in use. This numeric field is incremented by one for each subsequent value.",
      "length": "15",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "14": {
      "field_id": "MSH.14",
      "name": "Continuation Pointer",
      "description": "This field is used to define continuations in application-specific ways.",
      "length": "180",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "15": {
      "field_id": "MSH.15",
      "name": "Accept Acknowledgment Type",
      "description": "This field identifies the conditions under which accept acknowledgments are required to be returned in response to this message. Required for enhanced acknowledgment mode. Refer to HL7 Table 0155 - Accept/application acknowledgment conditions for valid values.",
      "length": "2",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "16": {
      "field_id": "MSH.16",
      "name": "Application Acknowledgment Type",
      "description": "This field contains the conditions under which application acknowledgments are required to be returned in response to this message. Required for enhanced acknowledgment mode.\n\nNote: If MSH-15-accept acknowledgment type and MSH-16-application acknowledgment type are omitted (or are both null), the original acknowledgment mode rules are used.",
      "length": "2",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "17": {
      "field_id": "MSH.17",
      "name": "Country Code",
      "description": "This field contains the country of origin for the message. It will be used primarily to specify default elements, such as currency denominations. The values to be used are those of ISO 3166,.[5]. The ISO 3166 table has three separate forms of the country code: HL7 specifies that the 3-character (alphabetic) form be used for the country code.",
      "length": "3",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "18": {
      "field_id": "MSH.18",
      "name": "Character Set",
      "description": "This field contains the character set for the entire message. Refer to HL7 Table 0211 - Alternate character sets for valid values.",
      "length": "16",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "19": {
      "field_id": "MSH.19",
      "name": "Principal Language Of Message",
      "description": "This field contains the principal language of the message. Codes come from ISO 639.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "20": {
      "field_id": "MSH.20",
      "name": "Alternate Character Set Handling Scheme",
      "description": "When any alternative character sets are used (as specified in the second or later iterations of MSH-18 character sets), and if any special handling scheme is needed, this component is to specify the scheme used, according to HL7 Table 0356- Alternate character set handling scheme as defined below:",
      "length": "20",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "21": {
      "field_id": "MSH.21",
      "name": "Message Profile Identifier",
      "description": "Sites may use this field to assert adherence to, or reference, a message profile. Message profiles contain detailed explanations of grammar, syntax, and usage for a particular message or set of messages. See section 2.12, \"Conformance Using Message Profiles\".",
      "length": "427",
      "data_type": "EI - Entity Identifier",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    }
  },
  "PID": {
    "1": {
      "field_id": "PID.1",
      "name": "Set ID - PID",
      "description": "This field contains the number that identifies this transaction. For the first occurrence of the segment, the sequence number shall be one, for the second occurrence, the sequence number shall be two, etc.",
      "length": "4",
      "data_type": "SI - Sequence ID",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "PID.2",
      "name": "Patient ID",
      "description": "This field has been retained for backward compatibility only. The arbitrary term of external ID has been removed from the name of this field. The repetition, assigning authority, healthcare facility, and identifier type code attributes of PID-3 - Patient Identifier List allow for distinctive identifier representation. This field remains for systems with a negotiated understanding of external. It is recommended to use PID-3 - Patient Identifier List for all patient identifiers.",
      "length": "20",
      "data_type": "CX - Extended Composite ID with Check Digit",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "PID.3",
      "name": "Patient Identifier List",
      "description": "This field contains the list of identifiers (one or more) used by the healthcare facility to uniquely identify a patient (e.g., medical record number, billing number, birth registry, national unique individual identifier, etc.). In Canada, the Canadian Provincial Healthcare Number should be sent in this field. The arbitrary term of internal ID has been removed from the name of this field for clarity.",
      "length": "250",
      "data_type": "CX - Extended Composite ID with Check Digit",
      "optionality": "Required",
      "repeatability": "Repeatable indefinitely"
    },
    "4": {
      "field_id": "PID.4",
      "name": "Alternate Patient ID - PID",
      "description": "From V2.3.1, this field has been retained for backward compatibility only. It is recommended to use PID-3 - Patient Identifier List for all patient identifiers. When used for backward compatibility, this field contains the alternate, temporary, or pending optional patient identifier to be used if needed - or additional numbers that may be required to identify a patient. This field may be used to convey multiple patient IDs when more than one exist for a patient. Possible contents might include a visit number, a visit date, or a Social Security Number.",
      "length": "20",
      "data_type": "CX - Extended Composite ID with Check Digit",
      "optionality": "Backward Compatibility",
      "repeatability": "Repeatable indefinitely"
    },
    "5": {
      "field_id": "PID.5",
      "name": "Patient Name",
      "description": "This field contains the names of the patient, the primary or legal name of the patient is reported first. Therefore, the name type code in this field should be L - Legal. Refer to HL7 Table 0200 - Name Type for valid values. Repetition of this field is allowed for representing the same name in different character sets. Note that last name prefix is synonymous to own family name prefix of previous versions of HL7, as is second and further given names or initials thereof to middle initial or name. Multiple given names and/or initials are separated by spaces.",
      "length": "250",
      "data_type": "XPN - Extended Person Name",
      "optionality": "Required",
      "repeatability": "Repeatable indefinitely"
    },
    "6": {
      "field_id": "PID.6",
      "name": "Mother's Maiden Name",
      "description": "This field contains the family name under which the mother was born (i.e., before marriage). It is used to distinguish between patients with the same last name.",
      "length": "250",
      "data_type": "XPN - Extended Person Name",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "7": {
      "field_id": "PID.7",
      "name": "Date/Time of Birth",
      "description": "This field contains the patients date and time of birth.",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "8": {
      "field_id": "PID.8",
      "name": "Administrative Sex",
      "description": "This field contains the patients sex. Refer to User-defined Table 0001 - Administrative Sex for suggested values.",
      "length": "1",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "9": {
      "field_id": "PID.9",
      "name": "Patient Alias",
      "description": "From V2.4, this field has been retained for backward compatibility only. It is recommended to use PID-5 - Patient Name for all patient names. This field contained the name(s) by which the patient has been known at some time. Refer to HL7 Table 0200 - Name Type for valid values.",
      "length": "250",
      "data_type": "XPN - Extended Person Name",
      "optionality": "Backward Compatibility",
      "repeatability": "Repeatable indefinitely"
    },
    "10": {
      "field_id": "PID.10",
      "name": "Race",
      "description": "This field refers to the patients race. Refer to User-defined Table 0005 - Race for suggested values. The second triplet of the CE data type for race (alternate identifier, alternate text, and name of alternate coding system) is reserved for governmentally assigned codes.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "11": {
      "field_id": "PID.11",
      "name": "Patient Address",
      "description": "This field contains the mailing address of the patient. Address type codes are defined by HL7 Table 0190 - Address Type . Multiple addresses for the same person may be sent in the following sequence: The primary mailing address must be sent first in the sequence (for backward compatibility); if the mailing address is not sent, then a repeat delimiter must be sent in the first sequence.",
      "length": "250",
      "data_type": "XAD - Extended Address",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "12": {
      "field_id": "PID.12",
      "name": "County Code",
      "description": "From V2.3, this field has been retained for backward compatibility. This field contains the patients county code. The county can now be supported in the county/parish code component of the XAD data type ( PID-11 - Patient Address ). Refer to User-defined Table 0289 - County/Parish for suggested values",
      "length": "4",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    },
    "13": {
      "field_id": "PID.13",
      "name": "Phone Number - Home",
      "description": "This field contains the patients personal phone numbers. All personal phone numbers for the patient are sent in the following sequence. The first sequence is considered the primary number (for backward compatibility). If the primary number is not sent, then a repeat delimiter is sent in the first sequence. Refer to HL7 Table 0201 - Telecommunication Use Code and HL7 Table 0202 - Telecommunication Equipment Type for valid values.",
      "length": "250",
      "data_type": "XTN - Extended Telecommunication Number",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "14": {
      "field_id": "PID.14",
      "name": "Phone Number - Business",
      "description": "This field contains the patients business telephone numbers. All business numbers for the patient are sent in the following sequence. The first sequence is considered the patients primary business phone number (for backward compatibility). If the primary business phone number is not sent, then a repeat delimiter must be sent in the first sequence. Refer to HL7 Table 0201 - Telecommunication Use Code and HL7 Table 0202 - Telecommunication Equipment Type for valid values.",
      "length": "250",
      "data_type": "XTN - Extended Telecommunication Number",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "15": {
      "field_id": "PID.15",
      "name": "Primary Language",
      "description": "This field contains the patients primary language. HL7 recommends using ISO table 639 as the suggested values in User-defined Table 0296 - Primary Language .",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "16": {
      "field_id": "PID.16",
      "name": "Marital Status",
      "description": "This field contains the patients marital (civil) status. Refer to User-defined Table 0002 - Marital Status for suggested values.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "17": {
      "field_id": "PID.17",
      "name": "Religion",
      "description": "This field contains the patients religion. Refer to User-defined Table 0006 - Religion for suggested values.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "18": {
      "field_id": "PID.18",
      "name": "Patient Account Number",
      "description": "This field contains the patient account number assigned by accounting to which all charges, payments, etc., are recorded. It is used to identify the patients account. Refer to HL7 Table 0061 - Check Digit Scheme for valid values.",
      "length": "250",
      "data_type": "CX - Extended Composite ID with Check Digit",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "19": {
      "field_id": "PID.19",
      "name": "SSN Number - Patient",
      "description": "From V2.3.1 onward, this field has been retained for backward compatibility only. It is recommended to use PID-3 - Patient Identifier List for all patient identifiers. However, in order to maintain backward compatibility, this field should also be populated. When used for backward compatibility, this field contains the patients social security number. This number may also be a RR retirement number.",
      "length": "16",
      "data_type": "ST - String Data",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    },
    "20": {
      "field_id": "PID.20",
      "name": "Driver's License Number - Patient",
      "description": "From V2.5 onward, this field has been retained for backward compatibility only. It is recommended to use PID-3 - Patient Identifier List for all patient identifiers. When used for backward compatibility, this field contains the patients drivers license number. The default of the second component is the state in which the patients license is registered.",
      "length": "25",
      "data_type": "DLN - Driver License Number",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    },
    "21": {
      "field_id": "PID.21",
      "name": "Mother's Identifier",
      "description": "This field is used, for example, as a link field for newborns. Typically a patient ID or account number may be used. This field can contain multiple identifiers for the same mother. Refer to HL7 Table 0061 - Check Digit Scheme for valid values.",
      "length": "250",
      "data_type": "CX - Extended Composite ID with Check Digit",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "22": {
      "field_id": "PID.22",
      "name": "Ethnic Group",
      "description": "This field further defines the patients ancestry. Refer to User-defined Table 0189 - Ethnic Group for suggested values. The second triplet of the CE data type for ethnic group (alternate identifier, alternate text, and name of alternate coding system) is reserved for governmentally assigned codes. In the US, a current use is to report ethnicity in line with US federal standards for Hispanic origin.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "23": {
      "field_id": "PID.23",
      "name": "Birth Place",
      "description": "This field indicates the location of the patients birth, for example St. Francis Community Hospital of Lower South Side. The actual address is reported in PID-11 with an identifier of N.",
      "length": "250",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "24": {
      "field_id": "PID.24",
      "name": "Multiple Birth Indicator",
      "description": "This field indicates whether the patient was part of a multiple birth. Refer to HL7 Table 0136 - Yes/No Indicator for valid values.",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "25": {
      "field_id": "PID.25",
      "name": "Birth Order",
      "description": "When a patient was part of a multiple birth, a value (number) indicating the patients birth order is entered in this field.",
      "length": "2",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "26": {
      "field_id": "PID.26",
      "name": "Citizenship",
      "description": "This field contains the information related to a person's country citizenship. For country citizenship HL7 recommends using ISO table 3166. For a local definition, User-defined Table 0171 - Citizenship should be used.\n\nThis field repeats since persons can be citizens of more than one country. The Name of Coding System component(s) of the CE datatype should be used to identify the table from which citizenship membership is drawn.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "27": {
      "field_id": "PID.27",
      "name": "Veterans Military Status",
      "description": "This field contains the military status assigned to a veteran. Refer to User-defined Table 0172 - Veterans Military Status for suggested values.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "28": {
      "field_id": "PID.28",
      "name": "Nationality",
      "description": "From V2.4 onward, this field has been retained for backward compatibility only. It is recommended to refer to PID-10 - Race, PID-22 - Ethnic group and PID-26 - Citizenship. This field contains a code that identifies the nation or national grouping to which the person belongs. This information may be different from a persons citizenship in countries in which multiple nationalities are recognized (for example, Spain: Basque, Catalan, etc.).",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    },
    "29": {
      "field_id": "PID.29",
      "name": "Patient Death Date and Time",
      "description": "This field contains the date and time at which the patient death occurred.",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "30": {
      "field_id": "PID.30",
      "name": "Patient Death Indicator",
      "description": "This field indicates whether the patient is deceased. Refer to HL7 Table 0136 - Yes/no Indicator for valid values.",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "31": {
      "field_id": "PID.31",
      "name": "Identity Unknown Indicator",
      "description": "This field indicates whether or not the patients/persons identity is known. Refer to HL7 Table 0136 - Yes/no Indicator for valid values.",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "32": {
      "field_id": "PID.32",
      "name": "Identity Reliability Code",
      "description": "This field contains a coded value used to communicate information regarding the reliability of patient/person identifying data transmitted via a transaction. Values could indicate that certain fields on a PID segment for a given patient/person are known to be false (e.g., use of default or system-generated values for Date of Birth or Social Security Number. Refer to User-defined Table 0445 - Identity Reliability Code for suggested values.",
      "length": "20",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "33": {
      "field_id": "PID.33",
      "name": "Last Update Date/Time",
      "description": "This field contains the last update date and time for the patients/persons identifying and demographic data, as defined in the PID segment. Receiving systems will use this field to determine how to apply the transaction to their systems. If the receiving system (such as an enterprise master patient index) already has a record for the person with a later last update date/time, then the EMPI could decide not to apply the patients/persons demographic and identifying data from this transaction.",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "34": {
      "field_id": "PID.34",
      "name": "Last Update Facility",
      "description": "This field identifies the facility of the last update to a patients/persons identifying and demographic data, as defined in the PID segment. Receiving systems or users will use this field to determine how to apply the transaction to their systems. If the receiving system (such as a hospitals patient management system) already has a record for the patient/person, then it may decide to only update its data if the source is a trusted source. A hospital might consider other hospitals trusted sources, but not trust updates from non-acute care facilities. For example:",
      "length": "241",
      "data_type": "HD - Hierarchic Designator",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "35": {
      "field_id": "PID.35",
      "name": "Species Code",
      "description": "The species of living organism. This may include the common or scientific name, based on the coding system(s) used. SNOMED is the recommended coding system. If this field is not valued, a human is assumed. Refer to User-defined Table 0446 - Species Code for suggested values.\n\nConditionality Rule: This field must be valued if PID-36 - Breed Code or PID-38 - Production Class Code is valued.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "36": {
      "field_id": "PID.36",
      "name": "Breed Code",
      "description": "The specific breed of animal. This field, unlike Species and Strain is specific to animals and cannot be generally used for all living organisms. SNOMED is the recommended coding system. Refer to User-defined Table 0447 - Breed Code for suggested values.\n\nConditionality Rule: This field must be valued if PID-37 - Strain is valued.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "37": {
      "field_id": "PID.37",
      "name": "Strain",
      "description": "This field contains the specific strain of animal. It can also be expanded to include strain of any living organism and is not restricted to animals.",
      "length": "80",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "38": {
      "field_id": "PID.38",
      "name": "Production Class Code",
      "description": "This field contains the code and/or text indicating the primary use for which the living subject was bred or grown. Refer to User-defined Table 0429 - Production Class Code for suggested values. For example:",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Repeatable twice"
    },
    "39": {
      "field_id": "PID.39",
      "name": "Tribal Citizenship",
      "description": "This field contains the information related to a person's tribal citizenship. For tribal citizenship, in the United States, HL7 recommends using the Bureau of Indian Affairs (BIA) Tribal Identity List. For a local definition, User-defined Table 0171 - Citizenship should be used.\n\nThis field repeats since persons can have tribal membership(s) and can be members of more than one tribe. The Name of Coding System component(s) of the CWE datatype should be used to identify the table from which tribal membership is drawn",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    }
  },
  "ORC": {
    "1": {
      "field_id": "ORC.1",
      "name": "Order Control",
      "description": "Determines the function of the order segment. Refer to HL7 Table 0119 - Order Control Codes And Their Meaning for valid entries. Depending on the message, the action of the control code may refer to an order or an individual service. For example, the code CA in an OMP message cancels the order. The same code in an RDS message, cancels the dispense. Very detailed explanatory notes are given at the end of this section.",
      "length": "2",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "ORC.2",
      "name": "Placer Order Number",
      "description": "This field is the placer application's order number.",
      "length": "22",
      "data_type": "EI - Entity Identifier",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "ORC.3",
      "name": "Filler Order Number",
      "description": "This field is the order number associated with the filling application. It is a case of the Entity Identifier data type (Section 2.A.28). Its first component is a string that identifies an order detail segment (e.g., OBR). A limit of fifteen (15) characters is suggested but not required. An implementation is HL7 compliant when the number of characters for this field is increased to accommodate applications that require a greater number of characters for the Filler order number. It is assigned by the order filler (receiving) application. This string must uniquely identify the order (as specified in the order detail segment) from other orders in a particular filling application (e.g., clinical laboratory). This uniqueness must persist over time.",
      "length": "22",
      "data_type": "EI - Entity Identifier",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "4": {
      "field_id": "ORC.4",
      "name": "Placer Group Number",
      "description": "This field allows an order placing application to group sets of orders together and subsequently identify them. It is a case of an Entity Identifier data type (2.A.28).",
      "length": "22",
      "data_type": "EI - Entity Identifier",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "ORC.5",
      "name": "Order Status",
      "description": "This field specifies the status of an order. Refer to HL7 Table 0038 - Order status for valid entries. The purpose of this field is to report the status of an order either upon request (solicited), or when the status changes (unsolicited). It does not initiate action. It is assumed that the order status always reflects the status as it is known to the sending application at the time that the message is sent. Only the filler can originate the value of this field.",
      "length": "2",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "6": {
      "field_id": "ORC.6",
      "name": "Response Flag",
      "description": "This field allows the placer (sending) application to determine the amount of information to be returned from the filler. Sometimes the requested level of response may not be possible immediately, but when it is possible, the filler (receiving) application must send the information. When the field is null, D is the default value of the field. Refer to HL7 Table 0121 - Response flag for valid entries.",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "7": {
      "field_id": "ORC.7",
      "name": "Quantity/Timing",
      "description": "This field is retained for backward compatibility only. The reader is referred to the TQ1 and TQ2 segments.\n\nThis field determines the priority, quantity, frequency, and timing of an atomic service.",
      "length": "200",
      "data_type": "TQ - Timing Quantity",
      "optionality": "Backward Compatibility",
      "repeatability": "Repeatable indefinitely"
    },
    "8": {
      "field_id": "ORC.8",
      "name": "Parent Order",
      "description": "This field relates a child to its parent when a parent-child relationship exists. The parent-child mechanism is described under ORC-1-order control notes.",
      "length": "200",
      "data_type": "EIP - Entity Identifier Pair",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "9": {
      "field_id": "ORC.9",
      "name": "Date/Time of Transaction",
      "description": "This field contains the date and time of the event that initiated the current transaction as reflected in ORC-1 Order Control Code. This field is not equivalent to MSH-7 Date and Time of Message which reflects the date/time of the physical message.",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "10": {
      "field_id": "ORC.10",
      "name": "Entered By",
      "description": "This field contains the identity of the person who actually keyed the request into the application. Note that this refers to the current transaction as reflected in ORC-1 Order Control Code. It provides an audit trail in case the request is entered incorrectly and the ancillary department needs to clarify the request. By local agreement, either the ID number or name component may be omitted.",
      "length": "250",
      "data_type": "XCN - Extended Composite ID Number and Name for Persons",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "11": {
      "field_id": "ORC.11",
      "name": "Verified By",
      "description": "This field contains the identity of the person who verified the accuracy of the entered request. Note that this refers to the current transaction as reflected in ORC-1 Order Control Code . It is used in cases where the request is entered by a technician and needs to be verified by a higher authority (e.g., a nurse). By local agreement, either the ID number or name component may be omitted.",
      "length": "250",
      "data_type": "XCN - Extended Composite ID Number and Name for Persons",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "12": {
      "field_id": "ORC.12",
      "name": "Ordering Provider",
      "description": "This field contains the identity of the person who is responsible for creating the request (i.e., ordering physician).",
      "length": "250",
      "data_type": "XCN - Extended Composite ID Number and Name for Persons",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "13": {
      "field_id": "ORC.13",
      "name": "Enterer's Location",
      "description": "This field specifies the location (e.g., nurse station, ancillary service location, clinic, floor) where the person who entered the request was physically located when the order was entered. Note that this refers to the current transaction as reflected in ORC-1 Order Control Code. Only those subcomponents relevant to enterer's location should be valued (commonly nursing unit; facility; building; floor). The person who entered the request is defined in ORC-10-entered by.",
      "length": "80",
      "data_type": "PL - Person Location",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "14": {
      "field_id": "ORC.14",
      "name": "Call Back Phone Number",
      "description": "This field contains the telephone number to call for clarification of a request or other information regarding the order. ORC-14-call back phone number is the same as OBR-17-order callback phone number.",
      "length": "250",
      "data_type": "XTN - Extended Telecommunication Number",
      "optionality": "Optional",
      "repeatability": "Repeatable twice"
    },
    "15": {
      "field_id": "ORC.15",
      "name": "Order Effective Date/Time",
      "description": "This field contains the date/time that the changes to the request took effect or are supposed to take effect.",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "16": {
      "field_id": "ORC.16",
      "name": "Order Control Code Reason",
      "description": "This field contains the explanation (either in coded or text form) of the reason for the order event described by the order control code (HL7 Table 0119). Whereas an NTE after the order-specific segment (e.g., RXO, ORO, OBR) would provide a comment for that specific segment, the purpose of the order control code reason is only to expand on the reason for the order event.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "17": {
      "field_id": "ORC.17",
      "name": "Entering Organization",
      "description": "This field identifies the organization that the enterer belonged to at the time he/she enters/maintains the order, such as medical group or department. The person who entered the request is defined in ORC-10 -entered by.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "18": {
      "field_id": "ORC.18",
      "name": "Entering Device",
      "description": "This field identifies the physical device (terminal, PC) used to enter the order.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "19": {
      "field_id": "ORC.19",
      "name": "Action By",
      "description": "This field contains the identity of the person who initiated the event represented by the corresponding order control code. For example, if the order control code is CA (cancel order request), this field represents the person who requested the order cancellation. This person is typically a care provider but may not always be the same as ORC-12 ordering provider.",
      "length": "250",
      "data_type": "XCN - Extended Composite ID Number and Name for Persons",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "20": {
      "field_id": "ORC.20",
      "name": "Advanced Beneficiary Notice Code",
      "description": "This field indicates the status of the patient's or the patient's representative's consent for responsibility to pay for potentially uninsured services. This element is introduced to satisfy CMS Medical Necessity requirements for outpatient services. This element indicates (a) whether the associated diagnosis codes for the service are subject to medical necessity procedures, (b) whether, for this type of service, the patient has been informed that they may be responsible for payment for the service, and (c) whether the patient agrees to be billed for this service. The values for this field are drawn from User-Defined Table 0339 - Advanced Beneficiary Notice Code .",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "21": {
      "field_id": "ORC.21",
      "name": "Ordering Facility Name",
      "description": "This field contains the name of the facility placing the order.",
      "length": "250",
      "data_type": "XON - Extended Composite Name and Identification Number for Organizations",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "22": {
      "field_id": "ORC.22",
      "name": "Ordering Facility Address",
      "description": "This field contains the address of the facility placing the order.",
      "length": "250",
      "data_type": "XAD - Extended Address",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "23": {
      "field_id": "ORC.23",
      "name": "Ordering Facility Phone Number",
      "description": "This field contains the telephone number of the facility placing the order.",
      "length": "250",
      "data_type": "XTN - Extended Telecommunication Number",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "24": {
      "field_id": "ORC.24",
      "name": "Ordering Provider Address",
      "description": "This field contains the address of the care provider requesting the order.",
      "length": "250",
      "data_type": "XAD - Extended Address",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "25": {
      "field_id": "ORC.25",
      "name": "Order Status Modifier",
      "description": "This field is a modifier or refiner of the ORC-5-Order status field. This field may be used to provide additional levels of specificity or additional information for the defined order status codes. Unlike the Order Status field, which is controlled by an HL7 defined table, this field is a CE data type allowing applications to support an unlimited library of Order Status Modifier codes.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "26": {
      "field_id": "ORC.26",
      "name": "Advanced Beneficiary Notice Override Reason",
      "description": "This field contains the reason why the patient did not sign an Advanced Beneficiary Notice. The reason may be coded or it may be a free text entry. Refer to HL7 Table 0552 - Advanced beneficiary notice override reason .\n\nCondition: This field is required if the value of ORC-20 Advanced Beneficiary Notice Code indicates that the notice was not signed. For example, additional qualifying or explanatory information would be justified if ORC-20 was populated with the values \"3\" or \"4\" in User-defined Table 0339 – Advanced Beneficiary Notice Code, or similar values in related external code tables.",
      "length": "60",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "27": {
      "field_id": "ORC.27",
      "name": "Filler's Expected Availability Date/Time",
      "description": "This field specifies the date/time the filler expects the services to be available. For example when a prescription is ready for pickup or when a supply will be sent or picked up, or for when a laboratory result is expected to be available.",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "28": {
      "field_id": "ORC.28",
      "name": "Confidentiality Code",
      "description": "This field contains information about the level of security and/or sensitivity surrounding the order (e.g., highly sensitive, not sensitive, sensitive, etc.). Refer to HL7 Table 0177 - Confidentiality Code for allowed values. The specific treatment of data with a particular confidentiality level is subject to site-specific negotiation.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "29": {
      "field_id": "ORC.29",
      "name": "Order Type",
      "description": "This field indicates whether the order is to be executed in an inpatient setting or an outpatient setting. If this field is not valued, the system default is assumed. Refer to HL7 Table 0482 - Order Type for suggested values.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "30": {
      "field_id": "ORC.30",
      "name": "Enterer Authorization Mode",
      "description": "This field indicates the form of authorization a recorder had from the responsible practitioner to create or change an order. Refer to HL7 Table 0483 Authorization Mode for suggested values.",
      "length": "250",
      "data_type": "CNE - Coded with No Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "31": {
      "field_id": "ORC.31",
      "name": "Parent Universal Service Identifier",
      "description": "This field contains the identifier code for the parent order, as identified in ORC-8 Parent (if present), which caused this observation/test/battery to be performed. This can be based on local and/or “universal” codes. We recommend the “universal” service identifier.\" Note that ORC-8, Parent, does not have to be present for ORC-31 to be used.\n\nORC-31 - parent universal service identifier is the same as OBR-50 - parent universal service identifier. If both fields are valued, they must contain the same value.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    }
  },
  "OBR": {
    "1": {
      "field_id": "OBR.1",
      "name": "Set ID - OBR",
      "description": "For the first order transmitted, the sequence number shall be 1; for the second order, it shall be 2; and so on.",
      "length": "4",
      "data_type": "SI - Sequence ID",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "OBR.2",
      "name": "Placer Order Number",
      "description": "This field is identical to ORC-2-Placer Order Number.\n\nORC-2-placer order number is the same as OBR-2-placer order number. If the placer order number is not present in the ORC, it must be present in the associated OBR and vice versa. If both fields, ORC-2-placer order number and OBR-2-placer order number, are valued, they must contain the same value. When results are transmitted in an ORU message, an ORC is not required, and the identifying placer order number must be present in the OBR segments.",
      "length": "22",
      "data_type": "EI - Entity Identifier",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "OBR.3",
      "name": "Filler Order Number",
      "description": "This field is the order number associated with the filling application. This is a permanent identifier for an order and its associated observations. It is a special case of the Entity Identifier data type (see Chapter 2, Section 2.A.28, \"EI - entity identifier\").\n\nOBR-3-filler order number is identical to ORC-3-filler order number. If the filler order number is not present in the ORC, it must be present in the associated OBR. (This rule is the same for other identical fields in the ORC and OBR and promotes upward and ASTM compatibility.) This is particularly important when results are transmitted in an ORU message. In this case, the ORC is not required and the identifying filler order number must be present in the OBR segments.",
      "length": "22",
      "data_type": "EI - Entity Identifier",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "4": {
      "field_id": "OBR.4",
      "name": "Universal Service Identifier",
      "description": "This field contains the identifier code for the requested observation/test/battery. This can be based on local and/or \"universal\" codes. We recommend the \"universal\" procedure identifier. The structure of this CE data type is described in the control section.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "OBR.5",
      "name": "Priority - OBR",
      "description": "This field has been retained for backward compatibility only . It is not used. Previously priority (e.g., STAT, ASAP), but this information is carried as the sixth component of OBR-27-quantity/timing.",
      "length": "2",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    },
    "6": {
      "field_id": "OBR.6",
      "name": "Requested Date/Time",
      "description": "This field has been retained for backward compatibility only . It is not used. Previously requested date/time. This information is now carried in the fourth component of the OBR-27-quantity/timing.",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    },
    "7": {
      "field_id": "OBR.7",
      "name": "Observation Date/Time",
      "description": "This field is the clinically relevant date/time of the observation. In the case of observations taken directly from a subject, it is the actual date and time the observation was obtained. In the case of a specimen-associated study, this field shall represent the date and time the specimen was collected or obtained. (This is a results-only field except when the placer or a third party has already drawn the specimen.) This field is conditionally required. When the OBR is transmitted as part of a report message, the field must be filled in. If it is transmitted as part of a request and a sample has been sent along as part of the request, this field must be filled in because this specimen time is the physiologically relevant date/time of the observation.",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "8": {
      "field_id": "OBR.8",
      "name": "Observation End Date/Time",
      "description": "This field contains the end date and time of a study or timed specimen collection. If an observation takes place over a substantial period of time, it will indicate when the observation period ended. For observations made at a point in time, it will be null. This is a results field except when the placer or a party other than the filler has already drawn the specimen.",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "9": {
      "field_id": "OBR.9",
      "name": "Collection Volume",
      "description": "For laboratory tests, the collection volume is the volume of a specimen. The default unit is ML. Specifically, units should be expressed in the ISO Standard unit abbreviations (ISO-2955, 1977). This is a results-only field except when the placer or a party has already drawn the specimen.",
      "length": "20",
      "data_type": "CQ - Composite Quantity with Units",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "10": {
      "field_id": "OBR.10",
      "name": "Collector Identifier",
      "description": "When a specimen is required for the study, this field will identify the person, department, or facility that collected the specimen. Either name or ID code, or both, may be present.",
      "length": "250",
      "data_type": "XCN - Extended Composite ID Number and Name for Persons",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "11": {
      "field_id": "OBR.11",
      "name": "Specimen Action Code",
      "description": "This field identifies the action to be taken with respect to the specimens that accompany or precede this order. The purpose of this field is to further qualify (when appropriate) the general action indicated by the order control code contained in the accompanying ORC segment. For example, when a new order (ORC - \"NW\") is sent to the lab, this field would be used to tell the lab whether or not to collect the specimen (\"L\" or \"O\"). Refer to HL7 Table 0065 - Specimen Action Code for valid values.",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "12": {
      "field_id": "OBR.12",
      "name": "Danger Code",
      "description": "This field contains the code and/or text indicating any known or suspected patient or specimen hazards, e.g., patient with active tuberculosis or blood from a hepatitis patient. Either code and/or text may be absent. However, the code is always placed in the first component position and any free text in the second component. Thus, free text without a code must be preceded by a component delimiter.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "13": {
      "field_id": "OBR.13",
      "name": "Relevant Clinical Information",
      "description": "This field contains the additional clinical information about the patient or specimen. This field is used to report the suspected diagnosis and clinical findings on requests for interpreted diagnostic studies. Examples include reporting the amount of inspired carbon dioxide for blood gasses, the point in the menstrual cycle for cervical pap tests, and other conditions that influence test interpretations. For some orders this information may be sent on a more structured form as a series of OBX segments that immediately follow the order segment.",
      "length": "300",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "14": {
      "field_id": "OBR.14",
      "name": "Specimen Received Date/Time",
      "description": "This field has been retained for backward compatibility only . As of version 2.5, in messages where the SPM segment is present, the use of SPM-18 Specimen Received Date/Time is favored over this field",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    },
    "15": {
      "field_id": "OBR.15",
      "name": "Specimen Source",
      "description": "This field has been retained for backward compatibility only. As of version 2.5, in messages where the SPM segment is present, the use of SPM Specimen segment is favored over this field",
      "length": "300",
      "data_type": "SPS - Specimen Source",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    },
    "16": {
      "field_id": "OBR.16",
      "name": "Ordering Provider",
      "description": "This field identifies the provider who ordered the test. Either the ID code or the name, or both, may be present. This is the same as ORC-12-ordering provider.",
      "length": "250",
      "data_type": "XCN - Extended Composite ID Number and Name for Persons",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "17": {
      "field_id": "OBR.17",
      "name": "Order Callback Phone Number",
      "description": "This field contains the telephone number for reporting a status or a result using the standard format with extension and/or beeper number when applicable.",
      "length": "250",
      "data_type": "XTN - Extended Telecommunication Number",
      "optionality": "Optional",
      "repeatability": "Repeatable twice"
    },
    "18": {
      "field_id": "OBR.18",
      "name": "Placer Field 1",
      "description": "This field is user field #1. Text sent by the placer will be returned with the results.",
      "length": "60",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "19": {
      "field_id": "OBR.19",
      "name": "Placer Field 2",
      "description": "This field is similar to placer field #1.",
      "length": "60",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "20": {
      "field_id": "OBR.20",
      "name": "Filler Field 1",
      "description": "This field is definable for any use by the filler (diagnostic service).",
      "length": "60",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "21": {
      "field_id": "OBR.21",
      "name": "Filler Field 2",
      "description": "This field is similar to filler field #1.",
      "length": "60",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "22": {
      "field_id": "OBR.22",
      "name": "Results Rpt/Status Chng - Date/Time",
      "description": "This field specifies the date/time when the results were reported or status changed. This field is used to indicate the date and time that the results are composed into a report and released, or that a status, as defined in ORC-5 order status, is entered or changed. (This is a results field only.) When other applications (such as office or clinical database applications) query the laboratory application for untransmitted results, the information in this field may be used to control processing on the communications link. Usually, the ordering service would want only those results for which the reporting date/time is greater than the date/time the inquiring application last received results.",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "23": {
      "field_id": "OBR.23",
      "name": "Charge to Practice",
      "description": "This field is the charge to the ordering entity for the studies performed when applicable. The first component is a dollar amount when known by the filler. The second is a charge code when known by the filler (results only).",
      "length": "40",
      "data_type": "MOC - Money and Code",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "24": {
      "field_id": "OBR.24",
      "name": "Diagnostic Serv Sect ID",
      "description": "This field is the section of the diagnostic service where the observation was performed. If the study was performed by an outside service, the identification of that service should be recorded here. Refer to HL7 Table 0074 - Diagnostic Service Section ID for valid entries.",
      "length": "10",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "25": {
      "field_id": "OBR.25",
      "name": "Result Status",
      "description": "This field contains the status of results for this order. This conditional field is required whenever the OBR is contained in a report message. It is not required as part of an initial order.\n\nThere are two methods of sending status information. If the status is that of the entire order, use ORC-15order effective date/time and ORC-5-order status. If the status pertains to the order detail segment, use OBR-25-result status and OBR-22-results rpt/status chng - date/time. If both are present, the OBR values override the ORC values.",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "26": {
      "field_id": "OBR.26",
      "name": "Parent Result",
      "description": "This field is defined to make it available for other types of linkages (e.g., toxicology). This important information, together with the information in OBR-29-parent, uniquely identifies the parent result's OBX segment related to this order. The value of this OBX segment in the parent result is the organism or chemical species about which this battery reports. For example, if the current battery is an antimicrobial susceptibility, the parent results identified OBX contains a result which identifies the organism on which the susceptibility was run. This indirect linkage is preferred because the name of the organism in the parent result may undergo several preliminary values prior to finalization.",
      "length": "400",
      "data_type": "PRL - Parent Result Link",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "27": {
      "field_id": "OBR.27",
      "name": "Quantity/Timing",
      "description": "This field is retained for backward compatibility only. The reader is referred to the TQ1 and TQ2 segments.",
      "length": "200",
      "data_type": "TQ - Timing Quantity",
      "optionality": "Backward Compatibility",
      "repeatability": "Repeatable indefinitely"
    },
    "28": {
      "field_id": "OBR.28",
      "name": "Result Copies To",
      "description": "This field identifies the people who are to receive copies of the results. By local convention, either the ID number or the name may be absent.",
      "length": "250",
      "data_type": "XCN - Extended Composite ID Number and Name for Persons",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "29": {
      "field_id": "OBR.29",
      "name": "Parent",
      "description": "This field is identical to ORC-8-parent. This field relates a child to its parent when a parent-child relationship exists. For example, observations that are spawned by previous observations, e.g., antimicrobial susceptibilities spawned by blood cultures, need to record the parent (blood culture) filler order number here. The parent-child mechanism is described under the order control field notes. It is required when the order is a child.",
      "length": "200",
      "data_type": "EIP - Entity Identifier Pair",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "30": {
      "field_id": "OBR.30",
      "name": "Transportation Mode",
      "description": "This field identifies how (or whether) to transport a patient, when applicable. Refer to HL7 Table 0124 - Transportation Mode for valid codes.",
      "length": "20",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "31": {
      "field_id": "OBR.31",
      "name": "Reason for Study",
      "description": "This field is the code or text using the conventions for coded fields. This is required for some studies to obtain proper reimbursement.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "32": {
      "field_id": "OBR.32",
      "name": "Principal Result Interpreter",
      "description": "This field identifies the physician or other clinician who interpreted the observation and is responsible for the report content.",
      "length": "200",
      "data_type": "NDL - Name with Date and Location",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "33": {
      "field_id": "OBR.33",
      "name": "Assistant Result Interpreter",
      "description": "This field identifies the clinical observer who assisted with the interpretation of this study.",
      "length": "200",
      "data_type": "NDL - Name with Date and Location",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "34": {
      "field_id": "OBR.34",
      "name": "Technician",
      "description": "This field identifies the performing technician.",
      "length": "200",
      "data_type": "NDL - Name with Date and Location",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "35": {
      "field_id": "OBR.35",
      "name": "Transcriptionist",
      "description": "This field identifies the report transcriber.",
      "length": "200",
      "data_type": "NDL - Name with Date and Location",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "36": {
      "field_id": "OBR.36",
      "name": "Scheduled Date/Time",
      "description": "This field is the date/time the filler scheduled an observation, when applicable (e.g., action code in OBR-11-specimen action code = \"S\"). This is a result of a request to schedule a particular test and provides a way to inform the placer of the date/time a study is scheduled (result only).",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "37": {
      "field_id": "OBR.37",
      "name": "Number of Sample Containers",
      "description": "This field identifies the number of containers for a given sample. For sample receipt verification purposes; may be different from the total number of samples which accompany the order.",
      "length": "4",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "38": {
      "field_id": "OBR.38",
      "name": "Transport Logistics of Collected Sample",
      "description": "This field is the means by which a sample reaches the diagnostic service provider. This information is to aid the lab in scheduling or interpretation of results. Possible answers: routine transport van, public postal service, etc. If coded, requires a user-defined table.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "39": {
      "field_id": "OBR.39",
      "name": "Collector's Comment",
      "description": "This field is for reporting additional comments related to the sample. If coded, requires a user-defined table. If only free text is reported, it is placed in the second component with a null in the first component, e.g., ^difficult clotting after venipuncture and ecchymosis .",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "40": {
      "field_id": "OBR.40",
      "name": "Transport Arrangement Responsibility",
      "description": "This field is an indicator of who is responsible for arranging transport to the planned diagnostic service. Examples: Requester, Provider, Patient. If coded, requires a user-defined table.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "41": {
      "field_id": "OBR.41",
      "name": "Transport Arranged",
      "description": "This field is an indicator of whether transport arrangements are known to have been made. Refer toHL7 Table 0224 - Transport Arranged for valid codes.",
      "length": "30",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "42": {
      "field_id": "OBR.42",
      "name": "Escort Required",
      "description": "This field is an indicator that the patient needs to be escorted to the diagnostic service department. Note: The nature of the escort requirements should be stated in OBR-43- planned patient transport comment . See HL7 Table 0225 - Escort Required for valid values.",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "43": {
      "field_id": "OBR.43",
      "name": "Planned Patient Transport Comment",
      "description": "This field is the code or free text comments on special requirements for the transport of the patient to the diagnostic service department. If coded, requires a user-defined table.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "44": {
      "field_id": "OBR.44",
      "name": "Procedure Code",
      "description": "This field contains a unique identifier assigned to the procedure, if any, associated with the charge. Refer to User-defined table 0088 - Procedure code for suggested values. This field is a CE data type for compatibility with clinical and ancillary systems.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "45": {
      "field_id": "OBR.45",
      "name": "Procedure Code Modifier",
      "description": "This field contains the procedure code modifier to the procedure code reported in OBR-44-procedure code, when applicable. Procedure code modifiers are defined by regulatory agencies such as CMS and the AMA. Multiple modifiers may be reported. The modifiers are sequenced in priority according to user entry. In the USA, this is a requirement of the UB and the 1500 claim forms. Multiple modifiers are allowed and the order placed on the form affects reimbursement . Refer to user-defined table 0340 - Procedure code modifier for suggested values.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "46": {
      "field_id": "OBR.46",
      "name": "Placer Supplemental Service Information",
      "description": "This field contains supplemental service information sent from the placer system to the filler system for the universal procedure code reported in OBR-4 Universal Service ID. This field will be used to provide ordering information detail that is not available in other, specific fields in the OBR segment. Multiple supplemental service information elements may be reported. Refer to User-defined Table 0411 - Supplemental service information values .",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "47": {
      "field_id": "OBR.47",
      "name": "Filler Supplemental Service Information",
      "description": "This field contains supplemental service information sent from the filler system to the placer system for the procedure code reported in OBR-4 Universal Service ID. This field will be used to report ordering information details that is not available in other, specific fields in the OBR segment. Typically it will reflect the same information as was sent to the filler system in OBR-46-Placer supplemental information unless the order was modified in which case the filler system will report what was actually performed using this field. Multiple supplemental service information elements may be reported. Refer to User-Defined Table 0411 - Supplemental Service Information Values .",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "48": {
      "field_id": "OBR.48",
      "name": "Medically Necessary Duplicate Procedure Reason.",
      "description": "This field is used to document why the procedure found in OBR-44 - Procedure Code is a duplicate of one ordered/charged previously for the same patient within the same date of service and has been determined to be medically necessary. The reason may be coded or it may be a free text entry.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "49": {
      "field_id": "OBR.49",
      "name": "Result Handling",
      "description": "Transmits information regarding the handling of the result. For example, an order may specify that the result (e.g., an x-ray film) should be given to the patient for return to the requestor. Refer to User-defined Table 0507 Observation Result Handling for suggested values. If this field is not populated then routine handling is implied.",
      "length": "2",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "50": {
      "field_id": "OBR.50",
      "name": "Parent Universal Service Identifier",
      "description": "This field contains the universal service identifier code for the parent order, as identified in ORC-8 Parent and/or OBR-29 Parent (if present), which caused this observation/test/battery to be performed. This can be based on local and/or “universal” codes. HL7 recommends the “universal” service identifier.\"\n\nORC-31 - parent universal service identifier is the same as OBR-50 - parent universal service identifier. If both fields are valued, they must contain the same value.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    }
  },
  "OBX": {
    "1": {
      "field_id": "OBX.1",
      "name": "Set ID - OBX",
      "description": "This field contains the sequence number. For compatibility with ASTM.",
      "length": "4",
      "data_type": "SI - Sequence ID",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "OBX.2",
      "name": "Value Type",
      "description": "This field contains the format of the observation value in OBX. It must be valued if OBX-11-Observ result status is not valued with an X. If the value is CE then the result must be a coded entry. When the value type is TX or FT then the results are bulk text. The valid values for the value type of an observation are listed in HL7 Table 0125 - Value Type.",
      "length": "2",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "OBX.3",
      "name": "Observation Identifier",
      "description": "This field contains a unique identifier for the observation. The format is that of the Coded Element (CE). Example: 8625-6^P-R interval^LN.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "4": {
      "field_id": "OBX.4",
      "name": "Observation Sub-ID",
      "description": "This field is used to distinguish between multiple OBX segments with the same observation ID organized under one OBR. For example, a chest X-ray report might include three separate diagnostic impressions. The standard requires three OBX segments, one for each impression. By putting a 1 in the Sub-ID of the first of these OBX segments, 2 in the second, and 3 in the third, we can uniquely identify each OBX segment for editing or replacement.",
      "length": "20",
      "data_type": "ST - String Data",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "OBX.5",
      "name": "Observation Value",
      "description": "This field contains the value observed by the observation producer. OBX-2-value type contains the data type for this field according to which observation value is formatted. It is not a required field because some systems will report only the normalcy/abnormalcy (OBX-8), especially in product experience reporting. The length of the observation field is variable, depending upon OBX-3-value type. This field may repeat for multipart, single answer results with appropriate data types, e.g., CE, TX, and FT data types.",
      "length": "99999",
      "data_type": "VARIES - Variable Datatype",
      "optionality": "Conditional",
      "repeatability": "Repeatable indefinitely"
    },
    "6": {
      "field_id": "OBX.6",
      "name": "Units",
      "description": "When an observation’s value is measured on a continuous scale, one must report the measurement units within the units field of the OBX segment. Since HL7 Version 2.2 of the specification, all fields that contain units are of data type CE. The default coding system for the units codes consists of the ISO abbreviation for a single case unit (ISO 2955-83) plus extensions that do not collide with ISO abbreviations. We designate this coding system as ISO+ (see Figure 7-9). Both the ISO unit’s abbreviations and the extensions are defined in Section 7.4.2.6.2, “ISO and ANSI customary units abbreviations.” The ISO+ abbreviations are the codes for the default coding system. Consequently, when ISO+ units are being used, only ISO+ abbreviations need be sent, and the contents of the units field will be backward compatible to HL7 Version 2.1.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "7": {
      "field_id": "OBX.7",
      "name": "References Range",
      "description": "When the observation quantifies the amount of a toxic substance, then the upper limit of the range identifies the toxic limit. If the observation quantifies a drug, the lower limits identify the lower therapeutic bounds and the upper limits represent the upper therapeutic bounds above which toxic side effects are common.",
      "length": "60",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "8": {
      "field_id": "OBX.8",
      "name": "Abnormal Flags",
      "description": "This field contains a table lookup indicating the normalcy status of the result. We strongly recommend sending this value when applicable. (See ASTM 1238 - review for more details). Refer to User-defined Table 0078 - Abnormal flags for valid entries.",
      "length": "5",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "9": {
      "field_id": "OBX.9",
      "name": "Probability",
      "description": "This field contains the probability of a result being true for results with categorical values. It mainly applies to discrete coded results. It is a decimal number represented as an ASCII string that must be between 0 and 1, inclusive.",
      "length": "5",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "10": {
      "field_id": "OBX.10",
      "name": "Nature of Abnormal Test",
      "description": "This field contains the nature of the abnormal test. Refer to HL7 Table 0080 - Nature of abnormal testing for valid values. As many of the codes as apply may be included, separated by repeat delimiters. For example, normal values based on age, sex, and race would be codes as A~S~R.",
      "length": "2",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "11": {
      "field_id": "OBX.11",
      "name": "Observation Result Status",
      "description": "This field contains the observation result status. Refer to HL7 table 0085 - Observation result status codes interpretation for valid values. This field reflects the current completion status of the results for one Observation Identifier.",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "12": {
      "field_id": "OBX.12",
      "name": "Effective Date of Reference Range",
      "description": "This field contains the date (and, optionally, the time) on which the values in OBX-7-reference range went into effect.",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "13": {
      "field_id": "OBX.13",
      "name": "User Defined Access Checks",
      "description": "This field permits the producer to record results-dependent codes for classifying the observation at the receiving system. This field should be needed only rarely, because most classifications are fixed attributes of the observation ID and can be defined in the associated observation master file.",
      "length": "20",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "14": {
      "field_id": "OBX.14",
      "name": "Date/Time of the Observation",
      "description": "This field is required in two circumstances. The first is when the observations reported beneath one report header (OBR) have different dates/times. This could occur in the case of queries, timed test sequences, or clearance studies where one measurement within a battery may have a different time than another measurement.",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "15": {
      "field_id": "OBX.15",
      "name": "Producer's ID",
      "description": "This field contains a unique identifier of the responsible producing service. It should be reported explicitly when the test results are produced at outside laboratories, for example. When this field is null, the receiving system assumes that the observations were produced by the sending organization. This information supports CLIA regulations in the US. The code for producer ID is recorded as a CE data type. In the US, the Medicare number of the producing service is suggested as the identifier.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "16": {
      "field_id": "OBX.16",
      "name": "Responsible Observer",
      "description": "When required, this field contains the identifier of the individual directly responsible for the observation (i.e., the person who either performed or verified it). In a nursing service, the observer is usually the professional who performed the observation (e.g., took the blood pressure). In a laboratory, the observer is the technician who performed or verified the analysis. The code for the observer is recorded as a CE data type. If the code is sent as a local code, it should be unique and unambiguous when combined with OBX-15-producer ID .",
      "length": "250",
      "data_type": "XCN - Extended Composite ID Number and Name for Persons",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "17": {
      "field_id": "OBX.17",
      "name": "Observation Method",
      "description": "This optional field can be used to transmit the method or procedure by which an observation was obtained when the sending system wishes to distinguish among one measurement obtained by different methods and the distinction is not implicit in the test ID. Chemistry laboratories do not usually distinguish between two different methods used to measure a given serum constituent (e.g., serum potassium) as part of the test name. See the LOINC® Users Manual3 for a more complete discussion of these distinctions. If an observation producing service wanted to report the method used to obtain a particular observation, and the method was NOT embedded in the test name, they can use this field",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "18": {
      "field_id": "OBX.18",
      "name": "Equipment Instance Identifier",
      "description": "This field identifies the Equipment Instance (e.g., Analyzer, Analyzer module, group of Analyzers,...) responsible for the production of the observation. This is the identifier from an institution's master list of equipment, where the institution is specified by the namespace ID or if it is blank, then by the Producers ID (OBX-15). It should be possible to retrieve from this master list the equipment type, serial number, etc., however it is not planned to transfer this information with every OBX. The repeating of this field allows for the hierarchical representation of the equipment (lowest level first), e.g., module of an instrument, instrument consisting of modules, cluster of multiple instruments, etc.",
      "length": "22",
      "data_type": "EI - Entity Identifier",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "19": {
      "field_id": "OBX.19",
      "name": "Date/Time of the Analysis",
      "description": "This field is used to transfer the time stamp associated with generation of the analytical result by the instrument specified in Equipment Instance Identifier (see above).",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "20": {
      "field_id": "OBX.20",
      "name": "Reserved for harmonization with V2.6",
      "description": "No description found.",
      "length": "0",
      "data_type": "ST - String Data",
      "optionality": "Not Supported",
      "repeatability": "Not repeatable"
    },
    "21": {
      "field_id": "OBX.21",
      "name": "Reserved for harmonization with V2.6",
      "description": "No description found.",
      "length": "0",
      "data_type": "ST - String Data",
      "optionality": "Not Supported",
      "repeatability": "Not repeatable"
    },
    "22": {
      "field_id": "OBX.22",
      "name": "Reserved for harmonization with V2.6",
      "description": "No description found.",
      "length": "0",
      "data_type": "ST - String Data",
      "optionality": "Not Supported",
      "repeatability": "Not repeatable"
    },
    "23": {
      "field_id": "OBX.23",
      "name": "Performing Organization Name",
      "description": "This field contains the name of the organization/service responsible for performing the service. When this field is null, the receiving system assumes that the observations were produced by the sending organization. The information for performing organization is recorded as an XON data type. In the US, the Medicare number of the performing organization is suggested as the identifier (component 10).",
      "length": "567",
      "data_type": "XON - Extended Composite Name and Identification Number for Organizations",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "24": {
      "field_id": "OBX.24",
      "name": "Performing Organization Address",
      "description": "This field contains the address of the organization/service responsible for performing the service.\n\nFor labs, this field specifies the address of the laboratory that produced the test result described in this OBX segment. It should be reported explicitly when the test results are produced at outside laboratories, for example. This information supports CLIA regulations in the US.",
      "length": "631",
      "data_type": "XAD - Extended Address",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "25": {
      "field_id": "OBX.25",
      "name": "Performing Organization Medical Director",
      "description": "This field contains the medical director of the organization/service responsible for performing the service.\n\nFor labs, this field specifies the medical director of the laboratory that produced the test result described in this OBX segment. This field is different than OBX-16 in that OBX-16 identifies the individual who performed the lab test (made the observation) whereas this field identifies the individual who is the medical director of the organization responsible for the result. It should be reported explicitly when the test results are produced at outside laboratories, for example. This information supports CLIA regulations in the US",
      "length": "3002",
      "data_type": "XCN - Extended Composite ID Number and Name for Persons",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    }
  },
  "PV1": {
    "1": {
      "field_id": "PV1.1",
      "name": "Set ID - PV1",
      "description": "This field contains the number that identifies this transaction. For the first occurrence of the segment, the sequence number shall be one, for the second occurrence, the sequence number shall be two, etc.",
      "length": "4",
      "data_type": "SI - Sequence ID",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "PV1.2",
      "name": "Patient Class",
      "description": "This field is used by systems to categorize patients by site. It does not have a consistent industry-wide definition. It is subject to site-specific variations. Refer to User-defined Table 0004 - Patient Class for suggested values.",
      "length": "1",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "PV1.3",
      "name": "Assigned Patient Location",
      "description": "This field contains the patients initial assigned location or the location to which the patient is being moved. The first component may be the nursing station for inpatient locations, or clinic or department, for locations other than inpatient. For canceling a transaction or discharging a patient, the current location (after the cancellation event or before the discharge event) should be in this field. If a value exists in the fifth component (location status), it supersedes the value in PV1-40 - Bed Status.",
      "length": "80",
      "data_type": "PL - Person Location",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "4": {
      "field_id": "PV1.4",
      "name": "Admission Type",
      "description": "This field indicates the circumstances under which the patient was or will be admitted. Refer to User-defined Table 0007 - Admission Type for suggested values. In the US, it is recommended to report the UB92 FL 19 Type of Admission in this field.",
      "length": "2",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "PV1.5",
      "name": "Preadmit Number",
      "description": "This field uniquely identifies the patients pre-admit account. Some systems will continue to use the pre-admit number as the billing number after the patient has been admitted. For backward compatibility, a ST data type can be sent; however HL7 recommends use of the CX data type, like the account number, for new implementations. The assigning authority and identifier type codes are strongly recommended for all CX data types.",
      "length": "250",
      "data_type": "CX - Extended Composite ID with Check Digit",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "6": {
      "field_id": "PV1.6",
      "name": "Prior Patient Location",
      "description": "This field contains the prior patient location if the patient is being transferred. The old location is null if the patient is new. If a value exists in the fifth component (location status), it supersedes the value in PV1-40 - Bed Status.",
      "length": "80",
      "data_type": "PL - Person Location",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "7": {
      "field_id": "PV1.7",
      "name": "Attending Doctor",
      "description": "This field contains the attending physician information. Multiple names and identifiers for the same physician may be sent. The field sequences are not used to indicate multiple attending doctors. The legal name must be sent in the first sequence. If the legal name is not sent, then a repeat delimiter must be sent in the first sequence. Depending on local agreements, either ID or the name may be absent in this field. Refer to User-defined Table 0010 - Physician ID for suggested values.",
      "length": "250",
      "data_type": "XCN - Extended Composite ID Number and Name for Persons",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "8": {
      "field_id": "PV1.8",
      "name": "Referring Doctor",
      "description": "This field contains the referring physician information. Multiple names and identifiers for the same physician may be sent. The field sequences are not used to indicate multiple referring doctors. The legal name must be sent in the first sequence. If the legal name is not sent, then a repeat delimiter must be sent in the first sequence. Depending on local agreements, either the ID or the name may be absent from this field. Refer to User-defined Table 0010 - Physician ID for suggested values.",
      "length": "250",
      "data_type": "XCN - Extended Composite ID Number and Name for Persons",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "9": {
      "field_id": "PV1.9",
      "name": "Consulting Doctor",
      "description": "From V2.4 onward, this field has been retained for backward compatibility only. It is recommended to use the ROL - Role segment for consulting physicians instead. This field contains the consulting physician information. The field sequences are used to indicate multiple consulting doctors. Depending on local agreements, either the ID or the name may be absent from this field. Refer to User-defined Table 0010 - Physician ID for suggested values.",
      "length": "250",
      "data_type": "XCN - Extended Composite ID Number and Name for Persons",
      "optionality": "Backward Compatibility",
      "repeatability": "Repeatable indefinitely"
    },
    "10": {
      "field_id": "PV1.10",
      "name": "Hospital Service",
      "description": "This field contains the treatment or type of surgery that the patient is scheduled to receive. It is a required field with trigger events A01 (admit/visit notification), A02 (transfer a patient), A14 (pending admit), A15 (pending transfer). Refer to User-defined Table 0069 - Hospital Service for suggested values.",
      "length": "3",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "11": {
      "field_id": "PV1.11",
      "name": "Temporary Location",
      "description": "This field contains a location other than the assigned location required for a temporary period of time (e.g., OR, operating theatre, etc.). If a value exists in the fifth component (location status), it supersedes the value in PV1-40 - Bed Status.",
      "length": "80",
      "data_type": "PL - Person Location",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "12": {
      "field_id": "PV1.12",
      "name": "Preadmit Test Indicator",
      "description": "This field indicates whether the patient must have pre-admission testing done in order to be admitted. Refer to User-defined Table 0087 - Pre-Admit Test Indicator for suggested values.",
      "length": "2",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "13": {
      "field_id": "PV1.13",
      "name": "Re-admission Indicator",
      "description": "This field indicates that a patient is being re-admitted to the healthcare facility and gives the circumstances. We suggest using R for readmission or else null. Refer to User-defined Table 0092 - Re-Admission Indicator for suggested values.",
      "length": "2",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "14": {
      "field_id": "PV1.14",
      "name": "Admit Source",
      "description": "This field indicates where the patient was admitted. Refer to User-defined Table 0023 - Admit Source for suggested values. In the US, this field is used on UB92 FL20 Source of Admission. The UB codes listed as examples are not an exhaustive or current list; refer to a UB specification for additional information.",
      "length": "6",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "15": {
      "field_id": "PV1.15",
      "name": "Ambulatory Status",
      "description": "This field indicates any permanent or transient handicapped conditions. Refer to User-defined Table 0009 - Ambulatory Status for suggested entries.",
      "length": "2",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "16": {
      "field_id": "PV1.16",
      "name": "VIP Indicator",
      "description": "This field identifies the type of VIP. Refer to User-defined Table 0099 - VIP Indicator for suggested values.",
      "length": "2",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "17": {
      "field_id": "PV1.17",
      "name": "Admitting Doctor",
      "description": "This field contains the admitting physician information. Multiple names and identifiers for the same physician may be sent. The field sequences are not used to indicate multiple admitting doctors. The legal name must be sent in the first sequence. If the legal name is not sent, then a repeat delimiter must be sent in the first sequence. By local agreement, the name or ID may be absent in this field. Refer to User-defined Table 0010 - Physician ID for suggested values.",
      "length": "250",
      "data_type": "XCN - Extended Composite ID Number and Name for Persons",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "18": {
      "field_id": "PV1.18",
      "name": "Patient Type",
      "description": "This field contains site-specific values that identify the patient type. Refer to User-defined Table 0018 - Patient Type for suggested values.",
      "length": "2",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "19": {
      "field_id": "PV1.19",
      "name": "Visit Number",
      "description": "For backward compatibility, a NM data type may be sent, but HL7 recommends that new implementations use the CX data type. This field contains the unique number assigned to each patient visit. The assigning authority and identifier type code are strongly recommended for all CX data types.",
      "length": "250",
      "data_type": "CX - Extended Composite ID with Check Digit",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "20": {
      "field_id": "PV1.20",
      "name": "Financial Class",
      "description": "This field contains the financial class(es) assigned to the patient for the purpose of identifying sources of reimbursement. Refer to User-defined Table 0064 - Financial Class for suggested values.",
      "length": "50",
      "data_type": "FC - Financial Class",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "21": {
      "field_id": "PV1.21",
      "name": "Charge Price Indicator",
      "description": "This field contains the code used to determine which price schedule is to be used for room and bed charges. Refer to User-defined Table 0032 - Charge/Price Indicator for suggested values.",
      "length": "2",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "22": {
      "field_id": "PV1.22",
      "name": "Courtesy Code",
      "description": "This field indicates whether the patient will be extended certain special courtesies. Refer to User-defined Table 0045 - Courtesy Code for suggested values.",
      "length": "2",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "23": {
      "field_id": "PV1.23",
      "name": "Credit Rating",
      "description": "This field contains the user-defined code to determine past credit experience. Refer to User-defined Table 0046 - Credit Rating for suggested values.",
      "length": "2",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "24": {
      "field_id": "PV1.24",
      "name": "Contract Code",
      "description": "This field identifies the type of contract entered into by the healthcare facility and the guarantor for the purpose of settling outstanding account balances. Refer to User-defined Table 0044 - Contract Code for suggested values.",
      "length": "2",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "25": {
      "field_id": "PV1.25",
      "name": "Contract Effective Date",
      "description": "This field contains the date that the contract is to start or started.",
      "length": "8",
      "data_type": "DT - Date",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "26": {
      "field_id": "PV1.26",
      "name": "Contract Amount",
      "description": "This field contains the amount to be paid by the guarantor each period according to the contract.",
      "length": "12",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "27": {
      "field_id": "PV1.27",
      "name": "Contract Period",
      "description": "This field specifies the duration of the contract for user-defined periods.",
      "length": "3",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "28": {
      "field_id": "PV1.28",
      "name": "Interest Code",
      "description": "This field indicates the amount of interest that will be charged the guarantor on any outstanding amounts. Refer to User-defined Table 0073 - Interest Rate Code for suggested values.",
      "length": "2",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "29": {
      "field_id": "PV1.29",
      "name": "Transfer to Bad Debt Code",
      "description": "This field indicates that the account was transferred to bad debts and gives the reason. Refer to User-defined Table 0110 - Transfer to Bad Debt Code for suggested values.",
      "length": "4",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "30": {
      "field_id": "PV1.30",
      "name": "Transfer to Bad Debt Date",
      "description": "This field contains the date that the account was transferred to a bad debt status.",
      "length": "8",
      "data_type": "DT - Date",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "31": {
      "field_id": "PV1.31",
      "name": "Bad Debt Agency Code",
      "description": "This field can be used as a ST type for backward compatibility. This field uniquely identifies the bad debt agency to which the account was transferred. This code is site defined. One possible implementation would be to edit against a table such as User-defined Table 0021 - Bad Debt Agency Code ; however, this is not required.",
      "length": "10",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "32": {
      "field_id": "PV1.32",
      "name": "Bad Debt Transfer Amount",
      "description": "This field contains the amount that was transferred to a bad debt status.",
      "length": "12",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "33": {
      "field_id": "PV1.33",
      "name": "Bad Debt Recovery Amount",
      "description": "This field contains the amount recovered from the guarantor on the account.",
      "length": "12",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "34": {
      "field_id": "PV1.34",
      "name": "Delete Account Indicator",
      "description": "This field indicates that the account was deleted from the file and gives the reason. Refer to User-defined Table 0111 - Delete Account Code for suggested values.",
      "length": "1",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "35": {
      "field_id": "PV1.35",
      "name": "Delete Account Date",
      "description": "This field contains the date that the account was deleted from the file.",
      "length": "8",
      "data_type": "DT - Date",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "36": {
      "field_id": "PV1.36",
      "name": "Discharge Disposition",
      "description": "This field contains the disposition of the patient at time of discharge (i.e., discharged to home, expired, etc.). Refer to User-defined Table 0112 - Discharge Disposition for suggested values. In the US, this field is used on UB92 FL22. The UB codes listed as examples are not an exhaustive or current list; refer to a UB specification for additional information.",
      "length": "3",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "37": {
      "field_id": "PV1.37",
      "name": "Discharged to Location",
      "description": "This field indicates the healthcare facility to which the patient was discharged and the date. Refer to User-defined Table 0113 - Discharged to Location for suggested values.",
      "length": "47",
      "data_type": "DLD - Discharge Location and Date",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "38": {
      "field_id": "PV1.38",
      "name": "Diet Type",
      "description": "This field indicates a special diet type for a patient. Refer to User-defined Table 0114 - Diet Type for suggested values.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "39": {
      "field_id": "PV1.39",
      "name": "Servicing Facility",
      "description": "This field is used in a multiple facility environment to indicate the healthcare facility with which this visit is associated. Refer to User-defined Table 0115 - Servicing Facility for suggested values.",
      "length": "2",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "40": {
      "field_id": "PV1.40",
      "name": "Bed Status",
      "description": "This field has been retained for backward compatibility only . The information is now held in the fifth component of the PL datatype in PV1-3. This field contains the status of the bed. Refer to User-defined Table 0116 - Bed Status for suggested values.",
      "length": "1",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    },
    "41": {
      "field_id": "PV1.41",
      "name": "Account Status",
      "description": "This field contains the account status. Refer to User-defined Table 0117 - Account Status for suggested values.",
      "length": "2",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "42": {
      "field_id": "PV1.42",
      "name": "Pending Location",
      "description": "This field indicates the point of care, room, bed, healthcare facility ID, and bed status to which the patient may be moved. The first component may be the nursing station for inpatient locations, or the clinic, department, or home for locations other than inpatient. If a value exists in the fifth component (location status), it supersedes the value in PV1-40 - Bed Status.",
      "length": "80",
      "data_type": "PL - Person Location",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "43": {
      "field_id": "PV1.43",
      "name": "Prior Temporary Location",
      "description": "This field is used to reflect the patients temporary location (such as the operating room/theatre or x-ray) prior to a transfer from a temporary location to an actual location, or from a temporary location to another temporary location. The first component may be the nursing station for inpatient locations, or the clinic, department, or home for locations other than inpatient.",
      "length": "80",
      "data_type": "PL - Person Location",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "44": {
      "field_id": "PV1.44",
      "name": "Admit Date/Time",
      "description": "This field contains the admit date/time. It is to be used if the event date/time is different than the admit date and time, i.e., a retroactive update. This field is also used to reflect the date/time of an outpatient/emergency patient registration.",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "45": {
      "field_id": "PV1.45",
      "name": "Discharge Date/Time",
      "description": "This field contains the discharge date/time. It is to be used if the event date/time is different than the discharge date and time, that is, a retroactive update. This field is also used to reflect the date/time of an outpatient/emergency patient discharge.",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "46": {
      "field_id": "PV1.46",
      "name": "Current Patient Balance",
      "description": "This field contains the visit balance due.",
      "length": "12",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "47": {
      "field_id": "PV1.47",
      "name": "Total Charges",
      "description": "This field contains the total visit charges.",
      "length": "12",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "48": {
      "field_id": "PV1.48",
      "name": "Total Adjustments",
      "description": "This field contains the total adjustments for visit.",
      "length": "12",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "49": {
      "field_id": "PV1.49",
      "name": "Total Payments",
      "description": "This field contains the total payments for visit.",
      "length": "12",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "50": {
      "field_id": "PV1.50",
      "name": "Alternate Visit ID",
      "description": "This field contains the alternative, temporary, or pending optional visit ID number to be used if needed. Refer to HL7 Table 0061 - Check Digit Scheme for valid values. Refer to HL7 Table 0203 - Identifier Type for valid values. The assigning authority and identifier type codes are strongly recommended for all CX data types.",
      "length": "250",
      "data_type": "CX - Extended Composite ID with Check Digit",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "51": {
      "field_id": "PV1.51",
      "name": "Visit Indicator",
      "description": "This field specifies the level on which data are being sent. It is the indicator used to send data at two levels, visit and account. HL7 recommends sending an A or no value when the data in the message are at the account level, or V to indicate that the data sent in the message are at the visit level. Refer to User-defined Table 0326 - Visit Indicator for suggested values.",
      "length": "1",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "52": {
      "field_id": "PV1.52",
      "name": "Other Healthcare Provider",
      "description": "From V2.4 onward, this field has been retained for backward compatibility only. Use the ROL-Role Segment to communicate providers not specified elsewhere. This field contains the other healthcare providers (e.g. nurse care practitioner, midwife, physician assistant). Multiple healthcare providers can be sent. Depending on local agreements, either the ID or the name may be absent from this field. Use values in User-defined Table 0010 - Physician ID for first component.",
      "length": "250",
      "data_type": "XCN - Extended Composite ID Number and Name for Persons",
      "optionality": "Backward Compatibility",
      "repeatability": "Repeatable indefinitely"
    }
  },
  "NTE": {
    "1": {
      "field_id": "NTE.1",
      "name": "Set ID - NTE",
      "description": "This field may be used where multiple NTE segments are included in a message. Their numbering must be described in the application message definition.",
      "length": "4",
      "data_type": "SI - Sequence ID",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "NTE.2",
      "name": "Source of Comment",
      "description": "This field is used when source of comment must be identified. This table may be extended locally during implementation. Refer to HL7 Table 0105 - Source of comment for valid values.",
      "length": "8",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "NTE.3",
      "name": "Comment",
      "description": "This field contains the comment contained in the segment.\n\nNote: As of v2.2, this field uses the FT rather than a TX data type. Since there is no difference between an FT data type without any embedded formatting commands, and a TX data type, this change is compatible with the previous version.",
      "length": "65536",
      "data_type": "FT - Formatted Text Data",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "4": {
      "field_id": "NTE.4",
      "name": "Comment Type",
      "description": "This field contains a value to identify the type of comment text being sent in the specific comment record. Refer to User-Defined Table 0364 - Comment Type for suggested values.\n\nNote: A field already exists on the NTE record that identifies the Sources of Comment (e.g., ancillary, placer, other). However some applications need to support other types of comment text (e.g., instructions, reason, remarks, etc.). A separate NTE segment can be used for each type of comment (e.g., instructions are on one NTE and remarks on another NTE)",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    }
  },
  "DG1": {
    "1": {
      "field_id": "DG1.1",
      "name": "Set ID - DG1",
      "description": "This field contains the number that identifies this transaction. For the first occurrence of the segment the sequence number shall be 1, for the second occurrence it shall be 2, etc.",
      "length": "4",
      "data_type": "SI - Sequence ID",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "DG1.2",
      "name": "Diagnosis Coding Method",
      "description": "As of Version 2.3, this field has been retained for backward compatibility only. Use the components of DG1-3 - Diagnosis Code - DG1 instead of this field. When used for backward compatibility, ICD9 is the recommended coding methodology. Refer to User-defined Table 0053 - Diagnosis Coding Method for suggested values.",
      "length": "2",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "DG1.3",
      "name": "Diagnosis Code - DG1",
      "description": "Use this field instead of DG1-2 - Diagnosis Coding Method and DG1-4 - Diagnosis Description, which have been retained, as of Version 2.3, for backward compatibility only. DG1-3 - Diagnosis Code - DG1contains the diagnosis code assigned to this diagnosis. Refer to User-defined Table 0051 - Diagnosis Code for suggested values. This field is a CE data type for compatibility with clinical and ancillary systems.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "4": {
      "field_id": "DG1.4",
      "name": "Diagnosis Description",
      "description": "As of Version 2.3, this field has been retained for backward compatibility only. Use the components of DG1-3 - Diagnosis Code - DG1 field instead of this field. When used for backward compatibility, DG1-4 - Diagnosis Description contains a description that best describes the diagnosis.",
      "length": "40",
      "data_type": "ST - String Data",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "DG1.5",
      "name": "Diagnosis Date/Time",
      "description": "This field contains the date/time that the diagnosis was determined.",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "6": {
      "field_id": "DG1.6",
      "name": "Diagnosis Type",
      "description": "This field contains a code that identifies the type of diagnosis being sent. Refer to User-defined Table 0052 - Diagnosis Type for suggested values. This field should no longer be used to indicate DRG because the DRG fields have moved to the new DRG segment.",
      "length": "2",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "7": {
      "field_id": "DG1.7",
      "name": "Major Diagnostic Category",
      "description": "As of Version 2.3, this field has been retained for backward compatibility only. This field should only be used in a master file transaction. Refer to User-defined Table 0118 - Major Diagnostic Category for suggested values.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    },
    "8": {
      "field_id": "DG1.8",
      "name": "Diagnostic Related Group",
      "description": "As of Version 2.3, this field has been retained for backward compatibility only. This field has moved to the new DRG segment. It contains the DRG for the transaction. Interim DRGs could be determined for an encounter. Refer to User-defined Table 0055 - Diagnosis Related Group for suggested values.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    },
    "9": {
      "field_id": "DG1.9",
      "name": "DRG Approval Indicator",
      "description": "As of Version 2.3, this field has been retained for backward compatibility only. This field has moved to the new DRG segment. This field indicates if the DRG has been approved by a reviewing entity. Refer to HL7 Table 0136 - Yes/no Indicator for valid values.",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    },
    "10": {
      "field_id": "DG1.10",
      "name": "DRG Grouper Review Code",
      "description": "As of Version 2.3, this field has been retained for backward compatibility only. This field has moved to the new DRG segment. Refer to User-defined Table 0056 - DRG Grouper Review Code for suggested values. This code indicates that the grouper results have been reviewed and approved.",
      "length": "2",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    },
    "11": {
      "field_id": "DG1.11",
      "name": "Outlier Type",
      "description": "As of Version 2.3, this field has been retained for backward compatibility only. This field has moved to the new DRG segment. When used for backward compatibility, this field contains the type of outlier (i.e. period of care beyond DRG-standard stay in facility) that has been paid. Refer to User-defined Table 0083 - Outlier Type for suggested values.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    },
    "12": {
      "field_id": "DG1.12",
      "name": "Outlier Days",
      "description": "As of Version 2.3, this field has been retained for backward compatibility only. This field has moved to the new DRG segment. When used for backward compatibility, this field contains the number of days that have been approved for an outlier payment.",
      "length": "3",
      "data_type": "NM - Numeric",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    },
    "13": {
      "field_id": "DG1.13",
      "name": "Outlier Cost",
      "description": "As of Version 2.3, this field has been retained for backward compatibility only. This field has moved to the new DRG segment. When used for backward compatibility, this field contains the amount of money that has been approved for an outlier payment.",
      "length": "12",
      "data_type": "CP - Composite Price",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    },
    "14": {
      "field_id": "DG1.14",
      "name": "Grouper Version And Type",
      "description": "As of Version 2.3, this field has been retained for backward compatibility only. This field has moved to the new DRG segment; refer to the field definition in Section 6.5.3.1. When used for backward compatibility, this field contains the grouper version and type.",
      "length": "4",
      "data_type": "ST - String Data",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    },
    "15": {
      "field_id": "DG1.15",
      "name": "Diagnosis Priority",
      "description": "This field contains the number that identifies the significance or priority of the diagnosis code. Refer to HL7 Table 0359 - Diagnosis Priority for suggested values.",
      "length": "2",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "16": {
      "field_id": "DG1.16",
      "name": "Diagnosing Clinician",
      "description": "This field contains the individual responsible for generating the diagnosis information. Multiple names and identifiers for the same person may be sent in this field, not multiple diagnosing clinicians. The legal name is assumed to be in the first repetition. When the legal name is not sent, a repeat delimiter must be sent first for the first repetition.",
      "length": "250",
      "data_type": "XCN - Extended Composite ID Number and Name for Persons",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "17": {
      "field_id": "DG1.17",
      "name": "Diagnosis Classification",
      "description": "This field indicates if the patient information is for a diagnosis or a non-diagnosis code. Refer to User-defined Table 0228 - Diagnosis Classification for suggested values.",
      "length": "3",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "18": {
      "field_id": "DG1.18",
      "name": "Confidential Indicator",
      "description": "This field indicates whether the diagnosis is confidential. Refer to HL7 table 0136 - Yes/no Indicator for valid values.",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "19": {
      "field_id": "DG1.19",
      "name": "Attestation Date/Time",
      "description": "This field contains the time stamp that indicates the date and time that the attestation was signed.",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "20": {
      "field_id": "DG1.20",
      "name": "Diagnosis Identifier",
      "description": "This field contains a value that uniquely identifies a single diagnosis for an encounter. It is unique across all segments and messages for an encounter. This field is required in all implementations employing Update Diagnosis/Procedures (P12) messages.",
      "length": "427",
      "data_type": "EI - Entity Identifier",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "21": {
      "field_id": "DG1.21",
      "name": "Diagnosis Action Code",
      "description": "No description found.",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    }
  },
  "PR1": {
    "1": {
      "field_id": "PR1.1",
      "name": "Set ID - PR1",
      "description": "This field contains the number that identifies this transaction. For the first occurrence of the segment the sequence number shall be 1, for the second occurrence it shall be 2, etc.",
      "length": "4",
      "data_type": "SI - Sequence ID",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "PR1.2",
      "name": "Procedure Coding Method",
      "description": "As of Version 2.3, this field has been retained for backward compatibility only . Use the components of PR1-3 - Procedure Code instead of this field.",
      "length": "3",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "PR1.3",
      "name": "Procedure Code",
      "description": "Use this field instead of PR1-2 - Procedure Coding Method and PR1-4 - Procedure Description . Those two fields have been retained for backward compatibility only. This field contains a unique identifier assigned to the procedure. Refer to User-defined Table 0088 - Procedure Code for suggested values. This field is a CE data type for compatibility with clinical and ancillary systems.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "4": {
      "field_id": "PR1.4",
      "name": "Procedure Description",
      "description": "As of Version 2.3, this field has been retained for backward compatibility only . Use the components of PR1-3 - Procedure Code instead of this field. The field contains a text description that describes the procedure.",
      "length": "40",
      "data_type": "ST - String Data",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "PR1.5",
      "name": "Procedure Date/Time",
      "description": "This field contains the date/time that the procedure was performed.",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "6": {
      "field_id": "PR1.6",
      "name": "Procedure Functional Type",
      "description": "This field contains the optional code that further defines the type of procedure. Refer to User-defined Table 0230 - Procedure Functional Type for suggested values.",
      "length": "2",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "7": {
      "field_id": "PR1.7",
      "name": "Procedure Minutes",
      "description": "This field indicates the length of time in whole minutes that the procedure took to complete.",
      "length": "4",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "8": {
      "field_id": "PR1.8",
      "name": "Anesthesiologist",
      "description": "HL7 has introduced the ROL segment to report a wide range of practitioner roles related to a single procedure. When using trigger events introduced in HL7 Version 2.3, it is recommended that the ROL segment be used to report all practitioner roles related to the procedure.",
      "length": "250",
      "data_type": "XCN - Extended Composite ID Number and Name for Persons",
      "optionality": "Backward Compatibility",
      "repeatability": "Repeatable indefinitely"
    },
    "9": {
      "field_id": "PR1.9",
      "name": "Anesthesia Code",
      "description": "This field contains a unique identifier of the anesthesia used during the procedure. Refer to User-defined Table 0019 - Anesthesia Code for suggested values.",
      "length": "2",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "10": {
      "field_id": "PR1.10",
      "name": "Anesthesia Minutes",
      "description": "This field contains the length of time in minutes that the anesthesia was administered.",
      "length": "4",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "11": {
      "field_id": "PR1.11",
      "name": "Surgeon",
      "description": "HL7 has introduced the ROL segment to report a wide range of practitioner roles related to a single procedure. When using trigger events introduced in HL7 Version 2.3, it is recommended that the ROL segment be used to report all practitioner roles related to the procedure.",
      "length": "250",
      "data_type": "XCN - Extended Composite ID Number and Name for Persons",
      "optionality": "Backward Compatibility",
      "repeatability": "Repeatable indefinitely"
    },
    "12": {
      "field_id": "PR1.12",
      "name": "Procedure Practitioner",
      "description": "HL7 has introduced the ROL segment to report a wide range of practitioner roles related to a single procedure. When using trigger events introduced in HL7 Version 2.3, it is recommended that the ROL segment be used to report all practitioner roles related to the procedure.",
      "length": "250",
      "data_type": "XCN - Extended Composite ID Number and Name for Persons",
      "optionality": "Backward Compatibility",
      "repeatability": "Repeatable indefinitely"
    },
    "13": {
      "field_id": "PR1.13",
      "name": "Consent Code",
      "description": "This field contains the type of consent that was obtained for permission to treat the patient. Refer to User-defined Table 0059 - Consent Code for suggested values.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "14": {
      "field_id": "PR1.14",
      "name": "Procedure Priority",
      "description": "This field contains a number that identifies the significance or priority of the procedure code. Refer to HL7 Table 0418 - Procedure Priority for valid values.",
      "length": "2",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "15": {
      "field_id": "PR1.15",
      "name": "Associated Diagnosis Code",
      "description": "This field contains the diagnosis that is the primary reason this procedure was performed, e.g. in the US, Medicare wants to know for which diagnosis this procedure is submitted for inclusion on CMS 1500 form. Refer to User-defined Table 0051 - Diagnosis Code for suggested values.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "16": {
      "field_id": "PR1.16",
      "name": "Procedure Code Modifier",
      "description": "This field contains the procedure code modifier to the procedure code reported in field 3, when applicable. Procedure code modifiers are defined by regulatory agencies such as CMS and the AMA. Multiple modifiers may be reported. Refer to User-defined Table 0340 - Procedure Code Modifier for suggested values.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "17": {
      "field_id": "PR1.17",
      "name": "Procedure DRG Type",
      "description": "This field indicates a procedures priority ranking relative to its DRG. Refer to User-defined Table 0416 - Procedure DRG Type for suggested values.",
      "length": "20",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "18": {
      "field_id": "PR1.18",
      "name": "Tissue Type Code",
      "description": "Code representing type of tissue removed from a patient during this procedure. Refer to User-defined Table 0417 - Tissue Type Code for suggested values.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "19": {
      "field_id": "PR1.19",
      "name": "Procedure Identifier",
      "description": "This field contains a value that uniquely identifies a single procedure for an encounter. It is unique across all segments and messages for an encounter. This field is required in all implementations employing Update Diagnosis/Procedures (P12) messages.",
      "length": "427",
      "data_type": "EI - Entity Identifier",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "20": {
      "field_id": "PR1.20",
      "name": "Procedure Action Code",
      "description": "This field defines the action to be taken for this procedure. Refer to HL7 Table 0206 - Segment Action Code for valid values. This field is required for the Update Diagnosis/Procedures (P12) message. In all other events it is optional.",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    }
  },
  "AL1": {
    "1": {
      "field_id": "AL1.1",
      "name": "Set ID - AL1",
      "description": "This field contains the number that identifies this transaction. For the first occurrence of the segment, the sequence number shall be one, for the second occurrence, the sequence number shall be two, etc.",
      "length": "4",
      "data_type": "SI - Sequence ID",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "AL1.2",
      "name": "Allergen Type Code",
      "description": "This field indicates a general allergy category (drug, food, pollen, etc.). Refer to User-defined Table 0127 - Allergen Type for suggested values.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "AL1.3",
      "name": "Allergen Code/Mnemonic/Description",
      "description": "This field uniquely identifies a particular allergen. This element may conform to some external, standard coding system (that must be identified), or it may conform to local, largely textual or mnemonic descriptions.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "4": {
      "field_id": "AL1.4",
      "name": "Allergy Severity Code",
      "description": "This field indicates the general severity of the allergy. Refer to User-defined Table 0128 - Allergy Severity for suggested values.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "AL1.5",
      "name": "Allergy Reaction Code",
      "description": "This field identifies the specific allergic reaction that was documented. This element may conform to some external, standard coding system, or it may conform to a local, largely textual or mnemonic descriptions (e.g., convulsions, sneeze, rash, etc.).",
      "length": "15",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "6": {
      "field_id": "AL1.6",
      "name": "Identification Date",
      "description": "From V2.4 onward, this field has been retained for backward compatibility only. This field contains the date that the allergy was identified.",
      "length": "8",
      "data_type": "DT - Date",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    }
  },
  "RXA": {
    "1": {
      "field_id": "RXA.1",
      "name": "Give Sub-ID Counter",
      "description": "Use this field if matching this RXA segment to its corresponding RXG segment. If the two applications are not matching RXG and RXA segments, this field's value is zero (0).",
      "length": "4",
      "data_type": "NM - Numeric",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "RXA.2",
      "name": "Administration Sub-ID Counter",
      "description": "This field starts with 1 the first time that medication/treatment is administered for this order. Increments by one with each additional administration the medication/treatment.",
      "length": "4",
      "data_type": "NM - Numeric",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "RXA.3",
      "name": "Date/Time Start of Administration",
      "description": "If the order is for a continuous administration (such as an IV), and the rate is changed at a certain time after the start, an RAS message can be issued to record the change. For such an RAS message, this field records the time the rate was changed to the new value recorded in the RXA-12-administered per (time unit) of the same message.",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "4": {
      "field_id": "RXA.4",
      "name": "Date/Time End of Administration",
      "description": "If null, the date/time of RXA-3-Date/Time Start of Administration is assumed.",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "RXA.5",
      "name": "Administered Code",
      "description": "This field contains the identifier of the medical substance/treatment administered. It is equivalent to OBR-4-universal service ID in function. If the substance administered is a vaccine, CVX codes may be used to code this field (see HL7 Table 0292 - Vaccines Administered ).",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "6": {
      "field_id": "RXA.6",
      "name": "Administered Amount",
      "description": "This field contains the amount administered.",
      "length": "20",
      "data_type": "NM - Numeric",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "7": {
      "field_id": "RXA.7",
      "name": "Administered Units",
      "description": "This field is conditional because it is required if the administered amount code does not imply units. This field must be in simple units that reflect the actual quantity of the substance administered. It does not include compound units.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "8": {
      "field_id": "RXA.8",
      "name": "Administered Dosage Form",
      "description": "The dosage form indicates the manner in which the medication/treatment is aggregated for dispensing, e.g., tablets, capsules, suppositories. In some cases, this information is implied by the dispense/give code in RXA-5-Administered Code. Use this field when the administered code does not specify the dosage form.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "9": {
      "field_id": "RXA.9",
      "name": "Administration Notes",
      "description": "This field contains notes from the provider administering the medication/treatment. If coded, requires a user-defined table. If free text (describing a custom IV, mixture, or salve, for example) place a null in the first component and the text in the second, e.g., |^this is a free text administration note| .",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "10": {
      "field_id": "RXA.10",
      "name": "Administering Provider",
      "description": "This field contains the provider ID of the person administering the pharmaceutical/treatment.",
      "length": "250",
      "data_type": "XCN - Extended Composite ID Number and Name for Persons",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "11": {
      "field_id": "RXA.11",
      "name": "Administered-at Location",
      "description": "The first component contains the inpatient or outpatient location at which the drug or treatment was administered (if applicable). The default (null) value is the current census location for the patient. Site-specific table. The first eight components have the same form as the first eight components of PV1-3-assigned patient location. The final eight components replace the ninth component of PV1-3-assigned patient location and represent the full address specification.",
      "length": "200",
      "data_type": "LA2 - Location with Address Variation 2",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "12": {
      "field_id": "RXA.12",
      "name": "Administered Per (Time Unit)",
      "description": "This field contains the rate at which this medication/treatment was administered as calculated by using RXA-6-administered amount and RXA-7-administered units. This field is conditional because it is required when a treatment is administered continuously at a prescribed rate, e.g., certain IV solutions.",
      "length": "20",
      "data_type": "ST - String Data",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "13": {
      "field_id": "RXA.13",
      "name": "Administered Strength",
      "description": "Use when RXA-5-Administered Code does not specify the strength. This is the numeric part of the strength, used in combination with RXA-14-Administered Strength Units.",
      "length": "20",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "14": {
      "field_id": "RXA.14",
      "name": "Administered Strength Units",
      "description": "Use when RXA-5-Administered Code does not specify the strength. This is the unit of the strength, used in combination with RXA-13-Administered Strength.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "15": {
      "field_id": "RXA.15",
      "name": "Substance Lot Number",
      "description": "This field contains the lot number of the medical substance administered.",
      "length": "20",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "16": {
      "field_id": "RXA.16",
      "name": "Substance Expiration Date",
      "description": "This field contains the expiration date of the medical substance administered.",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "17": {
      "field_id": "RXA.17",
      "name": "Substance Manufacturer Name",
      "description": "This field contains the manufacturer of the medical substance administered.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "18": {
      "field_id": "RXA.18",
      "name": "Substance/Treatment Refusal Reason",
      "description": "This field contains the reason the patient refused the medical substance/treatment. Any entry in the field indicates that the patient did not take the substance.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "19": {
      "field_id": "RXA.19",
      "name": "Indication",
      "description": "This field contains the identifier of the condition or problem for which the drug/treatment was prescribed. May repeat if multiple indications are relevant.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "20": {
      "field_id": "RXA.20",
      "name": "Completion Status",
      "description": "Status of treatment administration event. Refer to HL7 Table 0322 - Completion Status for valid values.",
      "length": "2",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "21": {
      "field_id": "RXA.21",
      "name": "Action Code - RXA",
      "description": "Status of record. The information in this field enables the use of the RXA in the vaccine messages, where a method of correcting vaccination information transmitted with incorrect patient identifying information is needed. Refer To HL7 Table 0323 - Action Code for valid values.",
      "length": "2",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "22": {
      "field_id": "RXA.22",
      "name": "System Entry Date/Time",
      "description": "Date/time the administration information was entered into the source system. This field is used to detect instances where treatment administration information is inadvertently entered multiple times by providing a unique identification field. Under usual circumstances, this field would be provided automatically by the computer system rather than being entered by a person.",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "23": {
      "field_id": "RXA.23",
      "name": "Administered Drug Strength Volume",
      "description": "This numeric field defines the volume measurement in which the drug strength concentration is contained.",
      "length": "5",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "24": {
      "field_id": "RXA.24",
      "name": "Administered Drug Strength Volume Units",
      "description": "This field indicates the volumetric unit associated with RXA-23 Administered Drug Strength Volume.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "25": {
      "field_id": "RXA.25",
      "name": "Administered Barcode Identifier",
      "description": "This field contains the pharmacy system's assigned barcode number for the give occurrence. For IV orders, many pharmacy systems generate a barcode number to identify a specific bag/bottle of the order. This number can be an instance identifier; unique for the patient, drug combination, and schedule instance or it may be just a drug identifier.",
      "length": "60",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "26": {
      "field_id": "RXA.26",
      "name": "Pharmacy Order Type",
      "description": "The Pharmacy Order Type field defines the general category of pharmacy order which may be used to determine the processing path the order will take. Refer to HL7 Table 0480 Pharmacy Order Types for valid values.",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    }
  },
  "RXR": {
    "1": {
      "field_id": "RXR.1",
      "name": "Route",
      "description": "This field is the route of administration.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "RXR.2",
      "name": "Administration Site",
      "description": "This field contains the site of the administration route. When using a post-coordinated code table in this field, RXR-6 Administration Site may be used to modify the meaning of this field.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "RXR.3",
      "name": "Administration Device",
      "description": "This field contains the mechanical device used to aid in the administration of the drug or other treatment. Common examples are IV-sets of different types. Refer to User-defined Table 0164 - Administration device for valid entries.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "4": {
      "field_id": "RXR.4",
      "name": "Administration Method",
      "description": "This field identifies the specific method requested for the administration of the drug or treatment to the patient. Refer To User-defined Table 0165 - Administration Method for valid values.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "RXR.5",
      "name": "Routing Instruction",
      "description": "This field provides instruction on administration routing, especially in cases where more than one route of administration is possible. A typical case would be designating which IV line should be used when more than one IV line is a possible route for injection.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "6": {
      "field_id": "RXR.6",
      "name": "Administration Site Modifier",
      "description": "This field contains a modifier which modifies the meaning of RXR-2 Administration Site.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    }
  },
  "SPM": {
    "1": {
      "field_id": "SPM.1",
      "name": "Set ID - SPM",
      "description": "This field contains the sequence number. This field is used to identify SPM segment instances in message structures where the SPM segment repeats.",
      "length": "4",
      "data_type": "SI - Sequence ID",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "SPM.2",
      "name": "Specimen ID",
      "description": "This field contains a unique identifier for the specimen as referenced by the Placer application, the Filler application, or both.",
      "length": "80",
      "data_type": "EIP - Entity Identifier Pair",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "SPM.3",
      "name": "Specimen Parent IDs",
      "description": "This field contains the identifiers for the specimen or specimens that contributed to the specimen that is described by the segment instance.",
      "length": "80",
      "data_type": "EIP - Entity Identifier Pair",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "4": {
      "field_id": "SPM.4",
      "name": "Specimen Type",
      "description": "This field describes the precise nature of the entity that will be the source material for the observation.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "SPM.5",
      "name": "Specimen Type Modifier",
      "description": "This field contains modifying or qualifying description(s) about the specimen type",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "6": {
      "field_id": "SPM.6",
      "name": "Specimen Additives",
      "description": "This field identifies any additives introduced to the specimen before or at the time of collection. These additives may be introduced in order to preserve, maintain or enhance the particular nature or component of the specimen. Refer to HL7 Table 0371 - Additive for valid values.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "7": {
      "field_id": "SPM.7",
      "name": "Specimen Collection Method",
      "description": "Describes the procedure or process by which the specimen was collected.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "8": {
      "field_id": "SPM.8",
      "name": "Specimen Source Site",
      "description": "specifies the source from which the specimen was obtained. For example, in the case where a liver biopsy is obtained via a percutaneous needle, the source would be liver.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "9": {
      "field_id": "SPM.9",
      "name": "Specimen Source Site Modifier",
      "description": "This field contains modifying or qualifying description(s) about the specimen source site",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "10": {
      "field_id": "SPM.10",
      "name": "Specimen Collection Site",
      "description": "This field differs from SPM-8-Specimen Source Site in those cases where the source site must be approached via a particular site (e.g., anatomic location). For example, in the case where a liver biopsy is obtained via a percutaneous needle, the collection site would be the point of entry of the needle. For venous blood collected from the left radial vein, the collection site could be antecubital fossa.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "11": {
      "field_id": "SPM.11",
      "name": "Specimen Role",
      "description": "This field indicates the role of the sample. Refer to User-defined Table 0369 – Specimen role for suggested values. Each of these values is normally identifiable by the systems and its components and can influence processing and data management related to the specimen.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "12": {
      "field_id": "SPM.12",
      "name": "Specimen Collection Amount",
      "description": "This field specifies the volume or mass of the collected specimen. For laboratory tests, the collection volume is the volume of a specimen. Specifically, units should be expressed in the ISO Standard unit abbreviations (ISO-2955, 1977). This is a results-only field except when the placer or a party has already drawn the specimen.",
      "length": "20",
      "data_type": "CQ - Composite Quantity with Units",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "13": {
      "field_id": "SPM.13",
      "name": "Grouped Specimen Count",
      "description": "This field refers to the number of individual specimens of a particular type represented by this instance of a specimen. The use of this field is restricted to specimens upon which all specimen related attributes are identical. This field would only be valued if the specimen role attribute has the value G.",
      "length": "6",
      "data_type": "NM - Numeric",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "14": {
      "field_id": "SPM.14",
      "name": "Specimen Description",
      "description": "This is a text field that allows additional information specifically about the specimen to be sent in the message",
      "length": "250",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "15": {
      "field_id": "SPM.15",
      "name": "Specimen Handling Code",
      "description": "This describes how the specimen and/or container need to be handled from the time of collection through the initiation of testing. As this field is not required, no assumptions can be made as to meaning when this field is not populated.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "16": {
      "field_id": "SPM.16",
      "name": "Specimen Risk Code",
      "description": "This field contains any known or suspected specimen hazards, e.g., exceptionally infectious agent or blood from a hepatitis patient. Either code and/or text may be absent. However, the code is always placed in the first component position and any free text in the second component. Thus, a component delimiter must precede free text without a code. Refer to User-defined Table 0489 - Risk Codes for suggested entries",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "17": {
      "field_id": "SPM.17",
      "name": "Specimen Collection Date/Time",
      "description": "The date and time when the specimen was acquired from the source. The use of the Date Range data type allows for description of specimens collected over a period of time, for example, 24-hour urine collection. For specimens collected at a point in time, only the first component (start date/time) will be populated.",
      "length": "26",
      "data_type": "DR - Date/Time Range",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "18": {
      "field_id": "SPM.18",
      "name": "Specimen Received Date/Time",
      "description": "The specimen received date/time is the time that the specimen is received at the diagnostic service. The actual time that is recorded is based on how specimen receipt is managed and may correspond to the time the sample is logged in. This is fundamentally different from SPM-xx Specimen Collection date/time.",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "19": {
      "field_id": "SPM.19",
      "name": "Specimen Expiration Date/Time",
      "description": "This field is the date and time the specimen can no longer be used for the purpose implied by the order. For example, in the Blood Banking environment the specimen can no longer be used for pre-transfusion compatibility testing. The specimen segment will include an SPM-21-Specimen Reject Reason of 'EX' indicating 'Expired' for message instances created after this date and time.",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "20": {
      "field_id": "SPM.20",
      "name": "Specimen Availability",
      "description": "This describes whether the specimen, as it exists, is currently available to use in an analysis. Refer to HL7 Table 0136 Yes/No Indicator for valid values",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "21": {
      "field_id": "SPM.21",
      "name": "Specimen Reject Reason",
      "description": "This describes one or more reasons the specimen is rejected for the specified observation/result/analysis. Refer to HL7 Table 0490 - Specimen Reject Reason for valid values.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "22": {
      "field_id": "SPM.22",
      "name": "Specimen Quality",
      "description": "The degree or grade of excellence of the specimen at receipt. The filler populates this attribute. Refer to User-defined Table 0491 - Specimen Quality for suggested entries.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "23": {
      "field_id": "SPM.23",
      "name": "Specimen Appropriateness",
      "description": "The suitability of the specimen for the particular planned use as determined by the filler. Refer to User-defined Table 0492 - Specimen Appropriateness for suggested entries.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "24": {
      "field_id": "SPM.24",
      "name": "Specimen Condition",
      "description": "A mode or state of being that describes the nature of the specimen. Refer to User-defined Table 0493 - Specimen Condition for suggested entries.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "25": {
      "field_id": "SPM.25",
      "name": "Specimen Current Quantity",
      "description": "This attributes contains the amount of specimen that currently exists or is available for use in further testing.",
      "length": "20",
      "data_type": "CQ - Composite Quantity with Units",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "26": {
      "field_id": "SPM.26",
      "name": "Number of Specimen Containers",
      "description": "This field identifies the number of containers for a given sample. For sample receipt verification purposes; may be different from the total number of samples that accompany the order.",
      "length": "4",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "27": {
      "field_id": "SPM.27",
      "name": "Container Type",
      "description": "The container in or on which a specimen is transported",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "28": {
      "field_id": "SPM.28",
      "name": "Container Condition",
      "description": "In chain of custody cases where specimens are moved from lab to lab, the status of the container that the specimen is shipped in must be recorded at each receipt. If the container is compromised in any way (seal broken, container cracked or leaking, etc) then this needs to be recorded for legal reasons.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "29": {
      "field_id": "SPM.29",
      "name": "Specimen Child Role",
      "description": "For child specimens, this field identifies the relationship between this specimen and the parent specimen. If this field is populated, then SPM-3-Specimen Parent ID must be populated. This field differs from SPM-15-Specimen Role in that this field refers to the role of this specimen relative to a parent role rather than the role of this specimen to the ordered service.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    }
  },
  "EVN": {
    "1": {
      "field_id": "EVN.1",
      "name": "Event Type Code",
      "description": "This field has been retained for backward compatibility only. We recommend using the second component (trigger event) of MSH-9 - Message Type to transmit event type code information. This field contains the events corresponding to the trigger events described in this section, e.g., admission, transfer, or registration. Refer to HL7 Table 0003 - Event type for valid values.",
      "length": "3",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "EVN.2",
      "name": "Recorded Date/Time",
      "description": "Most systems will default to the system date/time when the transaction was entered, but they should also permit an override.",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "EVN.3",
      "name": "Date/Time Planned Event",
      "description": "This field contains the date/time that the event is planned. We recommend that PV2-8 - Expected Admit Date/Time , PV2-9 - Expected Discharge Date/Time or PV2-47 - Expected LOA Return date/time be used whenever possible.",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "4": {
      "field_id": "EVN.4",
      "name": "Event Reason Code",
      "description": "This field contains the reason for this event. Refer to User-defined Table 0062 - Event Reason for suggested values.",
      "length": "3",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "EVN.5",
      "name": "Operator ID",
      "description": "This field identifies the individual responsible for triggering the event. Refer to User-defined Table 0188 - Operator ID for suggested values.",
      "length": "250",
      "data_type": "XCN - Extended Composite ID Number and Name for Persons",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "6": {
      "field_id": "EVN.6",
      "name": "Event Occurred",
      "description": "This field contains the date/time that the event actually occurred. For example, on a transfer (A02 transfer a patient), this field would contain the date/time the patient was actually transferred. On a cancellation event, this field should contain the date/time that the event being cancelled occurred.",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "7": {
      "field_id": "EVN.7",
      "name": "Event Facility",
      "description": "This field identifies the actual facility where the event occurred as differentiated from the sending facility (MSH-4). It would be the facility at which the Operator (EVN-5) has entered the event.",
      "length": "241",
      "data_type": "HD - Hierarchic Designator",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    }
  },
  "PD1": {
    "1": {
      "field_id": "PD1.1",
      "name": "Living Dependency",
      "description": "This field identifies specific living conditions (e.g., spouse dependent on patient, walk-up) that are relevant to an evaluation of the patients healthcare needs. This information can be used for discharge planning. This field repeats because, for example, spouse dependent and medical supervision required can apply at the same time. Refer to User-defined Table 0223 - Living Dependency for suggested values.",
      "length": "2",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "2": {
      "field_id": "PD1.2",
      "name": "Living Arrangement",
      "description": "This field identifies the situation in which the patient lives at his residential address. Examples might include Alone, Family, Relatives, Institution, etc. Refer to User-defined Table 0220 - Living Arrangement for suggested values.",
      "length": "2",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "PD1.3",
      "name": "Patient Primary Facility",
      "description": "This field contains the name and identifier that specifies the primary care healthcare facility selected by the patient at the time of enrolment in an HMO Insurance Plan. Multiple names and identifiers are allowed for the same facility. The legal name of the healthcare facility must be sent in the first sequence. If the legal name of the facility is not sent, then the repeat delimiter must be sent in the first sequence. Refer to User-defined Table 0204 - Organizational Name Type for suggested values.",
      "length": "250",
      "data_type": "XON - Extended Composite Name and Identification Number for Organizations",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "4": {
      "field_id": "PD1.4",
      "name": "Patient Primary Care Provider Name and ID No.",
      "description": "This field is retained for backward compatibility only. The ROL segment is now used to convey more complete information about the primary care provider. This field contained the provider name and ID of the primary care provider. Multiple names are allowed for the same person. The legal name must be sent in the first sequence. If the legal name is not sent, then the repeat delimiter must be sent in the first sequence.",
      "length": "250",
      "data_type": "XCN - Extended Composite ID Number and Name for Persons",
      "optionality": "Backward Compatibility",
      "repeatability": "Repeatable indefinitely"
    },
    "5": {
      "field_id": "PD1.5",
      "name": "Student Indicator",
      "description": "This field indicates if the patient is currently a student or not, and whether the patient is a full-time or a part-time student. This field does not indicate the students degree level (high school, college, elementary) or the students field of study (accounting, engineering, etc.). Refer to User-defined Table 0231 - Student Status for suggested values.",
      "length": "2",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "6": {
      "field_id": "PD1.6",
      "name": "Handicap",
      "description": "This field indicates the nature of the patients permanent handicapped condition (e.g., deaf, blind). A handicapped condition is defined as a physical or mental disability that is permanent. Transient handicapped conditions should be sent in the ambulatory status. Refer to User-defined Table 0295 - Handicap for suggested values.",
      "length": "2",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "7": {
      "field_id": "PD1.7",
      "name": "Living Will Code",
      "description": "This field indicates whether or not the patient has a living will and, if so, whether a copy of the living will is on file at the healthcare facility. If the patient does not have a living will, the value of this field indicates whether the patient was provided information on living wills. Refer to User-defined Table 0315 - Living Will Code for suggested values. See also PV2-43 - Living Will Code.",
      "length": "2",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "8": {
      "field_id": "PD1.8",
      "name": "Organ Donor Code",
      "description": "This field indicates whether the patient wants to donate his/her organs and whether an organ donor card or similar documentation is on file with the healthcare organization. Refer to User-defined Table 0316 - Organ Donor Code for suggested values. See also PV2-44 - Organ donor Code .",
      "length": "2",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "9": {
      "field_id": "PD1.9",
      "name": "Separate Bill",
      "description": "This field specifies that charges for this patient are to be billed separately from other patient bills with the same guarantor. (This bill is now a patient bill rather than a guarantor bill.) Refer to HL7 Table 0136 - Yes/no Indicator for valid values.",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "10": {
      "field_id": "PD1.10",
      "name": "Duplicate Patient",
      "description": "This field indicates that a patient is the same as, or a duplicate of, another patient found on the sending system. The intent is to be informational only and no action is required by the receiver. Include the patient identifier if the sender knows an identifier for the patient. The assigning authority and identifier type code are strongly recommended for all CX data types.",
      "length": "250",
      "data_type": "CX - Extended Composite ID with Check Digit",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "11": {
      "field_id": "PD1.11",
      "name": "Publicity Code",
      "description": "This field contains a user-defined code indicating what level of publicity is allowed (e.g., No Publicity, Family Only) for the patient. Refer to User-defined Table 0215 - Publicity Code for suggested values. Refer to PV2-21 - Visit Publicity Code for visit level code.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "12": {
      "field_id": "PD1.12",
      "name": "Protection Indicator",
      "description": "This field identifies the patients protection that determines, in turn, whether access to information about this person should be kept from users who do not have adequate authority for the patient. Refer to HL7 Table 0136 - Yes/no Indicator for valid values.",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "13": {
      "field_id": "PD1.13",
      "name": "Protection Indicator Effective Date",
      "description": "This field indicates the effective date for PD1-12 - Protection Indicator.",
      "length": "8",
      "data_type": "DT - Date",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "14": {
      "field_id": "PD1.14",
      "name": "Place of Worship",
      "description": "The patients place of worship. For example, the patient attends the First Baptist Church of Atlanta.",
      "length": "250",
      "data_type": "XON - Extended Composite Name and Identification Number for Organizations",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "15": {
      "field_id": "PD1.15",
      "name": "Advance Directive Code",
      "description": "This field indicates the patients instructions to the healthcare facility. Refer to User-defined Table 0435 - Advance Directive Code for suggested values. See also PV2-45 - Advance Directive Code .",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "16": {
      "field_id": "PD1.16",
      "name": "Immunization Registry Status",
      "description": "This field identifies the registry status of the patient. The field may be used to indicate the changed status of a once active patient in a registry, such as an immunization registry. Refer to User-defined Table 0441 - Immunization Registry Status for suggested values.",
      "length": "1",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "17": {
      "field_id": "PD1.17",
      "name": "Immunization Registry Status Effective Date",
      "description": "This field indicates the effective date for the registry status reported in PD1-16 - Immunization Registry Status .",
      "length": "8",
      "data_type": "DT - Date",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "18": {
      "field_id": "PD1.18",
      "name": "Publicity Code Effective Date",
      "description": "This is the effective date for PD1-11 - Publicity Code.",
      "length": "8",
      "data_type": "DT - Date",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "19": {
      "field_id": "PD1.19",
      "name": "Military Branch",
      "description": "This field is defined by CMS or other regulatory agencies. Refer to User-defined Table 0140 - Military Service for suggested values.",
      "length": "5",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "20": {
      "field_id": "PD1.20",
      "name": "Military Rank/Grade",
      "description": "This user-defined field identifies the military rank/grade of the patient. Refer to User-defined Table 0141 - Military Rank/Grade for suggested values.",
      "length": "2",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "21": {
      "field_id": "PD1.21",
      "name": "Military Status",
      "description": "This field is defined by CMS or other regulatory agencies. Refer to User-defined Table 0142 - Military Status for suggested values.",
      "length": "3",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    }
  },
  "PV2": {
    "1": {
      "field_id": "PV2.1",
      "name": "Prior Pending Location",
      "description": "This field is required for cancel pending transfer (A26) messages. In all other events it is optional.",
      "length": "80",
      "data_type": "PL - Person Location",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "PV2.2",
      "name": "Accommodation Code",
      "description": "This field indicates the specific patient accommodations for this visit. Refer to User-defined Table 0129 - Accommodation Code for suggested values.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "PV2.3",
      "name": "Admit Reason",
      "description": "This field contains the short description of the reason for patient admission.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "4": {
      "field_id": "PV2.4",
      "name": "Transfer Reason",
      "description": "This field contains the short description of the reason for a patient location change.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "PV2.5",
      "name": "Patient Valuables",
      "description": "This field contains the short description of patient valuables checked in during admission.",
      "length": "25",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "6": {
      "field_id": "PV2.6",
      "name": "Patient Valuables Location",
      "description": "This field indicates the location of the patients valuables.",
      "length": "25",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "7": {
      "field_id": "PV2.7",
      "name": "Visit User Code",
      "description": "This field further categorizes a patients visit with respect to an individual institutions needs, and is expected to be site-specific. Refer to User-defined Table 0130 - Visit User Code for suggested values.",
      "length": "2",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "8": {
      "field_id": "PV2.8",
      "name": "Expected Admit Date/Time",
      "description": "This field contains the date and time that the patient is expected to be admitted. This field is also used to reflect the date/time of an outpatient/emergency patient registration.",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "9": {
      "field_id": "PV2.9",
      "name": "Expected Discharge Date/Time",
      "description": "This field contains the date and time that the patient is expected to be discharged. This is a non-event related date used by ancillaries to determine more accurately the projected workloads. This field is also used to reflect the anticipated discharge date/time of an outpatient/emergency patient, or an inpatient.",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "10": {
      "field_id": "PV2.10",
      "name": "Estimated Length of Inpatient Stay",
      "description": "This field specifies the estimated days of inpatient stays.",
      "length": "3",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "11": {
      "field_id": "PV2.11",
      "name": "Actual Length of Inpatient Stay",
      "description": "This field contains the actual days of inpatient stays. The actual length of the inpatient stay may not be calculated from the admission and discharge dates because of possible leaves of absence.",
      "length": "3",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "12": {
      "field_id": "PV2.12",
      "name": "Visit Description",
      "description": "This field contains a brief user-defined description of the visit.",
      "length": "50",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "13": {
      "field_id": "PV2.13",
      "name": "Referral Source Code",
      "description": "This field contains the name and the identification numbers of the person or organization that made the referral. This person/organization is not the same as the referring doctor. For example, Joe Smith referred me to the Clinic (or to Dr. Jones at the Clinic).",
      "length": "250",
      "data_type": "XCN - Extended Composite ID Number and Name for Persons",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "14": {
      "field_id": "PV2.14",
      "name": "Previous Service Date",
      "description": "This field contains the date of previous service for the same recurring condition. This may be a required field for billing certain illnesses (e.g., accident related) to a third party.",
      "length": "8",
      "data_type": "DT - Date",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "15": {
      "field_id": "PV2.15",
      "name": "Employment Illness Related Indicator",
      "description": "This field specifies whether a patients illness was job-related. Refer to HL7 Table 0136 - Yes/no Indicator for valid values.",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "16": {
      "field_id": "PV2.16",
      "name": "Purge Status Code",
      "description": "This field contains the purge status code for the account. It is used by the application program to determine purge processing. Refer to User-defined Table 0213 - Purge Status Code for suggested values.",
      "length": "1",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "17": {
      "field_id": "PV2.17",
      "name": "Purge Status Date",
      "description": "This field contains the date on which the data will be purged from the system.",
      "length": "8",
      "data_type": "DT - Date",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "18": {
      "field_id": "PV2.18",
      "name": "Special Program Code",
      "description": "This field designates the specific health insurance program for a visit required for healthcare reimbursement. Refer to User-defined Table 0214 - Special Program Codes for suggested values.",
      "length": "2",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "19": {
      "field_id": "PV2.19",
      "name": "Retention Indicator",
      "description": "This field allows the user to control the financial and demographic purge processes at the visit. It is used to preserve demographic and financial data on specific, high priority visits. Refer to HL7 Table 0136 - Yes/no Indicator for valid values.",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "20": {
      "field_id": "PV2.20",
      "name": "Expected Number of Insurance Plans",
      "description": "This field contains the number of insurance plans that may provide coverage for this visit.",
      "length": "1",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "21": {
      "field_id": "PV2.21",
      "name": "Visit Publicity Code",
      "description": "This field contains a user-defined code indicating what level of publicity is allowed for a specific visit. Refer to User-defined Table 0215 - Publicity Code for suggested values. Refer to PD1-11 - Publicity Code for the patient level publicity code.",
      "length": "1",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "22": {
      "field_id": "PV2.22",
      "name": "Visit Protection Indicator",
      "description": "This field identifies the persons protection that determines, in turn, whether access to information about this person should be kept from users who do not have adequate authority for a specific visit. Refer to HL7 Table 0136 - Yes/no Indicator for valid values.",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "23": {
      "field_id": "PV2.23",
      "name": "Clinic Organization Name",
      "description": "This field contains the organization name or sub-unit and identifier that is associated with the (visit) episode of care. For example, the Allergy or Oncology Clinic within the healthcare facility might be named.",
      "length": "250",
      "data_type": "XON - Extended Composite Name and Identification Number for Organizations",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "24": {
      "field_id": "PV2.24",
      "name": "Patient Status Code",
      "description": "This field indicates the status of the episode of care. Refer to User-defined Table 0216 - Patient Status for suggested values.",
      "length": "2",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "25": {
      "field_id": "PV2.25",
      "name": "Visit Priority Code",
      "description": "This field contains the priority of the visit. Refer to User-defined Table 0217 - Visit Priority Code for suggested values.",
      "length": "1",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "26": {
      "field_id": "PV2.26",
      "name": "Previous Treatment Date",
      "description": "This field contains the date that the patient last had treatment for any condition prior to this visit. In the case of a prior hospital visit, it is likely to be the previous discharge date.",
      "length": "8",
      "data_type": "DT - Date",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "27": {
      "field_id": "PV2.27",
      "name": "Expected Discharge Disposition",
      "description": "This field describes what the patients disposition is expected to be at the end of the visit. Refer to User-defined Table 0112 - Discharge Disposition for suggested values.",
      "length": "2",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "28": {
      "field_id": "PV2.28",
      "name": "Signature on File Date",
      "description": "This field contains the date on which a signature was obtained for insurance billing purposes.",
      "length": "8",
      "data_type": "DT - Date",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "29": {
      "field_id": "PV2.29",
      "name": "First Similar Illness Date",
      "description": "This field is used to determine if the patient has a pre-existing condition.",
      "length": "8",
      "data_type": "DT - Date",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "30": {
      "field_id": "PV2.30",
      "name": "Patient Charge Adjustment Code",
      "description": "This field contains a user-defined code that indicates which adjustments should be made to this patients charges. Refer to User-defined Table 0218 - Charge Adjustment for suggested values. This field is the same as GT1-26 - Guarantor Charge Adjustment Code.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "31": {
      "field_id": "PV2.31",
      "name": "Recurring Service Code",
      "description": "This field indicates whether the treatment is continuous. Refer to User-defined Table 0219 - Recurring Service for suggested values.",
      "length": "2",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "32": {
      "field_id": "PV2.32",
      "name": "Billing Media Code",
      "description": "This field indicates if the account is to be rejected from tape billing. Refer to HL7 Table 0136 - Yes/no Indicator for valid values.",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "33": {
      "field_id": "PV2.33",
      "name": "Expected Surgery Date and Time",
      "description": "This field contains the date and time on which the surgery is expected to occur.",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "34": {
      "field_id": "PV2.34",
      "name": "Military Partnership Code",
      "description": "This field indicates that a military healthcare facility has contracted with a non-military healthcare facility for the use of its services. Refer to HL7 Table 0136 - Yes/no Indicator for valid values.",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "35": {
      "field_id": "PV2.35",
      "name": "Military Non-Availability Code",
      "description": "This field indicates whether a patient has permission to use a non-military healthcare facility for treatment. Refer to HL7 Table 0136 - Yes/no Indicator for valid values.",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "36": {
      "field_id": "PV2.36",
      "name": "Newborn Baby Indicator",
      "description": "This field indicates whether the patient is a baby. Refer to HL7 Table 0136 - Yes/no Indicator for valid values.",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "37": {
      "field_id": "PV2.37",
      "name": "Baby Detained Indicator",
      "description": "This field indicates if the baby is detained after the mothers discharge. Refer to HL7 Table 0136 - Yes/no Indicator for valid values.",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "38": {
      "field_id": "PV2.38",
      "name": "Mode of Arrival Code",
      "description": "Identifies how the patient was brought to the healthcare facility. Refer to User-defined Table 0430 - Mode of Arrival Code for suggested values.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "39": {
      "field_id": "PV2.39",
      "name": "Recreational Drug Use Code",
      "description": "This field indicates what recreational drugs the patient uses. It is used for the purpose of room assignment. Refer to User-defined Table 0431 - Recreational Drug Use Code for suggested values.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "40": {
      "field_id": "PV2.40",
      "name": "Admission Level of Care Code",
      "description": "This field indicates the acuity level assigned to the patient at the time of admission. Refer to User-defined Table 0432 - Admission Level of Care Code for suggested values.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "41": {
      "field_id": "PV2.41",
      "name": "Precaution Code",
      "description": "This field indicates non-clinical precautions that need to be taken with the patient. Refer to User-defined Table 0433 - Precaution Code for suggested values.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "42": {
      "field_id": "PV2.42",
      "name": "Patient Condition Code",
      "description": "This field indicates the patients current medical condition for the purpose of communicating to non-medical outside parties, e.g. family, employer, religious minister, media, etc. Refer to User-defined Table 0434 - Patient Condition Code for suggested values.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "43": {
      "field_id": "PV2.43",
      "name": "Living Will Code",
      "description": "This field indicates whether or not the patient has a living will and, if so, whether a copy of the living will is on file at the healthcare facility. If the patient does not have a living will, the value of this field indicates whether the patient was provided information on living wills. Refer to User-defined Table 0315 - Living Will Code for suggested values. See also PD1-7 - Living Will.",
      "length": "2",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "44": {
      "field_id": "PV2.44",
      "name": "Organ Donor Code",
      "description": "This field indicate whether the patient wants to donate his/her organs and whether an organ donor card or similar documentation is on file with the healthcare organization. Refer to User-defined Table 0316 - Organ Donor Code for suggested values. See also PD1-8 - Organ Donor.",
      "length": "2",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "45": {
      "field_id": "PV2.45",
      "name": "Advance Directive Code",
      "description": "This field indicates the patients instructions to the healthcare facility. Refer to User-defined Table 0435 - Advance Directive Code for suggested values. See also PD1-15 - Advance Directive Code.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "46": {
      "field_id": "PV2.46",
      "name": "Patient Status Effective Date",
      "description": "This field indicates the effective date for PV2-24 - Patient Status.",
      "length": "8",
      "data_type": "DT - Date",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "47": {
      "field_id": "PV2.47",
      "name": "Expected LOA Return Date/Time",
      "description": "This field is conditionally required for A21 - Patient goes on LOA. It may be populated in A22 - Patient returns from LOA as well as in the A53 - Cancel LOA for a patient and the A54 - Cancel patient returns from LOA triggers. This field contains the date/time that the patient is expected to return from LOA.",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "48": {
      "field_id": "PV2.48",
      "name": "Expected Pre-admission Testing Date/Time",
      "description": "This field contains the date/time that the patient is expected for pre-admission testing.",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "49": {
      "field_id": "PV2.49",
      "name": "Notify Clergy Code",
      "description": "This field allows the user to indicate whether the clergy should be notified. Refer to User-defined Table 0534 - Notify Clergy Code for suggested values.",
      "length": "20",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    }
  },
  "IN1": {
    "1": {
      "field_id": "IN1.1",
      "name": "Set ID - IN1",
      "description": "IN1-1 - set ID - IN1 contains the number that identifies this transaction. For the first occurrence the sequence number shall be 1, for the second occurrence it shall be 2, etc. The Set ID in the IN1 segment is used to aggregate the grouping of insurance segments. For example, a patient with two insurance plans would have two groupings of insurance segments. IN1, IN2, and IN3 segments for Insurance Plan A with set ID 1, followed by IN1, IN2, and IN3 segments for Insurance Plan B, with set ID 2. There is no set ID in the IN2 segment because it is contained in the IN1, IN2, IN3 grouping, and is therefore not needed. The set ID in the IN3 segment is provided because there can be multiple repetitions of the IN3 segment if there are multiple certifications for the same insurance plan, e.g., IN1 (Set ID 1), IN2, IN3 (Set ID 1), IN3 (Set ID 2), IN3 (Set ID 3)",
      "length": "4",
      "data_type": "SI - Sequence ID",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "IN1.2",
      "name": "Insurance Plan ID",
      "description": "This field contains a unique identifier for the insurance plan. Refer to User-defined Table 0072 - Insurance Plan ID for suggested values. To eliminate a plan, the plan could be sent with null values in each subsequent element. If the respective systems can support it, a null value can be sent in the plan field.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "IN1.3",
      "name": "Insurance Company ID",
      "description": "This field contains unique identifiers for the insurance company. The assigning authority and identifier type code are strongly recommended for all CX data types.",
      "length": "250",
      "data_type": "CX - Extended Composite ID with Check Digit",
      "optionality": "Required",
      "repeatability": "Repeatable indefinitely"
    },
    "4": {
      "field_id": "IN1.4",
      "name": "Insurance Company Name",
      "description": "This field contains the name of the insurance company. Multiple names for the same insurance company may be sent in this field. The legal name is assumed to be in the first repetition. When the legal name is not sent, a repeat delimiter must be sent first for the first repetition.",
      "length": "250",
      "data_type": "XON - Extended Composite Name and Identification Number for Organizations",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "5": {
      "field_id": "IN1.5",
      "name": "Insurance Company Address",
      "description": "This field contains the address of the insurance company. Multiple addresses for the same insurance company may be sent in this field. The mailing address is assumed to be in the first repetition. When the mailing address is not sent, a repeat delimiter must be sent first for the first repetition.",
      "length": "250",
      "data_type": "XAD - Extended Address",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "6": {
      "field_id": "IN1.6",
      "name": "Insurance Co Contact Person",
      "description": "This field contains the name of the person who should be contacted at the insurance company. Multiple names for the same contact person may be sent in this field. The legal name is assumed to be in the first repetition. When the legal name is not sent, a repeat delimiter must be sent first for the first repetition.",
      "length": "250",
      "data_type": "XPN - Extended Person Name",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "7": {
      "field_id": "IN1.7",
      "name": "Insurance Co Phone Number",
      "description": "This field contains the phone number of the insurance company. Multiple phone numbers for the same insurance company may be sent in this field. The primary phone number is assumed to be in the first repetition. When the primary phone number is not sent, a repeat delimiter must be sent first for the first repetition.",
      "length": "250",
      "data_type": "XTN - Extended Telecommunication Number",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "8": {
      "field_id": "IN1.8",
      "name": "Group Number",
      "description": "This field contains the group number of the insureds insurance.",
      "length": "12",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "9": {
      "field_id": "IN1.9",
      "name": "Group Name",
      "description": "This field contains the group name of the insureds insurance.",
      "length": "250",
      "data_type": "XON - Extended Composite Name and Identification Number for Organizations",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "10": {
      "field_id": "IN1.10",
      "name": "Insured's Group Emp ID",
      "description": "This field holds the group employer ID for the insureds insurance. The assigning authority and identifier type code are strongly recommended for all CX data types.",
      "length": "250",
      "data_type": "CX - Extended Composite ID with Check Digit",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "11": {
      "field_id": "IN1.11",
      "name": "Insured's Group Emp Name",
      "description": "This field contains the name of the employer that provides the employees insurance. Multiple names for the same employer may be sent in this sequence. The legal name must be sent first. When the legal name is not sent, a repeat delimiter must be sent first for the first repetition.",
      "length": "250",
      "data_type": "XON - Extended Composite Name and Identification Number for Organizations",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "12": {
      "field_id": "IN1.12",
      "name": "Plan Effective Date",
      "description": "This field contains the date that the insurance goes into effect.",
      "length": "8",
      "data_type": "DT - Date",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "13": {
      "field_id": "IN1.13",
      "name": "Plan Expiration Date",
      "description": "This field indicates the last date of service that the insurance will cover or be responsible for.",
      "length": "8",
      "data_type": "DT - Date",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "14": {
      "field_id": "IN1.14",
      "name": "Authorization Information",
      "description": "Based on the type of insurance, some coverage plans require that an authorization number or code be obtained prior to all non-emergency admissions, and within 48 hours of an emergency admission. Insurance billing would not be permitted without this number. The date and source of authorization are the components of this field.",
      "length": "239",
      "data_type": "AUI - Authorization Information",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "15": {
      "field_id": "IN1.15",
      "name": "Plan Type",
      "description": "This field contains the coding structure that identifies the various plan types, for example, Medicare, Medicaid, Blue Cross, HMO, etc. Refer to User-defined Table 0086 - Plan ID for suggested values.",
      "length": "3",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "16": {
      "field_id": "IN1.16",
      "name": "Name Of Insured",
      "description": "This field contains the name of the insured person. The insured is the person who has an agreement with the insurance company to provide healthcare services to persons covered by the insurance policy. Multiple names for the same insured person may be sent in this field. The legal name is assumed to be in the first repetition. When the legal name is not sent, a repeat delimiter must be sent first for the first repetition.",
      "length": "250",
      "data_type": "XPN - Extended Person Name",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "17": {
      "field_id": "IN1.17",
      "name": "Insured's Relationship To Patient",
      "description": "This field indicates the insureds relationship to the patient. Refer to User-defined Table 0063 - Relationship for suggested values.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "18": {
      "field_id": "IN1.18",
      "name": "Insured's Date Of Birth",
      "description": "This field contains the date of birth of the insured.",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "19": {
      "field_id": "IN1.19",
      "name": "Insured's Address",
      "description": "This field contains the address of the insured person. The insured is the person who has an agreement with the insurance company to provide healthcare services to persons covered by an insurance policy. Multiple addresses for the same insured person may be in this field. The mailing address must be sent in the first repetition. When the legal name is not sent, a repeat delimiter must be sent first for the first repetition.",
      "length": "250",
      "data_type": "XAD - Extended Address",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "20": {
      "field_id": "IN1.20",
      "name": "Assignment Of Benefits",
      "description": "This field indicates whether the insured agreed to assign the insurance benefits to the healthcare provider. If so, the insurance will pay the provider directly. Refer to User-defined Table 0135 - Assignment of Benefits for suggested values.",
      "length": "2",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "21": {
      "field_id": "IN1.21",
      "name": "Coordination Of Benefits",
      "description": "This field indicates whether this insurance works in conjunction with other insurance plans, or if it provides independent coverage and payment of benefits regardless of other insurance that might be available to the patient. Refer to User-defined Table 0173 - Coordination of Benefits for suggested values.",
      "length": "2",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "22": {
      "field_id": "IN1.22",
      "name": "Coord Of Ben. Priority",
      "description": "If the insurance works in conjunction with other insurance plans, this field contains priority sequence. Values are: 1, 2, 3, etc.",
      "length": "2",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "23": {
      "field_id": "IN1.23",
      "name": "Notice Of Admission Flag",
      "description": "This field indicates whether the insurance company requires a written notice of admission from the healthcare provider. Refer to HL7 table 0136 - Yes/no Indicator for valid values.",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "24": {
      "field_id": "IN1.24",
      "name": "Notice Of Admission Date",
      "description": "If a notice is required, this field indicates the date that it was sent.",
      "length": "8",
      "data_type": "DT - Date",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "25": {
      "field_id": "IN1.25",
      "name": "Report Of Eligibility Flag",
      "description": "This field indicates whether this insurance carrier sends a report that indicates that the patient is eligible for benefits and whether it identifies those benefits. Refer to HL7 table 0136 - Yes/no Indicator for valid values.",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "26": {
      "field_id": "IN1.26",
      "name": "Report Of Eligibility Date",
      "description": "This field indicates whether a report of eligibility (ROE) was received, and also indicates the date that it was received.",
      "length": "8",
      "data_type": "DT - Date",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "27": {
      "field_id": "IN1.27",
      "name": "Release Information Code",
      "description": "This field indicates whether the healthcare provider can release information about the patient, and what information can be released. Refer to User-defined Table 0093 - Release Information for suggested values.",
      "length": "2",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "28": {
      "field_id": "IN1.28",
      "name": "Pre-Admit Cert (PAC)",
      "description": "This field contains the pre-admission certification code. If the admission must be certified before the admission, this is the code associated with the admission.",
      "length": "15",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "29": {
      "field_id": "IN1.29",
      "name": "Verification Date/Time",
      "description": "This field contains the date/time that the healthcare provider verified that the patient has the indicated benefits.",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "30": {
      "field_id": "IN1.30",
      "name": "Verification By",
      "description": "Refers to the person who verified the benefits. Multiple names for the same insured person may be sent in this field. The legal name is assumed to be in the first repetition. When the legal name is not sent, a repeat delimiter must be sent first for the first repetition.",
      "length": "250",
      "data_type": "XCN - Extended Composite ID Number and Name for Persons",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "31": {
      "field_id": "IN1.31",
      "name": "Type Of Agreement Code",
      "description": "This field is used to further identify an insurance plan. Refer to User-defined Table 0098 - Type of Agreement for suggested values.",
      "length": "2",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "32": {
      "field_id": "IN1.32",
      "name": "Billing Status",
      "description": "This field indicates whether the particular insurance has been billed and, if so, the type of bill. Refer to User-defined Table 0022 - Billing Status for suggested values.",
      "length": "2",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "33": {
      "field_id": "IN1.33",
      "name": "Lifetime Reserve Days",
      "description": "This field contains the number of days left for a certain service to be provided or covered under an insurance policy.",
      "length": "4",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "34": {
      "field_id": "IN1.34",
      "name": "Delay Before L.R. Day",
      "description": "This field indicates the delay before lifetime reserve days.",
      "length": "4",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "35": {
      "field_id": "IN1.35",
      "name": "Company Plan Code",
      "description": "This field contains optional information to further define the data in IN1-3 - Insurance Company ID . Refer to User-defined Table 0042 - Company Plan Code for suggested values. This table contains codes used to identify an insurance company plan uniquely.",
      "length": "8",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "36": {
      "field_id": "IN1.36",
      "name": "Policy Number",
      "description": "This field contains the individual policy number of the insured to uniquely identify this patients plan. For special types of insurance numbers, there are also special fields in the IN2 segment for Medicaid, Medicare, Champus (i.e., IN2-6 - Medicare Health Ins Card Number, IN2-8 - Medicaid Case Number, IN2-10 - Military ID Number). But we recommend that this field (IN1-36 - Policy Number) be filled even when the patients insurance number is also passed in one of these other fields.",
      "length": "15",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "37": {
      "field_id": "IN1.37",
      "name": "Policy Deductible",
      "description": "This field contains the amount specified by the insurance plan that is the responsibility of the guarantor (i.e. deductible, excess, etc.).",
      "length": "12",
      "data_type": "CP - Composite Price",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "38": {
      "field_id": "IN1.38",
      "name": "Policy Limit - Amount",
      "description": "As of Version 2.3, this field has been retained for backward compatibility only. Use IN2-29 - Policy Type/Amount instead of this field. This field contains the maximum amount that the insurance policy will pay. In some cases, the limit may be for a single encounter.",
      "length": "12",
      "data_type": "CP - Composite Price",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    },
    "39": {
      "field_id": "IN1.39",
      "name": "Policy Limit - Days",
      "description": "This field contains the maximum number of days that the insurance policy will cover.",
      "length": "4",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "40": {
      "field_id": "IN1.40",
      "name": "Room Rate - Semi-Private",
      "description": "As of Version 2.3, this field has been retained for backward compatibility only. Use IN2-28 - Room Coverage Type/Amount instead of this field. When used for backward compatibility, IN1-40 - Room Rate Semi-Private contains the average room rate that the policy covers.",
      "length": "12",
      "data_type": "CP - Composite Price",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    },
    "41": {
      "field_id": "IN1.41",
      "name": "Room Rate - Private",
      "description": "As of Version 2.3, this field has been retained for backward compatibility only. Use IN2-28 - Room Coverage Type/Amount instead of this field . When used for backward compatibility IN1-41 - Room Rate - Private contains the maximum private room rate that the policy covers.",
      "length": "12",
      "data_type": "CP - Composite Price",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    },
    "42": {
      "field_id": "IN1.42",
      "name": "Insured's Employment Status",
      "description": "This field holds the employment status of the insured. Refer to User-defined Table 0066 - Employment Status for suggested values. This field contains UB92 field 64. For this field element, values from the US CMS UB92 and others are used.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "43": {
      "field_id": "IN1.43",
      "name": "Insured's Administrative Sex",
      "description": "This field contains the gender of the insured. Refer to User-defined Table 0001 - Administrative Sex for suggested values.",
      "length": "1",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "44": {
      "field_id": "IN1.44",
      "name": "Insured's Employer's Address",
      "description": "This field contains the address of the insured employees employer. Multiple addresses for the same employer may be sent in this field. The mailing address must be sent first. When the mailing address is not sent, a repeat delimiter must be sent first for the first repetition.",
      "length": "250",
      "data_type": "XAD - Extended Address",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "45": {
      "field_id": "IN1.45",
      "name": "Verification Status",
      "description": "This field contains the status of this patients relationship with this insurance carrier.",
      "length": "2",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "46": {
      "field_id": "IN1.46",
      "name": "Prior Insurance Plan ID",
      "description": "This field uniquely identifies the prior insurance plan when the plan ID changes. Refer to User-defined Table 0072 - Insurance Plan ID for suggested values.",
      "length": "8",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "47": {
      "field_id": "IN1.47",
      "name": "Coverage Type",
      "description": "This field contains the coding structure that identifies the type of insurance coverage, or what types of services are covered for the purposes of a billing system. For example, a physician billing system will only want to receive insurance information for plans that cover physician/professional charges. Refer to User-defined Table 0309 - Coverage Type for suggested values.",
      "length": "3",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "48": {
      "field_id": "IN1.48",
      "name": "Handicap",
      "description": "This field contains a code to describe the insureds disability. Refer to User-defined Table 0295 - Handicap for suggested values.",
      "length": "2",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "49": {
      "field_id": "IN1.49",
      "name": "Insured's ID Number",
      "description": "This data element contains a healthcare institutions identifiers for the insured. The assigning authority and identifier type code are strongly recommended for all CX data types.",
      "length": "250",
      "data_type": "CX - Extended Composite ID with Check Digit",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "50": {
      "field_id": "IN1.50",
      "name": "Signature Code",
      "description": "This field contains the code to indicate how the patient/subscriber authorization signature was obtained and how it is being retained by the provider. Refer to User-defined Table 0535 - Signature Codefor suggested values.",
      "length": "1",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "51": {
      "field_id": "IN1.51",
      "name": "Signature Code Date",
      "description": "The date the patient/subscriber authorization signature was obtained.",
      "length": "8",
      "data_type": "DT - Date",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "52": {
      "field_id": "IN1.52",
      "name": "Insured's Birth Place",
      "description": "This field contains the description of the insureds birth place, for example St. Francis Community Hospital of Lower South Side. The actual address is reported in IN1-19 - Insureds Address with an identifier of N.",
      "length": "250",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "53": {
      "field_id": "IN1.53",
      "name": "VIP Indicator",
      "description": "This field identifies the type of VIP for the insured. Refer to User-defined Table 0099 - VIP indicator for suggested values.",
      "length": "2",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    }
  },
  "MRG": {
    "1": {
      "field_id": "MRG.1",
      "name": "Prior Patient Identifier List",
      "description": "This field contains the prior patient identifier list. This field contains a list of potential old numbers to match. Only one old number can be merged with one new number in a transaction. Refer to HL7 Table 0061 - Check Digit Scheme for valid values. The assigning authority and identifier type code are strongly recommended for all CX data types.",
      "length": "250",
      "data_type": "CX - Extended Composite ID with Check Digit",
      "optionality": "Required",
      "repeatability": "Repeatable indefinitely"
    },
    "2": {
      "field_id": "MRG.2",
      "name": "Prior Alternate Patient ID",
      "description": "This field has been retained for backward compatibility only. Use MRG-1 - Prior Patient Identifier List for all patient identifiers. This field contains the prior alternate patient identifier. Refer to HL7 Table 0061 - Check Digit Scheme for valid values. The assigning authority and identifier type code are strongly recommended for all CX data types.",
      "length": "250",
      "data_type": "CX - Extended Composite ID with Check Digit",
      "optionality": "Backward Compatibility",
      "repeatability": "Repeatable indefinitely"
    },
    "3": {
      "field_id": "MRG.3",
      "name": "Prior Patient Account Number",
      "description": "This field contains the prior patient account number. Refer to HL7 Table 0061 - Check Digit Scheme for valid values. The assigning authority and identifier type code are strongly recommended for all CX data types.",
      "length": "250",
      "data_type": "CX - Extended Composite ID with Check Digit",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "4": {
      "field_id": "MRG.4",
      "name": "Prior Patient ID",
      "description": "This field has been retained for backward compatibility only. Use MRG-1 - Prior Patient Identifier List for all patient identifiers. This field contains the prior patient identifier. Refer to HL7 Table 0061 - Check Digit Scheme for valid values. The assigning authority and identifier type code are strongly recommended for all CX data types.",
      "length": "250",
      "data_type": "CX - Extended Composite ID with Check Digit",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "MRG.5",
      "name": "Prior Visit Number",
      "description": "This field contains the prior visit number. Refer to HL7 Table 0061 - Check Digit Scheme for valid values. The assigning authority and identifier type code are strongly recommended for all CX data types.",
      "length": "250",
      "data_type": "CX - Extended Composite ID with Check Digit",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "6": {
      "field_id": "MRG.6",
      "name": "Prior Alternate Visit ID",
      "description": "This field contains the prior alternate visit number. Refer to HL7 Table 0061 - Check Digit Scheme for valid values. The assigning authority and identifier type code are strongly recommended for all CX data types.",
      "length": "250",
      "data_type": "CX - Extended Composite ID with Check Digit",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "7": {
      "field_id": "MRG.7",
      "name": "Prior Patient Name",
      "description": "This field contains the prior name of the patient. This field is not used to change a patient name. Refer to HL7 Table 0200 - Name Type for valid values.",
      "length": "250",
      "data_type": "XPN - Extended Person Name",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    }
  },
  "AIS": {
    "1": {
      "field_id": "AIS.1",
      "name": "Set ID - AIS",
      "description": "This field contains a number that uniquely identifies the information represented by this segment in this transaction for the purposes of addition, change or deletion.",
      "length": "4",
      "data_type": "SI - Sequence ID",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "AIS.2",
      "name": "Segment Action Code",
      "description": "This field contains the action to be taken when updating or modifying information in this segment from previously sent interface transactions. Refer to HL7 Table 0206 - Segment action code for valid values.\n\nThis field is conditionally required. It is required for all updating or modifying trigger events.",
      "length": "3",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "AIS.3",
      "name": "Universal Service Identifier",
      "description": "This field contains an identifier code for a service to be scheduled. This field may contain a universal service identifier describing the observation/test/battery/procedure or other activity that is to be performed during the requested appointment, similar to the universal service identifier defined for the OBR segment. This code can be based on local and/or universal codes. The use of universal codes is recommended.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "4": {
      "field_id": "AIS.4",
      "name": "Start Date/Time",
      "description": "This field contains the date and time this service needs for the appointment. This field allows the application to identify that the service is required for the appointment at a different time than the appointment's start date/time\n\nThis field is conditionally required. If a value for AIS-5-Start date/time offset is not provided, then a value is required for this field. To specify that there is no difference between the appointment's start date/time and the resource's start date/time either replicate the appointment's start date/time into this field, or specify an offset of zero (0) in AIS-5-Start date/time offset and any valid time unit code in AIS-6-Start date/time offset units",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "AIS.5",
      "name": "Start Date/Time Offset",
      "description": "This field contains the offset this service needs for the appointment, expressed in units of time relative to the scheduled start date/time. This field allows the application to identify that the service is required for the appointment at a different time than the appointment's start date/time. The first component contains the offset amount. An offset of zero (0), or an unvalued field indicates that the service is required at the start date/time of the appointment.\n\nA positive offset (an unsigned or positive number) indicates that the service is required after the appointment's start date/time. Specifying a negative offset indicates that the service is required prior to the specified start date/time of the appointment. Negative offsets are allowed, and sites should clearly define the effect of a negative offset on the appointment's start date/time.\n\nThis field is conditionally required. If a value for AIS-5-Start date/time offset is not provided, then a value is required for this field. To specify that there is no difference between the appointment's start date/time and the resource's start date/time either replicate the appointment's start date/time into this field, or specify an offset of zero (0) in AIS-5-Start date/time offset and any valid time unit code in AIS-6-Start date/time offset units",
      "length": "20",
      "data_type": "NM - Numeric",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "6": {
      "field_id": "AIS.6",
      "name": "Start Date/Time Offset Units",
      "description": "This field contains a code describing the units of time used for expressing the start date/time offset. This field should be valued according to the recommendations in Chapters 2 and 7. If this field is not valued, the ISO base unit of seconds (code s) will be assumed.\n\nThis field is conditionally required. If a value for AIS-5-Start date/time offset is provided, then a value is required for this field.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "7": {
      "field_id": "AIS.7",
      "name": "Duration",
      "description": "This field contains the duration for which the resource is requested/scheduled for this appointment, if different from the overall duration of the requested/scheduled appointment. This field indicates to the application that a resource is required for a different amount of time than the appointment's overall duration. An unvalued duration indicates that the resource is required from its start date/time offset (specified in the previous two fields) until the end of the appointment. If no start date/time offset is specified, then the resource is required for the full duration of the appointment.\n\nThis field must be a positive, non-zero number. A negative number or zero (0) is nonsensical in the context of a duration.",
      "length": "20",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "8": {
      "field_id": "AIS.8",
      "name": "Duration Units",
      "description": "This field contains a code describing the units of time used for expressing the duration. If this field is not valued, the ISO base unit of seconds (code s) will be assumed",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "9": {
      "field_id": "AIS.9",
      "name": "Allow Substitution Code",
      "description": "This field contains a code indicating whether the identified resource can be substituted with an equivalent resource by the filler application. Refer to User-Defined Table 0279 - Allow Substitution Codes For suggested codes.\n\nThis field is conditionally required. It is required for all request messages. It is optional for all unsolicited transactions, and for all query messages",
      "length": "10",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "10": {
      "field_id": "AIS.10",
      "name": "Filler Status Code",
      "description": "This field contains a code that describes the requested/scheduled status of the resource or activity, from the point of view of the filler application. Refer to User-Defined Table 0278 - Filler Status Codes for suggested codes.\n\nThis is a conditionally required field. Because the information contained in this field is only appropriate in transactions originating from a filler application, it is required for those messages. This includes all unsolicited transactions originating from a filler application, as well as all response messages originating from a filler application. This field is optional for all transactions originating from placer, querying and auxiliary applications. It is recommended that this field be left unvalued in transactions originating from applications other than the filler application",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "11": {
      "field_id": "AIS.11",
      "name": "Placer Supplemental Service Information",
      "description": "This field contains supplemental service and/or logistical information sent from the placer system to the filler system for the universal procedure code reported in field AIS-3. This field will be used to provide scheduling information detail that is not available in other, specific fields in the AIS segment. Multiple supplemental service information elements may be reported. Refer to User-defined Table 0411 - Supplemental service information values for possible values.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "12": {
      "field_id": "AIS.12",
      "name": "Filler Supplemental Service Information",
      "description": "This field contains supplemental service and/or logistical information sent from the filler system to the placer system for the procedure code reported in field AIS-3. This field will be used to report scheduling information details that is not available in other, specific fields in the AIS segment. Typically it will reflect the same information as was sent to the filler system in AIS-11-Placer supplemental information unless the scheduling was modified in which case the filler system will report what was actually performed using this field. Multiple supplemental service information elements may be reported. Refer to User-defined Table 0411 - Supplemental service information values for possible values.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    }
  },
  "AIG": {
    "1": {
      "field_id": "AIG.1",
      "name": "Set ID - AIG",
      "description": "This field contains a number that uniquely identifies the information represented by this segment in this transaction for the purposes of addition, change or deletion.",
      "length": "4",
      "data_type": "SI - Sequence ID",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "AIG.2",
      "name": "Segment Action Code",
      "description": "This field contains the action to be taken when updating or modifying information in this segment from previously sent interface transactions. Refer to HL7 Table 0206 - Segment action code for valid values.\n\nThis field is conditionally required. It is required for all updating or modifying trigger events.",
      "length": "3",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "AIG.3",
      "name": "Resource ID",
      "description": "This field contains the ID number and name of the resource being requested or scheduled for an appointment. This field is used to identify a specific resource being requested, or a specific resource that has been scheduled for an appointment. If the specific resource is not known but the type of resource is, AIG-4-resource type is used to identify the type of resource required or scheduled.\n\nAt a minimum, the ID number component should be supplied to identify either the specific resource being requested or the specific resource that has been scheduled. For inter-enterprise communications, for which a shared ID number may not be available, the minimum components required to uniquely identify a resource may be defined by site-specific negotiations.\n\nThis field is conditionally required for this segment. In new schedule request messages, it is required if the request asks that a specific resource be scheduled. For all other request messages, the specific resource",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "4": {
      "field_id": "AIG.4",
      "name": "Resource Type",
      "description": "This field identifies the role of the resource requested/scheduled for this appointment. For requests, if a specific resource is not identified in AIG-3-Resource ID, then this field identifies the type of resource that should be scheduled by the filler application. At a minimum, the type of the identifier component should be valued.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "AIG.5",
      "name": "Resource Group",
      "description": "This field identifies the requested resource as a member of the indicated group. If, in a Schedule Request Message (SRM), no specific resource is requested, but a resource type is requested, this field can be used to further qualify the type of resource being requested.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "6": {
      "field_id": "AIG.6",
      "name": "Resource Quantity",
      "description": "This field contains the quantity of the specified resource or resource type identified in either or both of the preceding two fields. If it is not valued, this field defaults to a value of one (1).",
      "length": "5",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "7": {
      "field_id": "AIG.7",
      "name": "Resource Quantity Units",
      "description": "This field contains the units of the resource requested, whose quantity is given in the preceding field. If this field is not valued, the unit of each (code \"ea\") will be assumed.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "8": {
      "field_id": "AIG.8",
      "name": "Start Date/Time",
      "description": "This field contains the date and time this service needs for the appointment. This field allows the application to identify that the service is required for the appointment at a different time than the appointment's start date/time\n\nThis field is conditionally required. If a value for AIG-9-Start date/time offset is not provided, then a value is required for this field. To specify that there is no difference between the appointment's start date/time and the resource's start date/time either replicate the appointment's start date/time into this field, or specify an offset of zero (0) in AIG-9-Start date/time offset and any valid time unit code in AIG-10-Start date/time offset units.",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "9": {
      "field_id": "AIG.9",
      "name": "Start Date/Time Offset",
      "description": "This field contains the offset that this resource needs for the appointment, expressed in units of time relative to the scheduled start date/time. This field indicates to the application that the resource is required for the appointment at a different time than the appointment's start date/time. The first component indicates the offset amount. An offset of zero (0), or an unvalued field, indicates that the resource is required at the start date/time of the appointment.\n\nA positive offset (an unsigned or positive number) indicates that the resource is required after the appointment's start date/time. Specifying a negative offset indicates that the resource is required prior to the specified start date/time of the appointment. Negative offsets are allowed, and sites should clearly define the effect of a negative offset on the appointment's start date/time.\n\nThis field is conditionally required. If a value for AIG-8-Start date/time is not provided, then a value is required for this field. To specify that there is no difference between the appointment's start date/time and the resource's start date/time either replicate the appointment's start date/time into this field, or specify an offset of zero (0) in AIG-9-Start date/time offset and any valid time unit code in AIG10-Start date/time offset units.",
      "length": "20",
      "data_type": "NM - Numeric",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "10": {
      "field_id": "AIG.10",
      "name": "Start Date/Time Offset Units",
      "description": "This field contains a code describing the units of time used for expressing AIG-9-Start date/time offset. If this field is not valued, the ISO base unit of seconds (code \"s\") will be assumed.\n\nThis field is conditionally required. If a value for AIG-9-Start date/time offset is provided, then a value is required for this field.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "11": {
      "field_id": "AIG.11",
      "name": "Duration",
      "description": "This field contains the duration for which the resource is requested/scheduled for this appointment, if it is different than the overall duration of the requested/scheduled appointment. This field indicates to the application that a resource is required for a different amount of time than the appointment's overall duration. An unvalued duration indicates that the resource is required from its start date/time offset (specified in the previous two fields) until the end of the appointment. If no start date/time offset is specified, then the resource is required for the full duration of the appointment.\n\nThis field must be a positive, non-zero number. A negative number or zero (0) is nonsensical in the context of a duration.",
      "length": "20",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "12": {
      "field_id": "AIG.12",
      "name": "Duration Units",
      "description": "This field contains a code describing the units of time used for expressing the AIG-11-Duration field. If this field is not valued, the ISO base unit of seconds (code \"s\") will be assumed.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "13": {
      "field_id": "AIG.13",
      "name": "Allow Substitution Code",
      "description": "This field contains a code indicating whether the identified resource can be substituted with an equivalent resource by the filler application. Refer to User-Defined Table 0279 - Allow Substitution Codes for suggested codes.\n\nThis field is conditionally required. It is required for all request messages. It is optional for all unsolicited transactions, and for all query messages.",
      "length": "10",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "14": {
      "field_id": "AIG.14",
      "name": "Filler Status Code",
      "description": "This field contains a code that describes the requested/scheduled status of scheduling resource or activity, from the point of view of the filler application. Refer to User-Defined Table 0278 - Filler Status Codes for suggested codes.\n\nThis is a conditionally required field. Because the information contained in this field is only appropriate in transactions originating from a filler application, it is required for those messages. This includes all unsolicited transactions originating from a filler application, as well as all response messages originating from a filler application. This field is optional for all transactions originating from placer, querying and auxiliary applications. It is recommended that this field be left unvalued in transactions originating from applications other than the filler application.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    }
  },
  "AIL": {
    "1": {
      "field_id": "AIL.1",
      "name": "Set ID - AIL",
      "description": "This field contains a number that uniquely identifies the information represented by this segment in this transaction for the purposes of addition, change or deletion.",
      "length": "4",
      "data_type": "SI - Sequence ID",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "AIL.2",
      "name": "Segment Action Code",
      "description": "This field contains the action to be taken when updating or modifying information in this segment from previously sent interface transactions. Refer to HL7 Table 0206 - Segment action code for valid values.\n\nThis field is conditionally required. It is required for all updating or modifying trigger events",
      "length": "3",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "AIL.3",
      "name": "Location Resource ID",
      "description": "This field contains a coded identification of the location being requested or scheduled for an appointment. This field is used to identify a specific location being requested, or a specific location that has been scheduled for an appointment. If the specific location is not known but the type of location is, AIL-4-Location type-AIL is used to identify the type of location required or scheduled. This field is conditionally required for this segment. In new schedule request messages, it is required if the request asks that a specific location be scheduled. For all other request messages, the specific location should be identified if the information is available (either because a specific location was initially requested, or because the filler application returned the coded identification of the specific location that has been scheduled).\n\nThis field is repeating in order to accommodate both local and enterprise-wide identifiers.\n\nThis field is required for all unsolicited transactions from the filler application. It is optional for all query transactions.",
      "length": "80",
      "data_type": "PL - Person Location",
      "optionality": "Conditional",
      "repeatability": "Repeatable indefinitely"
    },
    "4": {
      "field_id": "AIL.4",
      "name": "Location Type-AIL",
      "description": "This field identifies the type of the location requested/scheduled for this appointment. For all messages, this field is conditionally required if a specific location is not identified in AIL-3-Location resource ID. Refer to HL7 Table 0305 - Person location type for suggested values.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "AIL.5",
      "name": "Location Group",
      "description": "This field identifies the requested resource as a member of the indicated group. If, in a Schedule Request Message (SRM), no specific location is requested, but a location type is requested, AIL-5-Location group can be used to further qualify the type of resource being requested.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "6": {
      "field_id": "AIL.6",
      "name": "Start Date/Time",
      "description": "This field contains the date and time this service needs for the appointment. This field allows the application to identify that the service is required for the appointment at a different time than the appointment's start date/time\n\nThis field is conditionally required. If a value for AIL-7-Start date/time offset is not provided, then a value is required for this field. To specify that there is no difference between the appointment's start date/time and the resource's start date/time either replicate the appointment's start date/time into this field, or specify an offset of zero (0) in AIL-7-Start date/time offset and any valid time unit code in AIL-8-Start date/time offset units.",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "7": {
      "field_id": "AIL.7",
      "name": "Start Date/Time Offset",
      "description": "This field contains the offset this resource needs for the appointment, expressed in units of time relative to the scheduled start date/time. This field indicates to the application that the resource is required for the appointment at a different time than the appointment's start date/time. The first component contains the offset amount. An offset of zero (0), or an unvalued field, indicates that the resource is required at the start date/time of the appointment.\n\nA positive offset (an unsigned or positive number) indicates that the resource is required after the appointment's start date/time. Specifying a negative offset indicates that the resource is required prior to the specified start date/time of the appointment. Negative offsets are allowed, and sites should clearly define the effect of a negative offset on the appointment's start date/time.\n\nThis field is conditionally required. If a value for AIL-6-Start date/time is not provided, then a value is required for this field. To specify that there is no difference between the appointment's start date/time and the resource's start date/time either replicate the appointment's start date/time into this field, or specify an offset of zero (0) in AIL-7-Start date/time offset and any valid time unit code in AIL-8-Start date/time offset units",
      "length": "20",
      "data_type": "NM - Numeric",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "8": {
      "field_id": "AIL.8",
      "name": "Start Date/Time Offset Units",
      "description": "This field contains a code describing the units of time used for expressing the AIL-7-Start date/time offset field. If this field is not valued, the ISO base unit of seconds (code \"s\") will be assumed.\n\nThis field is conditionally required. If a value for AIL-7-Start date/time offset is provided, then a value is required for this field",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "9": {
      "field_id": "AIL.9",
      "name": "Duration",
      "description": "This field contains the duration for which the resource is requested/scheduled for this appointment, if it is different than the overall duration of the requested/scheduled appointment. This field indicates to the application that a resource is required for a different amount of time than the appointment's overall duration. An unvalued duration indicates that the resource is required from its start date/time offset (specified in the previous two fields) until the end of the appointment. If no start date/time offset is specified, then the resource is required for the full duration of the appointment.\n\nThis field must be a positive, non-zero number. A negative number or zero (0) is nonsensical in the context of a duration",
      "length": "20",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "10": {
      "field_id": "AIL.10",
      "name": "Duration Units",
      "description": "This field contains a code describing the units of time used associated with AIL-9-Duration. If this field is not valued, the ISO base unit of seconds (code \"s\") will be assumed.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "11": {
      "field_id": "AIL.11",
      "name": "Allow Substitution Code",
      "description": "This field contains a code indicating whether the identified location can be replaced with an equivalent substitute location by the filler application. Refer to User-Defined Table 0279 - Allow Substitution Codes for suggested codes.\n\nThis field is conditionally required. It is required for all request messages. It is optional for all unsolicited transactions, and for all query messages",
      "length": "10",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "12": {
      "field_id": "AIL.12",
      "name": "Filler Status Code",
      "description": "This field contains a code that describes the requested/scheduled status of the location, from the point of view of the filler application. Refer to User-Defined Table 0278 - Filler Status Codes for suggested codes.\n\nThis is a conditionally required field. Because the information contained in this field is only appropriate in transactions originating from a filler application, it is required for those messages. This includes all unsolicited transactions originating from a filler application, as well as all response messages originating from a filler application. This field is optional for all transactions originating from placer, querying and auxiliary applications. It is recommended that this field be left unvalued in transactions originating from applications other than the filler application",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    }
  },
  "AIP": {
    "1": {
      "field_id": "AIP.1",
      "name": "Set ID - AIP",
      "description": "This field contains a number that uniquely identifies the information represented by this segment in this transaction for the purposes of addition, change or deletion.",
      "length": "4",
      "data_type": "SI - Sequence ID",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "AIP.2",
      "name": "Segment Action Code",
      "description": "This field contains the action to be taken when updating or modifying information in this segment from previously sent interface transactions. Refer to HL7 Table 0206 - Segment action code.\n\nThis field is conditionally required. It is required for all updating or modifying trigger events",
      "length": "3",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "AIP.3",
      "name": "Personnel Resource ID",
      "description": "This field contains the ID number and name of the person being requested or scheduled for an appointment. This field is used to identify a specific person being requested, or a specific person who has been scheduled as a resource for an appointment. If the specific person is not known, but the type of resource is, AIP-4-Resource type is used to identify the type of personnel resource required or scheduled. At a minimum, the ID number component should be supplied to identify either the specific person being requested or the specific person who has been scheduled. For inter-enterprise communications, for which a shared ID number may not be available, the minimum components needed to uniquely identify a person may be defined by site-specific negotiations.\n\nThis field is conditionally required for this segment. In new schedule request messages, it is required if the request asks that a specific person be scheduled. For all other request messages, the specific person should be identified if the information is available (either because a specific person was initially requested, or because the filler application returned the ID of the specific person who has been scheduled).\n\nThis field is required for all unsolicited transactions from the filler application. This field is optional for all query transactions",
      "length": "250",
      "data_type": "XCN - Extended Composite ID Number and Name for Persons",
      "optionality": "Conditional",
      "repeatability": "Repeatable indefinitely"
    },
    "4": {
      "field_id": "AIP.4",
      "name": "Resource Type",
      "description": "This field identifies the type of the personnel requested/scheduled for an appointment. For all messages, this field is conditionally required if a specific location is not identified in AIP-3-Personnel resource ID. Refer to HL7 Table 0182 - Staff type.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "AIP.5",
      "name": "Resource Group",
      "description": "This field identifies the requested resource as a member of the indicated group. If, in a Schedule Request Message (SRM), no specific resource is requested, but an AIP-4-Resource type is requested, the AIP-5-Resource group field can be used to further qualify the type of resource being requested.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "6": {
      "field_id": "AIP.6",
      "name": "Start Date/Time",
      "description": "This field contains the date and time this service needs for the appointment. This field allows the application to identify that the service is required for the appointment at a different time than the appointment's start date/time.\n\nThis field is conditionally required. If a value for AIP-7-Start date/time offset is not provided, then a value is required for this field. To specify that there is no difference between the appointment's start date/time and the resource's start date/time either replicate the appointment's start date/time into this field, or specify an offset of zero (0) in AIP-7-Start date/time offset and any valid time unit code in AIP-8-Start date/time offset units",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "7": {
      "field_id": "AIP.7",
      "name": "Start Date/Time Offset",
      "description": "This field contains the offset this resource needs for the appointment, expressed in units of time relative to the scheduled start date/time. This field indicates to the application that the resource is required for the appointment at a different time than the appointment's start date/time. The first component contains the offset amount. An offset of zero (0), or an unvalued field, indicates that the resource is required at the start date/time of the appointment.\n\nA positive offset (an unsigned or positive number) indicates that the resource is required after the appointment's start date/time. Specifying a negative offset indicates that the resource is required prior to the specified start date/time of the appointment. Negative offsets are allowed, and sites should clearly define the effect of a negative offset on the appointment's start date/time.\n\nThis field is conditionally required. If a value for AIP-6-Start date/time is not provided, then a value is required for this field. To specify that there is no difference between the appointment's start date/time and the resource's start date/time either replicate the appointment's start date/time into this field, or specify an offset of zero (0) in AIP-7-Start date/time offset and any valid time unit code in AIP-8-Start date/time offset units",
      "length": "20",
      "data_type": "NM - Numeric",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "8": {
      "field_id": "AIP.8",
      "name": "Start Date/Time Offset Units",
      "description": "This field contains a code describing the units of time used for expressing AIP-7-Start date/time offset. If this field is not valued, the ISO base unit of seconds (code \"s\") is assumed.\n\nThis field is conditionally required. If a value for AIP-7-Start date/time offset is provided, then a value is required for this field",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "9": {
      "field_id": "AIP.9",
      "name": "Duration",
      "description": "This field contains the duration for which the resource is requested/scheduled for an appointment, if different from the overall duration of the requested/scheduled appointment. This field indicates to the application that a resource is required for a different amount of time than the appointment's overall duration. An unvalued duration indicates that the resource is required from its start date/time offset (specified in the previous two fields) until the end of the appointment. If no start date/time offset is specified, then the resource is required for the full duration of the appointment.\n\nThis field must be a positive, non-zero number. A negative number or zero (0) is nonsensical in the context of a duration",
      "length": "20",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "10": {
      "field_id": "AIP.10",
      "name": "Duration Units",
      "description": "This field contains a code describing the units of time used associated with AIP-9-Duration. If this field is not valued, the ISO base unit of seconds (code \"s\") will be assumed.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "11": {
      "field_id": "AIP.11",
      "name": "Allow Substitution Code",
      "description": "This field contains a code indicating whether the identified personnel resource can be replaced with an equivalent substitute personnel resource by the filler application. Refer to User-Defined Table 0279 - Allow Substitution Codes for suggested codes.\n\nThis field is conditionally required. It is required for all request messages. It is optional for all unsolicited transactions, and for all query messages",
      "length": "10",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "12": {
      "field_id": "AIP.12",
      "name": "Filler Status Code",
      "description": "This field contains a code that describes the requested/scheduled status of the personnel resource, from the point of view of the filler application. Refer to User-Defined Table 0278 - Filler Status Codes for suggested codes.\n\nThis field is conditionally required. It should not be valued in any request transactions from the placer application to the filler application. It is required for all transactions from the filler application. It is optional for query transactions.\n\nThis is a conditionally required field. Because the information contained in this field is only appropriate in transactions originating from a filler application, it is required for those messages. This includes all unsolicited transactions originating from a filler application, as well as all response messages originating from a filler application. This field is optional for all transactions originating from placer, querying and auxiliary applications. It is recommended that this field be left unvalued in transactions originating from applications other than the filler application",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    }
  },
  "SCH": {
    "1": {
      "field_id": "SCH.1",
      "name": "Placer Appointment ID",
      "description": "This field contains the placer application's permanent identifier for the appointment request (and the scheduled appointment itself, when it has been confirmed as a booked slot by the filler application). This is a composite field.\n\nThe first component is a string that identifies an individual appointment request, or a booked appointment. It is assigned by the placer application, and identifies an appointment request, and the subsequent scheduled appointment, uniquely among all such requests and/or booked appointments from a particular requesting application. If SCH-1-Placer appointment ID identifies a parent of a repeating schedule request, then the individual child scheduled appointments can be uniquely identified either by a new SCH-1-Placer appointment ID or by SCH-23-Parent placer appointment ID plus an SCH-3-Occurrence number.\n\nIf a schedule request originates from a placer it MUST have a placer appointment ID. If the filler sends responses, it may use the placer appointment ID and/or assign a filler appointment ID (which it would echo back to the placer to enable the placer application to associate the two). If the placer appointment ID is not present, the filler appointment ID must be present and vice versa.",
      "length": "75",
      "data_type": "EI - Entity Identifier",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "SCH.2",
      "name": "Filler Appointment ID",
      "description": "This field contains the filler application's permanent identifier for the appointment request (and the scheduled appointment itself, when it has been confirmed as a booked slot by the filler application). This is a composite field.\n\nThe first component is a string of up to fifteen characters that identifies an individual appointment request, or a booked appointment. It is assigned by the filler application, and identifies an appointment request, and the subsequent scheduled appointment, uniquely among all such requests and/or booked appointments from a particular processing application. If SCH-2-Filler appointment ID identifies a parent of a repeating schedule request, then the individual child scheduled appointments can be uniquely identified either by a new SCH-2-Filler appointment ID or by SCH-25-Parent filler appointment ID plus an SCH-3-Occurrence number.",
      "length": "75",
      "data_type": "EI - Entity Identifier",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "SCH.3",
      "name": "Occurrence Number",
      "description": "This field is used in conjunction with SCH-1-Placer appointment ID and/or SCH-2-Filler appointment ID to uniquely identify an individual occurrence (a child) of a parent repeating schedule appointment.\n\nThis field is conditionally required. If the transaction using this segment is intended to apply only to one occurrence of a repeating appointment, and an occurrence number is required to uniquely identify the child appointment (that is, the child does not have a separate and unique SCH-1-Placer appointment ID or SCH2-Filler appointment ID), then this field is required.",
      "length": "5",
      "data_type": "NM - Numeric",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "4": {
      "field_id": "SCH.4",
      "name": "Placer Group Number",
      "description": "This field allows a placer application to group sets of appointment requests together, and subsequently to identify the group.",
      "length": "22",
      "data_type": "EI - Entity Identifier",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "SCH.5",
      "name": "Schedule ID",
      "description": "This field contains an identifier code for the schedule in which this appointment is (or will be) booked. This field is provided for instances in which filler applications maintain multiple schedules, and when a particular resource or set of resources is controlled by more than one of those schedules.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "6": {
      "field_id": "SCH.6",
      "name": "Event Reason",
      "description": "This field contains an identifier code for the reason that the notification event was triggered. This field may contain a code describing the cancel reason, the delete reason, the discontinue reason, the add reason, the block reason or any other code describing the reason that a specific event will occur.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "7": {
      "field_id": "SCH.7",
      "name": "Appointment Reason",
      "description": "This field contains an identifier code for the reason that the appointment is to take place. This field may contain a Universal Service ID describing the observation/test/battery/procedure or other activity that is to take place during the requested appointment, similar to the Universal Service ID defined for the OBR segment. It may also contain a site-specific code describing a pre-defined set of reasons that an appointment may be set to occur. This code can be based on local and/or universal codes. The use of universal codes is recommended. Refer to User-Defined Table 0276 - Appointment Reason Code s for suggested codes.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "8": {
      "field_id": "SCH.8",
      "name": "Appointment Type",
      "description": "This field contains the identifier code for the type of appointment. Refer to User-Defined Table 0277 - Appointment Type Codes for suggested codes.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "9": {
      "field_id": "SCH.9",
      "name": "Appointment Duration",
      "description": "As of Version 2.5, this field is retained for backward compatibility only. Refer to the TQ1 segment.\n\nThis field specifies the amount of time requested and allotted for the appointment. In cases of repeating appointments, this field describes the duration of one instance of the appointment. If this field is unvalued, then the institution's standard duration for the type of appointment requested will be assumed.",
      "length": "20",
      "data_type": "NM - Numeric",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    },
    "10": {
      "field_id": "SCH.10",
      "name": "Appointment Duration Units",
      "description": "As of Version 2.5, this field is retained for backward compatibility only. Refer to the TQ1 segment.\n\nThis field contains a code describing the units of time used for expressing the ARQ-9-Appointment duration field. If this component is not valued, the ISO base unit of seconds (code \"s\") is assumed.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    },
    "11": {
      "field_id": "SCH.11",
      "name": "Appointment Timing Quantity",
      "description": "As of Version 2.5, this field is retained for backward compatibility only. Refer to the TQ1 segment.\n\nThis field contains the scheduled appointment's timing and quantity, as scheduled by the filler application. The TQ1 segment fully describes the components and the appropriate data values for the components of this field.",
      "length": "200",
      "data_type": "TQ - Timing Quantity",
      "optionality": "Backward Compatibility",
      "repeatability": "Repeatable indefinitely"
    },
    "12": {
      "field_id": "SCH.12",
      "name": "Placer Contact Person",
      "description": "This field identifies the person responsible for requesting the scheduling of a requested appointment. Most often, this person will be the same person responsible for executing the appointment.",
      "length": "250",
      "data_type": "XCN - Extended Composite ID Number and Name for Persons",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "13": {
      "field_id": "SCH.13",
      "name": "Placer Contact Phone Number",
      "description": "This field contains the phone number used to contact the SCH-12-Placer contact person.",
      "length": "250",
      "data_type": "XTN - Extended Telecommunication Number",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "14": {
      "field_id": "SCH.14",
      "name": "Placer Contact Address",
      "description": "This field contains the address used to contact the SCH-12-Placer contact person.",
      "length": "250",
      "data_type": "XAD - Extended Address",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "15": {
      "field_id": "SCH.15",
      "name": "Placer Contact Location",
      "description": "This field contains a code that identifies the location of the SCH-12-Placer contact person.",
      "length": "80",
      "data_type": "PL - Person Location",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "16": {
      "field_id": "SCH.16",
      "name": "Filler Contact Person",
      "description": "This field identifies the person responsible for the scheduling of the requested appointment. Most often, this person will be the same person responsible for maintaining the schedule and for reviewing appointment requests.",
      "length": "250",
      "data_type": "XCN - Extended Composite ID Number and Name for Persons",
      "optionality": "Required",
      "repeatability": "Repeatable indefinitely"
    },
    "17": {
      "field_id": "SCH.17",
      "name": "Filler Contact Phone Number",
      "description": "This field contains the phone number used to contact the SCH-16-Filler contact person.",
      "length": "250",
      "data_type": "XTN - Extended Telecommunication Number",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "18": {
      "field_id": "SCH.18",
      "name": "Filler Contact Address",
      "description": "This field contains the address used to contact the SCH-16-Filler contact person.",
      "length": "250",
      "data_type": "XAD - Extended Address",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "19": {
      "field_id": "SCH.19",
      "name": "Filler Contact Location",
      "description": "This field contains a code that identifies the location of the SCH-16-Filler Contact Person.",
      "length": "80",
      "data_type": "PL - Person Location",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "20": {
      "field_id": "SCH.20",
      "name": "Entered By Person",
      "description": "This field identifies the person responsible for entering the request for the scheduling of an appointment. It is included to provide an audit trail of persons responsible for the request. This person may be someone other than the placer contact person, who is responsible for entering orders and requests.",
      "length": "250",
      "data_type": "XCN - Extended Composite ID Number and Name for Persons",
      "optionality": "Required",
      "repeatability": "Repeatable indefinitely"
    },
    "21": {
      "field_id": "SCH.21",
      "name": "Entered By Phone Number",
      "description": "This field contains the phone number used to contact the ARQ-19-Entered by person.",
      "length": "250",
      "data_type": "XTN - Extended Telecommunication Number",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "22": {
      "field_id": "SCH.22",
      "name": "Entered By Location",
      "description": "This field contains a code that identifies the location of the entered by person.",
      "length": "80",
      "data_type": "PL - Person Location",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "23": {
      "field_id": "SCH.23",
      "name": "Parent Placer Appointment ID",
      "description": "This field relates a child to its parent, when a parent-child relationship exists. It contains the placer application's permanent identifier for the parent of the appointment request. This is a composite field.",
      "length": "75",
      "data_type": "EI - Entity Identifier",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "24": {
      "field_id": "SCH.24",
      "name": "Parent Filler Appointment ID",
      "description": "This field relates a child to its parent, when a parent-child relationship exists. It contains the filler application's permanent identifier for the parent of the appointment request. This is a composite field.\n\nThe first component is a string that identifies the parent appointment request. It is assigned by the filler application, and it identifies an appointment request uniquely among all such requests on a particular processing application.\n\nThis is a conditionally required field. On initial messages where a filler has not yet assigned a filler appointment ID, this field should not contain a value. In all other subsequent messages, where a filler application has assigned a filler appointment ID, this field is required.",
      "length": "75",
      "data_type": "EI - Entity Identifier",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "25": {
      "field_id": "SCH.25",
      "name": "Filler Status Code",
      "description": "This field contains a code describing the status of the appointment with respect to the filler application. Refer to User-Defined Table 0278 - Filler Status Codes for suggested codes.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "26": {
      "field_id": "SCH.26",
      "name": "Placer Order Number",
      "description": "This field is the placer application's order number for the order associated with this scheduling filler application response.\n\nThis field is described in detail in Section 4.5.1.2. It is an optional field, but if a Placer order number is present, then a Filler order number (Section 10.6.2.27) must also be present. Both this field and the Filler order number below may have been sent as part of the appointment request in the ARQ segment or they may be assigned by the scheduling filler application only.",
      "length": "22",
      "data_type": "EI - Entity Identifier",
      "optionality": "Conditional",
      "repeatability": "Repeatable indefinitely"
    },
    "27": {
      "field_id": "SCH.27",
      "name": "Filler Order Number",
      "description": "This field is the order number assigned by the filler application for the order associated with this scheduling filler response.\n\nThis field is described in detail in Section 4.5.1.3. It is conditionally mandatory depending on the presence of the Placer order number (Section 10.6.2.26). This conditionally mandatory requirement addresses the concern that a Scheduling system cannot and should not create or fill an order. Therefore, an order must have been accepted by the order filler application before scheduling the resources associated with that order.",
      "length": "22",
      "data_type": "EI - Entity Identifier",
      "optionality": "Conditional",
      "repeatability": "Repeatable indefinitely"
    }
  }
}