{
  "segment_id": "ORC",
  "short_description": "Commom Order",
  "description": "The Common Order segment (ORC) is used to transmit data elements that are common to all orders (all types of services that are requested). The ORC segment is required in both the Order (ORM) and Order Acknowledgement (ORR) messages.",
  "fields": {
    "1": {
      "field_id": "ORC.1",
      "name": "Order Control",
      "description": "determines the function of the order segment. Refer to table 0119 - order control for valid entries. Very detailed explanatory notes are given at the end of this section",
      "length": "2",
      "data_type": "ID - Coded Value",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "10": {
      "field_id": "ORC.10",
      "name": "Entered By",
      "description": "identity of the person who actually keyed the request into the application. It provides an audit trail in case the request is entered incorrectly and the ancillary department needs to clarify the request. By local agreement, either the ID number or name component may be omitted",
      "length": "80",
      "data_type": "CN_PERSON - Cn For Person",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "11": {
      "field_id": "ORC.11",
      "name": "Verified By",
      "description": "identity of the person who verified the accuracy of the entered request. It is used in cases where the request is entered by a technician and needs to be verified by a higher authority (e.g., a nurse). By local agreement, either the ID number or name component may be omitted",
      "length": "80",
      "data_type": "CN_PERSON - Cn For Person",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "12": {
      "field_id": "ORC.12",
      "name": "Ordering Provider",
      "description": "identity of the person who is responsible for creating the request (i.e., ordering physician). ORC-12ordering provider is the same as OBR-16-ordering provider",
      "length": "80",
      "data_type": "CN_PERSON - Cn For Person",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "13": {
      "field_id": "ORC.13",
      "name": "Enterer's Location",
      "description": "location (e.g., department, floor) of the person who entered the request. It is a composite field that may be used on a site-specific basis to include some subcategory of department. For example, ICU4 might be the designation for a fourth-floor ICU location",
      "length": "80",
      "data_type": "PL - Person Location",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "14": {
      "field_id": "ORC.14",
      "name": "Call Back Phone Number",
      "description": "telephone number to call for clarification of a request or other information regarding the order. ORC14-call back phone number is the same as OBR-17-order call back phone number",
      "length": "40",
      "data_type": "TN - Telephone Number",
      "optionality": "Optional",
      "repeatability": "Repeatable twice"
    },
    "15": {
      "field_id": "ORC.15",
      "name": "Order Effective Date / Time",
      "description": "date/time that the changes to the request took effect or are supposed to take effect",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "16": {
      "field_id": "ORC.16",
      "name": "Order Control Code Reason",
      "description": "explanation (either in coded or text form) of the reason for the order event described by the order control code (table 0119). Whereas an NTE after the order specific segment (e.g., RXO, ORO, OBR) would provide a comment for that specific segment, the purpose of the order control code reason is only to expand on the reason for the order event",
      "length": "200",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "18": {
      "field_id": "ORC.18",
      "name": "Entering Device",
      "description": "identifier of the physical device (terminal, PC) used to enter the order",
      "length": "60",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "19": {
      "field_id": "ORC.19",
      "name": "Action By",
      "description": "Identity of the person who initiated the event represented by the corresponding order control code. For example, if the order control code is CA (cancel order request), this field represents the person who requested the order cancellation",
      "length": "80",
      "data_type": "CN_PERSON - Cn For Person",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "ORC.2",
      "name": "Placer Order Number",
      "description": "placer application's order number",
      "length": "75",
      "data_type": "CM_PLACER - Order Number Of The Client / The Contracting Authority",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "ORC.3",
      "name": "Filler Order Number",
      "description": "order number associated with the filling application",
      "length": "75",
      "data_type": "CM_FILLER - Number Of Processing Power Point",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "4": {
      "field_id": "ORC.4",
      "name": "Placer Group Number",
      "description": "allows an order placing application to group sets of orders together and subsequently identify them",
      "length": "75",
      "data_type": "CM_GROUP_ID - Order Group Number",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "ORC.5",
      "name": "Order Status",
      "description": "status of an order. Refer to table 0038 - order status for valid entries. The purpose of this field is to report the status of an order either upon request (solicited), or when the status changes (unsolicited). It does not initiate action. It is assumed that the order status always reflects the status as it is known to the sending application at the time that the message is sent. Only the filler can originate the value of this field",
      "length": "2",
      "data_type": "ID - Coded Value",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "6": {
      "field_id": "ORC.6",
      "name": "Response Flag",
      "description": "allows the placer (sending) application to determine the amount of information to be returned from the filler. Sometimes the requested level of response may not be possible immediately, but when it is possible, the filler (receiving) application must send the information. When the field is null, D is the default value of the field. Refer to table 0121 - response flag for valid entries",
      "length": "1",
      "data_type": "ID - Coded Value",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "7": {
      "field_id": "ORC.7",
      "name": "Quantity / Timing",
      "description": "determines the priority, quantity, frequency, and timing of an atomic service. Order segments should be thought of as describing an atomic service.",
      "length": "200",
      "data_type": "TQ - Timing Quantity",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "8": {
      "field_id": "ORC.8",
      "name": "Parent",
      "description": "relates a child to its parent when a parent-child relationship exists. The parent-child mechanism is described under ORC-1-order control notes.",
      "length": "200",
      "data_type": "CM_EIP - Parent Order",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "9": {
      "field_id": "ORC.9",
      "name": "Date / Time Of Transaction",
      "description": "Date and time the current transaction enters the ordering application. For messages creating new orders, this is the date and time the order was entered. For other messages, this is the date and time the current transaction (e.g., cancellation) enters the sending application. This date and time is for the current transaction and is not a \"replacement\" time for a correction to the original order. Similarly, ORC-10-entered by, ORC-11-verified by, and ORC-13-enterer's location of this segment relate to the current transaction, not the original order",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    }
  }
}