{
  "segment_id": "RXC",
  "short_description": "Pharmacy Component Order",
  "description": "If the drug ordered with the RXO segment is a compound drug OR an IV solution, AND there is not a coded value for the Universal Service ID which specifies the components (base and all additives), then the components (the base and additives) are specified by two or more RXC segments. The policy of the Pharmacy application on substitutions at the RXC level is identical to that for the RXO level.",
  "fields": {
    "1": {
      "field_id": "RXC.1",
      "name": "Rx Component Type",
      "description": "For the non-IV case, the \"B\" value may still apply. For example, if a custom dermatologic salve is being prepared, the \"B\" item might be a standard base ointment into which other components are mixed.\n\nThe amount of the \"base\" specified in the \"B\" segment(s) is defined to be the quantity into which amounts specified in the \"A\" components are mixed. Thus the RXC segments as a group define the \"recipe\" for a particular amount (defined by the base segment(s)). The give amount, as defined in the RXO, does not need to correspond to this base amount. For example, the RXC segments may specify a recipe for a liter of a standard type of saline with 1 gram of a particular antibiotic, while the give amount (from the RXO) may specify the administration of 2 liters of this IV-solution every 24 hours.\n\nThe amount specified in each \"A\" segment is defined to be the quantity to be added to the amount of the base as specified in its RXC segment.\n\nIf any \"base\" components are present then these should be transmitted first. The first \"base\" component in the transmission should be considered the \"primary base\" if such a distinction is necessary. Similarly, the first \"additive\" in the transmission should be considered the \"primary additive\" if such a distinction is necessary.",
      "length": "1",
      "data_type": "ID - Coded Value",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "RXC.2",
      "name": "Component Code",
      "description": "equivalent to OBR-4-universal service ID. It defines the base or component in the same manner as the give and dispense codes. As with the give and dispense codes, it may contain text only, code only, text + code, or text + code + units (implied or explicit). As with the give and dispense codes, if RXC-4component units is present, this overrides the units implied by the code. If only text is present, the Pharmacy application must include a manual review or reentering of the component drug",
      "length": "100",
      "data_type": "CE - Coded Element",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "RXC.3",
      "name": "Component Amount",
      "description": "amount of this component to be added to the specified amount of the base.",
      "length": "20",
      "data_type": "NM - Numeric",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "4": {
      "field_id": "RXC.4",
      "name": "Component Units",
      "description": "units for the component amount. If present, this overrides the units implied by RXC-2-component code. This must be in simple units that reflect the actual quantity of the component being added. It does not include compound units.",
      "length": "20",
      "data_type": "CE - Coded Element",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    }
  }
}