{
  "segment_id": "AIS",
  "short_description": "Appointment Information",
  "description": "The AIS segment contains information about various kinds of services that can be scheduled. Services included in a transaction using this segment are assumed to be controlled by a schedule on a schedule filler application. Services not controlled by a schedule are not identified on a schedule request using this segment.",
  "fields": {
    "1": {
      "field_id": "AIS.1",
      "name": "Set ID - AIS",
      "description": "This field contains a number that uniquely identifies the information represented by this segment in this transaction for the purposes of addition, change or deletion.",
      "length": "4",
      "data_type": "SI - Sequence ID",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "10": {
      "field_id": "AIS.10",
      "name": "Filler Status Code",
      "description": "This field contains a code that describes the requested/scheduled status of the resource or activity, from the point of view of the filler application. Refer to User-Defined Table 0278 - Filler Status Codes for suggested codes.\n\nThis is a conditionally required field. Because the information contained in this field is only appropriate in transactions originating from a filler application, it is required for those messages. This includes all unsolicited transactions originating from a filler application, as well as all response messages originating from a filler application. This field is optional for all transactions originating from placer, querying and auxiliary applications. It is recommended that this field be left unvalued in transactions originating from applications other than the filler application",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "11": {
      "field_id": "AIS.11",
      "name": "Placer Supplemental Service Information",
      "description": "This field contains supplemental service and/or logistical information sent from the placer system to the filler system for the universal procedure code reported in field AIS-3. This field will be used to provide scheduling information detail that is not available in other, specific fields in the AIS segment. Multiple supplemental service information elements may be reported. Refer to User-defined Table 0411 - Supplemental service information values for possible values.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "12": {
      "field_id": "AIS.12",
      "name": "Filler Supplemental Service Information",
      "description": "This field contains supplemental service and/or logistical information sent from the filler system to the placer system for the procedure code reported in field AIS-3. This field will be used to report scheduling information details that is not available in other, specific fields in the AIS segment. Typically it will reflect the same information as was sent to the filler system in AIS-11-Placer supplemental information unless the scheduling was modified in which case the filler system will report what was actually performed using this field. Multiple supplemental service information elements may be reported. Refer to User-defined Table 0411 - Supplemental service information values for possible values.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "2": {
      "field_id": "AIS.2",
      "name": "Segment Action Code",
      "description": "This field contains the action to be taken when updating or modifying information in this segment from previously sent interface transactions. Refer to HL7 Table 0206 - Segment action code for valid values.\n\nThis field is conditionally required. It is required for all updating or modifying trigger events.",
      "length": "3",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "AIS.3",
      "name": "Universal Service Identifier",
      "description": "This field contains an identifier code for a service to be scheduled. This field may contain a universal service identifier describing the observation/test/battery/procedure or other activity that is to be performed during the requested appointment, similar to the universal service identifier defined for the OBR segment. This code can be based on local and/or universal codes. The use of universal codes is recommended.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "4": {
      "field_id": "AIS.4",
      "name": "Start Date/Time",
      "description": "This field contains the date and time this service needs for the appointment. This field allows the application to identify that the service is required for the appointment at a different time than the appointment's start date/time\n\nThis field is conditionally required. If a value for AIS-5-Start date/time offset is not provided, then a value is required for this field. To specify that there is no difference between the appointment's start date/time and the resource's start date/time either replicate the appointment's start date/time into this field, or specify an offset of zero (0) in AIS-5-Start date/time offset and any valid time unit code in AIS-6-Start date/time offset units",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "AIS.5",
      "name": "Start Date/Time Offset",
      "description": "This field contains the offset this service needs for the appointment, expressed in units of time relative to the scheduled start date/time. This field allows the application to identify that the service is required for the appointment at a different time than the appointment's start date/time. The first component contains the offset amount. An offset of zero (0), or an unvalued field indicates that the service is required at the start date/time of the appointment.\n\nA positive offset (an unsigned or positive number) indicates that the service is required after the appointment's start date/time. Specifying a negative offset indicates that the service is required prior to the specified start date/time of the appointment. Negative offsets are allowed, and sites should clearly define the effect of a negative offset on the appointment's start date/time.\n\nThis field is conditionally required. If a value for AIS-5-Start date/time offset is not provided, then a value is required for this field. To specify that there is no difference between the appointment's start date/time and the resource's start date/time either replicate the appointment's start date/time into this field, or specify an offset of zero (0) in AIS-5-Start date/time offset and any valid time unit code in AIS-6-Start date/time offset units",
      "length": "20",
      "data_type": "NM - Numeric",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "6": {
      "field_id": "AIS.6",
      "name": "Start Date/Time Offset Units",
      "description": "This field contains a code describing the units of time used for expressing the start date/time offset. This field should be valued according to the recommendations in Chapters 2 and 7. If this field is not valued, the ISO base unit of seconds (code s) will be assumed.\n\nThis field is conditionally required. If a value for AIS-5-Start date/time offset is provided, then a value is required for this field.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "7": {
      "field_id": "AIS.7",
      "name": "Duration",
      "description": "This field contains the duration for which the resource is requested/scheduled for this appointment, if different from the overall duration of the requested/scheduled appointment. This field indicates to the application that a resource is required for a different amount of time than the appointment's overall duration. An unvalued duration indicates that the resource is required from its start date/time offset (specified in the previous two fields) until the end of the appointment. If no start date/time offset is specified, then the resource is required for the full duration of the appointment.\n\nThis field must be a positive, non-zero number. A negative number or zero (0) is nonsensical in the context of a duration.",
      "length": "20",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "8": {
      "field_id": "AIS.8",
      "name": "Duration Units",
      "description": "This field contains a code describing the units of time used for expressing the duration. If this field is not valued, the ISO base unit of seconds (code s) will be assumed",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "9": {
      "field_id": "AIS.9",
      "name": "Allow Substitution Code",
      "description": "This field contains a code indicating whether the identified resource can be substituted with an equivalent resource by the filler application. Refer to User-Defined Table 0279 - Allow Substitution Codes For suggested codes.\n\nThis field is conditionally required. It is required for all request messages. It is optional for all unsolicited transactions, and for all query messages",
      "length": "10",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    }
  }
}