{
  "segment_id": "ECD",
  "short_description": "Equipment Command",
  "description": "The equipment command segment contains the information required to notify the receiving component what is to happen.",
  "fields": {
    "1": {
      "field_id": "ECD.1",
      "name": "Reference Command Number",
      "description": "This field contains the unique identifier for this particular command that should be used by the various components for future referral to this command. It is similar to the concept of MSH-10 \"Message control ID\", but at the equipment command/response level. This number is generated by the originator of this command.",
      "length": "20",
      "data_type": "NM - Numeric",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "ECD.2",
      "name": "Remote Control Command",
      "description": "This field identifies the command that the component is to initiate. Refer to User-defined Table 0368 - Remote control command for valid values. Refer to LECIS standard for details.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "ECD.3",
      "name": "Response Required",
      "description": "This field identifies the mode of synchronization that is to be used in relation to the execution of the command. \"Y\" (Yes) means that the response is required immediately after execution, \"N\" (No) response is not required at all. Refer to HL7 Table 0136 - Yes/no indicator for valid values.",
      "length": "80",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "4": {
      "field_id": "ECD.4",
      "name": "Requested Completion Time",
      "description": "This field identifies when the remote control action must be completed. The devices managed in the LAS should have synchronized time (use original HL7 message NMQ, NMD with \"System Clock Segment\" NCK). If relative time quantity is used, then the referenced time is the time transferred in the EQU segment.\n\nAs of version 2.5 this field is defined for backward compatibility only. The TQ data type was deprecated, see section 2.A.81 (chapter 2). Instead use the \"Explicit time\" (TQ1-4) or \"Relative Time and Units\" (TQ15) fields of the TQ1 segment in a message using ECD segment.",
      "length": "200",
      "data_type": "TQ - Timing Quantity",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "ECD.5",
      "name": "Parameters",
      "description": "This field identifies the parameters of the command (if they are not included in separate segment[s]).",
      "length": "65536",
      "data_type": "TX - Text Data",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    }
  }
}