{
  "segment_id": "NSC",
  "short_description": "Application Status Change",
  "description": "The NSC segment is used to inform (NMR query response) or announce (NMD unsolicited update) the start-up, shut-down, and/or migration (to a different cpu or file-server/file-system) of a particular application.\n\nUsage Notes: Fields 2-9. These are not applicable (“n/a”) when the type of change being requested or reported is start-up or shut-down. If the change is of type \"M\", at least one of fields 2-5 must be different from its corresponding field in range 6-9.\n\nFields 4-5, 8-9. See definitions for the MSH, message header segment, for fields 3-4, for system and facility. \"Application\" is available for interfacing with lower level protocols. \"Facility\" is entirely site-defined.\n\nFields 2-3, 6-7. Entirely site-defined.",
  "fields": {
    "1": {
      "field_id": "NSC.1",
      "name": "Application Change Type",
      "description": "This field contains the type of change being requested (if NMR query) or announced (if NMD unsolicited update). Refer to User-Defined Table 0409 - Application Change Type for suggested values. It is assumed that \"new\" version starts up with no loss or duplication of data as old one is shutting down (if possible).",
      "length": "4",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "NSC.2",
      "name": "Current CPU",
      "description": "This field contains a site-specific name for the current CPU.",
      "length": "30",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "NSC.3",
      "name": "Current Fileserver",
      "description": "This field contains a site-specific name for the current fileserver or file system used by this application.",
      "length": "30",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "4": {
      "field_id": "NSC.4",
      "name": "Current Application",
      "description": "This field contains a site-specific name used to identify the \"current\" application process for interfacing with lower level protocols. To be used in conjunction with the sending/receiving system and facility values in the MSH. Entirely site-defined. User-defined Table 0361-Sending/receiving application is used as the user-defined table of values for the first component.",
      "length": "30",
      "data_type": "HD - Hierarchic Designator",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "NSC.5",
      "name": "Current Facility",
      "description": "This field contains a site-specific name for the current facility used by this application. To be used in conjunction with the values for the sending/receiving system and facility values in the MSH. This field further describes the current application, NSC-5-current application. With the promotion of this field to an HD data type, the usage has been broadened to include not just the current facility but other organizational entities such as a) the organizational entity responsible for current application; b) the responsible unit; c) a product or vendors identifier, etc. Entirely site-defined. User-defined Table 0362 - Sending/receiving facility is used as the HL7 identifier for the user-defined table of values for the first component.",
      "length": "30",
      "data_type": "HD - Hierarchic Designator",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "6": {
      "field_id": "NSC.6",
      "name": "New CPU",
      "description": "This field contains a site-specific name for the new CPU.",
      "length": "30",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "7": {
      "field_id": "NSC.7",
      "name": "New Fileserver",
      "description": "This field contains a site-specific name for the new fileserver or file system used by this application.",
      "length": "30",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "8": {
      "field_id": "NSC.8",
      "name": "New Application",
      "description": "This field contains a site-specific name used to identify \"new\" application processes for interfacing with lower level protocols. To be used in conjunction with the sending/receiving system and facility values in the MSH. Entirely site-defined. User-defined Table 0361-Sending/receiving application is used as the user-defined table of values for the first component.",
      "length": "30",
      "data_type": "HD - Hierarchic Designator",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "9": {
      "field_id": "NSC.9",
      "name": "New Facility",
      "description": "This field contains a site-specific name for the new facility used by this application. To be used in conjunction with the values for the sending/receiving system and facility values in the MSH.",
      "length": "30",
      "data_type": "HD - Hierarchic Designator",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    }
  }
}