{
  "segment_id": "ODS",
  "short_description": "Dietary Orders, Supplements, and Preferences",
  "description": "The ORC sequence items of interest to ODS are ORC-1-order control, ORC-2-placer order number, ORC-3-filler order number, ORC-7-quantity/timing, ORC-9-date/time of transaction, ORC-10-entered by, and ORC-11-verified by. For ORC-1-order control, the values may be New (NW), Cancel (CA), Discontinue Order Request (DC), Change (XO), Hold Order Request (HD), and Release Previous Hold (RL). The HD and RL codes could stop service for a specified length of time. ORC-7-quantity/timing should be used to specify whether an order is continuous or for one service period only. It is also useful for supplements which are part of a diet but only delivered, say, every day at night.",
  "fields": {
    "1": {
      "field_id": "ODS.1",
      "name": "Type",
      "description": "This field specifies type of diet. Refer To HL7 Table 0159 - Diet Code Specification Type for valid entries.",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "ODS.2",
      "name": "Service Period",
      "description": "When blank, the modifier applies to all service periods. Diet orders, for example, typically apply to all service periods. This field usually specifies supplements. This field allows you to designate a modification for one or more of the service periods during a day by combining service specifications as needed. The service periods will be local CEs, normally numbers. Suggested are:",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Repeatable 10 times"
    },
    "3": {
      "field_id": "ODS.3",
      "name": "Diet, Supplement, or Preference Code",
      "description": "This field is the identifier of the ordered item for a patient; it is equivalent to OBR-4-universal service ID in function. Since ODS is a repeating segment, multiple entities get multiple segments. Example:",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Required",
      "repeatability": "Repeatable 20 times"
    },
    "4": {
      "field_id": "ODS.4",
      "name": "Text Instruction",
      "description": "This field defines the specific instructions for dietary. These instructions may address specific patient needs, such as isolation. This field provides the ordering provider's dietary instructions as free text. It can represent the full dietary instruction or indicate supplemental information.",
      "length": "80",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Repeatable twice"
    }
  }
}