{
  "segment_id": "QPD",
  "short_description": "Query Parameter Definition",
  "description": "The QPD segment defines the parameters of the query.",
  "fields": {
    "1": {
      "field_id": "QPD.1",
      "name": "Message Query Name",
      "description": "This field contains the name of the query. These names are assigned by the function-specific chapters of this specification. It is one to one with the conformance statement for this query name, and it is in fact an identifier for that conformance statement. Site-specific query names begin with the letter Z. Refer to User defined table 0471 - Query name for suggested values.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "QPD.2",
      "name": "Query Tag",
      "description": "This field may be valued by the initiating system to identify the query, and may be used to match response messages to the originating query. If this field is valued, the responding system is required to echo it back as the first field in the query acknowledgement segment (QAK).\n\n[Implementation considerations: It is not necessary to value this field in implementations where the only return message on the socket will be the response to the query that was just sent. Conversely, in an “asynchronous” implementation where many queries, responses, and other messages may be communicated bidirectionally over the same socket, it is essential that this field be valued so that the Client knows to which query the Server is responding.]",
      "length": "32",
      "data_type": "ST - String Data",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "QPD.3",
      "name": "User Parameters (in successive fields)",
      "description": "These successive parameter fields hold the values that the Client passes to the Server.",
      "length": "256",
      "data_type": "VARIES - Variable Datatype",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    }
  }
}