{
  "segment_id": "TQ1",
  "short_description": "Timing/Quantity",
  "description": "The TQ1 segment is used to specify the complex timing of events and actions such as those that occur in order management and scheduling systems. This segment determines the quantity, frequency, priority, and timing of a service. By allowing the segment to repeat, it is possible to have service requests that vary the quantity, frequency and priority of a service request over time.",
  "fields": {
    "1": {
      "field_id": "TQ1.1",
      "name": "Set ID - TQ1",
      "description": "For the first timing specification transmitted, the sequence number shall be 1; for the second timing specification, it shall be 2; and so on.",
      "length": "4",
      "data_type": "SI - Sequence ID",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "10": {
      "field_id": "TQ1.10",
      "name": "Condition text",
      "description": "This is a free text field that describes the conditions under which the drug is to be given. For example, PRN pain , or to keep blood pressure below 110.",
      "length": "250",
      "data_type": "TX - Text Data",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "11": {
      "field_id": "TQ1.11",
      "name": "Text instruction",
      "description": "This field is a full text version of the instruction (optional).",
      "length": "250",
      "data_type": "TX - Text Data",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "12": {
      "field_id": "TQ1.12",
      "name": "Conjunction",
      "description": "This field indicates that a second TQ1 segment is to follow. Refer To HL7 Table 0472 - TQ Conjunction ID for allowed values.\n\nCondition Rule: If the TQ1 segment is repeated in the message, this field must be populated with the appropriate Conjunction code indicating the sequencing of the following TQ1 segment.",
      "length": "10",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "13": {
      "field_id": "TQ1.13",
      "name": "Occurrence duration",
      "description": "This field contains the duration for which a single performance of a service is requested. The quantity component of this field must be a positive, non-zero number when populated. The units component is constrained to be units of time.",
      "length": "20",
      "data_type": "CQ - Composite Quantity with Units",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "14": {
      "field_id": "TQ1.14",
      "name": "Total occurrences",
      "description": "This field contains the total number of occurrences of a service that should result from this service request. If both the end date/time (TQ1-8) and the total occurrences are valued and the occurrences would extend beyond the end date/time, then the end date/time takes precedence. Otherwise the number of occurrences takes precedence.",
      "length": "10",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "TQ1.2",
      "name": "Quantity",
      "description": "This field specifies the numeric quantity of the service that should be provided at each service interval. For example, if two blood cultures are to be obtained every 4 hours, the quantity would be 2 or if three units of blood are to be typed and cross-matched, the quantity would be 3. The default value for this field is 1.",
      "length": "20",
      "data_type": "CQ - Composite Quantity with Units",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "TQ1.3",
      "name": "Repeat Pattern",
      "description": "The repeating frequency with which the treatment is to be administered. It is similar to the frequency and SIG code tables used in order entry systems.",
      "length": "540",
      "data_type": "RPT - Repeat Pattern",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "4": {
      "field_id": "TQ1.4",
      "name": "Explicit Time",
      "description": "This field explicitly lists the actual times referenced by the code in TQ1-3. This field will be used to clarify the TQ1-3 in cases where the actual administration times vary within an institution. If the time of the service request spans more than a single day, this field is only practical if the same times of administration occur for each day of the service request. If the actual start time of the service request (as given by TQ1-7 ) is after the first explicit time, the first administration is taken to be the first explicit time after the start time. In the case where the patient moves to a location having a different set of explicit times, the existing service request may be updated with a new quantity/timing segment showing the changed explicit times.",
      "length": "20",
      "data_type": "TM - Time",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "5": {
      "field_id": "TQ1.5",
      "name": "Relative Time and Units",
      "description": "This field is used to define the interval between schedules for service request or bottle records. If this field contains a value, it overrides any value in the explicit time interval field. The units component of the CQ data type is constrained to units of time.",
      "length": "20",
      "data_type": "CQ - Composite Quantity with Units",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "6": {
      "field_id": "TQ1.6",
      "name": "Service Duration",
      "description": "This field contains the duration for which the service is requested.",
      "length": "20",
      "data_type": "CQ - Composite Quantity with Units",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "7": {
      "field_id": "TQ1.7",
      "name": "Start date/time",
      "description": "This field may be specified by the requester, in which case it indicates the earliest date/time at which the services should be started. In many cases, however, the start date/time will be implied or will be defined by other fields in the service request record (e.g., urgency - STAT). In such a case, this field will be empty.",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "8": {
      "field_id": "TQ1.8",
      "name": "End date/time",
      "description": "When filled in by the requester of the service, this field should contain the latest date/time that the service should be performed. If it has not been performed by the specified time, it should not be performed at all. The requester may not always fill in this value, yet the filling service may fill it in on the basis of the instruction it receives and the actual start time.",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "9": {
      "field_id": "TQ1.9",
      "name": "Priority",
      "description": "This field describes the urgency of the request. If this field is blank, the default is R. Refer to User-Defined Table 0485 - Extended Priority Codes for suggested values.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    }
  }
}