{
  "segment_id": "BHS",
  "short_description": "Batch Header",
  "description": "The BHS segment defines the start of a batch.",
  "fields": {
    "1": {
      "field_id": "BHS.1",
      "name": "Batch Field Separator",
      "description": "This field contains the separator between the segment ID and the first real field, BHS-2-batch encoding characters. As such it serves as the separator and defines the character to be used as a separator for the rest of the message. Recommended value is | (ASCII 124).",
      "length": "1",
      "data_type": "ST - String Data",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "10": {
      "field_id": "BHS.10",
      "name": "Batch Comment",
      "description": "This field is a comment field that is not further defined in the HL7 protocol.",
      "length": "80",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "11": {
      "field_id": "BHS.11",
      "name": "Batch Control ID",
      "description": "This field is used to uniquely identify a particular batch. It can be echoed back in BHS-12-reference batch control ID if an answering batch is needed.",
      "length": "20",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "12": {
      "field_id": "BHS.12",
      "name": "Reference Batch Control ID",
      "description": "This field contains the value of BHS-11-batch control ID when this batch was originally transmitted. Not present if this batch is being sent for the first time. See definition for BHS-11-batch control ID.",
      "length": "20",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "13": {
      "field_id": "BHS.13",
      "name": "Batch Sending Network Address",
      "description": "Identifier of the network location the message was transmitted from. Identified by an OID or text string (e.g., URI). The reader is referred to the \"Report from the Joint W3C/IETF URI Planning Interest Group: Uniform Resource Identifiers (URIs), URLs, and Uniform Resource Names (URNs): Clarifications and Recommendations\".\n\nAs with the Sending/Receiving Responsible Organization, the Sending Network Address provides a more detailed picture of the source of the message. This information is lower than the application layer, but is often useful/necessary for routing and identification purposes. This field should only be populated when the underlying communication protocol does not support identification of sending network locations.\n\nThe specific values and usage must be site negotiated.",
      "length": "227",
      "data_type": "HD - Hierarchic Designator",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "14": {
      "field_id": "BHS.14",
      "name": "Batch Receiving Network Address",
      "description": "Identifier of the network location the message was transmitted to. Identified by an OID or text string. (e.g., URL).\n\nThis is analogous with the Sending Network Address, however in the receiving role.\n\nThis field should only be populated when the underlying communication protocol does not support identification receiving network locations.",
      "length": "227",
      "data_type": "HD - Hierarchic Designator",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "BHS.2",
      "name": "Batch Encoding Characters",
      "description": "This field contains the four characters in the following order: the component separator, repetition separator, escape characters, and subcomponent separator. Recommended values are ^~\\& (ASCII 94, 126, 92, and 38, respectively).",
      "length": "4",
      "data_type": "ST - String Data",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "BHS.3",
      "name": "Batch Sending Application",
      "description": "This field uniquely identifies the sending application among all other applications within the network enterprise. The network enterprise consists of all those applications that participate in the exchange of HL7 messages within the enterprise. Entirely site-defined.",
      "length": "227",
      "data_type": "HD - Hierarchic Designator",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "4": {
      "field_id": "BHS.4",
      "name": "Batch Sending Facility",
      "description": "This field contains the address of one of several occurrences of the same application within the sending system. Absent other considerations, the Medicare Provider ID might be used with an appropriate sub-identifier in the second component. Entirely site-defined.",
      "length": "227",
      "data_type": "HD - Hierarchic Designator",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "BHS.5",
      "name": "Batch Receiving Application",
      "description": "This field uniquely identifies the receiving applications among all other applications within the network enterprise. The network enterprise consists of all those applications that participate in the exchange of HL7 messages within the enterprise. Entirely site-defined.",
      "length": "227",
      "data_type": "HD - Hierarchic Designator",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "6": {
      "field_id": "BHS.6",
      "name": "Batch Receiving Facility",
      "description": "This field identifies the receiving application among multiple identical instances of the application running on behalf of different organizations. See comments BHS-4-batch sending facility. Entirely site-defined.",
      "length": "227",
      "data_type": "HD - Hierarchic Designator",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "7": {
      "field_id": "BHS.7",
      "name": "Batch Creation Date/Time",
      "description": "This field contains the date/time that the sending system created the message. If the time zone is specified, it will be used throughout the message as the default time zone.",
      "length": "24",
      "data_type": "DTM - Date/Time",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "8": {
      "field_id": "BHS.8",
      "name": "Batch Security",
      "description": "In some applications of HL7, this field is used to implement security features. Its use is not yet further specified.",
      "length": "40",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "9": {
      "field_id": "BHS.9",
      "name": "Batch Name/ID/Type",
      "description": "This field can be used by the application processing the batch. It can have extra components if needed.\n\nNote: the text regarding \"extra components\" has been retained for backward compatibility, but it is not currently an accepted format for the ST data type.",
      "length": "20",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    }
  }
}