{
  "segment_id": "BPX",
  "short_description": "Blood product dispense status",
  "description": "In the processing of blood products, it is necessary for the transfusion service and the placer system to communicate information. The status messages need to contain additional information regarding the blood products requested, such as the unique donation ID, product code, blood type, expiration date/time of the blood product, and current status of the product. This segment is similar to an OBX segment, but contains additional attributes.",
  "fields": {
    "1": {
      "field_id": "BPX.1",
      "name": "Set ID – BPX",
      "description": "This field contains the sequence number for the BPX segment under the related BPO segment. For the first blood product dispense status transmitted, the sequence number shall be 1; for the second product dispense status, it shall be 2; and so on.",
      "length": "4",
      "data_type": "SI - Sequence ID",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "10": {
      "field_id": "BPX.10",
      "name": "CP Lot Number",
      "description": "This field identifies the lot number for blood derivatives or commercially supplied items used as accessories to transfusion.\n\nThis field is required for commercial blood products and is not applicable for blood component messages.",
      "length": "22",
      "data_type": "EI - Entity Identifier",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "11": {
      "field_id": "BPX.11",
      "name": "BP Blood Group",
      "description": "This field indicates the ABO/Rh blood group of the blood component. The preferred values for the blood group are the specified values in Table 3A - Encodation of ABO/Rh Blood Group in the ISBT 128 Application Specification.\n\nThis field is required for blood components and certain commercial products (such as solvent detergent plasma).",
      "length": "250",
      "data_type": "CNE - Coded with No Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "12": {
      "field_id": "BPX.12",
      "name": "BC Special Testing",
      "description": "This is a repeating field to allow multiple entries for special testing that was performed on the blood component. The preferred coding system for Special Testing is defined in the ISBT 128 Application Specification . Proposals have been developed and will soon be published by ICCBBA, Inc. for the encodation of other antigen and antibody specificities, including HLA, platelet, red cell and other types of markers.\n\nThis field is optional for blood component messages. It is not applicable for non-commercial product messages.",
      "length": "250",
      "data_type": "CNE - Coded with No Exceptions",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "13": {
      "field_id": "BPX.13",
      "name": "BP Expiration Date/Time",
      "description": "This field specifies the date and time that the blood product expires. The blood product is no longer considered acceptable once the expiration date has been reached unless cleared by the transfusion service medical staff.\n\nThis field applies to blood components as well as commercial products. There are a few commercial products that have no expiration date. Therefore, the field is not required for those specific products.",
      "length": "24",
      "data_type": "DTM - Date/Time",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "14": {
      "field_id": "BPX.14",
      "name": "BP Quantity",
      "description": "This field indicates the number of blood components or commercial products to which this message refers.",
      "length": "5",
      "data_type": "NM - Numeric",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "15": {
      "field_id": "BPX.15",
      "name": "BP Amount",
      "description": "This field contains the ordered amount (volume) associated with each quantity of a blood component or commercial product to which this message refers.",
      "length": "5",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "16": {
      "field_id": "BPX.16",
      "name": "BP Units",
      "description": "This field contains the units of measure for the blood product amount. (See Chapter 7 for more details about reporting units.) This field specifies the units of measure for volume of a blood component (i.e., 50 ml) or the units of measure or dosage of a commercial product (i.e., 910 I.U. - International Units - of Factor VIII Concentrate).",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "17": {
      "field_id": "BPX.17",
      "name": "BP Unique ID",
      "description": "This field is a unique system-generated number assigned to the blood product to which the message is referring. Each time the status is updated, the new message should replace the previous message if the Blood Product Unique ID is the same. If the Blood Product Unique ID is different, it indicates that the status applies to a different blood product.\n\nThe sending and receiving systems must agree upon the use of this field.",
      "length": "22",
      "data_type": "EI - Entity Identifier",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "18": {
      "field_id": "BPX.18",
      "name": "BP Actual Dispensed To Location",
      "description": "This field contains the inpatient or outpatient location to which the blood product was actually dispensed. The default value is the current census location for the patient.",
      "length": "80",
      "data_type": "PL - Person Location",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "19": {
      "field_id": "BPX.19",
      "name": "BP Actual Dispensed To Address",
      "description": "This field contains the actual address of the location to which the blood product was actually dispensed.",
      "length": "250",
      "data_type": "XAD - Extended Address",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "BPX.2",
      "name": "BP Dispense Status",
      "description": "This field indicates the current status of the specified blood product as indicated by the filler or placer. For example, the first status change of a product that may trigger a Blood Product Dispense Status Message occurs when it first becomes linked to a patient and is ready to dispense. The placer system may use the Blood Product Dispense Status Message to request the transfusion service to dispense the product. When the blood product is delivered or issued to a patient, the status of the blood product would be changed to indicate that it has now been \"dispensed.\" Refer to HL7 Table 0510 - Blood Product Dispense Status for valid entries.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "20": {
      "field_id": "BPX.20",
      "name": "BP Dispensed to Receiver",
      "description": "This is the person who picked up and transported the blood component(s) or commercial product(s). The code for the receiver is recorded as a XCN data type. This field can be free text. In this case, the receiver's name must be recorded as the second through fourth components of the field.",
      "length": "250",
      "data_type": "XCN - Extended Composite ID Number and Name for Persons",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "21": {
      "field_id": "BPX.21",
      "name": "BP Dispensing Individual",
      "description": "This field identifies the individual who is dispensing the blood component or commercial product.",
      "length": "250",
      "data_type": "XCN - Extended Composite ID Number and Name for Persons",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "BPX.3",
      "name": "BP Status",
      "description": "The most commonly used message status values in a BPX will be preliminary and final. A status is considered preliminary until a blood product has reached a final disposition for the patient. For example, when the product is first cross-matched and a status message is sent, it would be considered preliminary. When the product is dispensed to the patient, that status would also be considered preliminary. However, once the product is transfused, the status would be considered final. The status of a blood product (BPX-2) can continue to change and the previous status should be overwritten until it reaches a final status (BPX-3). Refer to HL7 Table 0511 - BP Observation Status Codes Interpretation for valid entries.",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "4": {
      "field_id": "BPX.4",
      "name": "BP Date/Time of Status",
      "description": "This field indicates the date and time that the status of the blood component was changed. For example, if the blood component had a status, of \"RD\" (Ready to Dispense), the date and time in this field would indicate the date and time that component was made ready to dispense by the filler system.",
      "length": "24",
      "data_type": "DTM - Date/Time",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "BPX.5",
      "name": "BC Donation ID",
      "description": "The Donation ID is the unique identification number assigned to a blood donation. The Donation ID depends upon the bar code labeling system used for the component. There are currently two blood component labeling standards: ABC CODABAR and ISBT 128. The preferred labeling system is ISBT 128. If using ISBT 128, the Donation ID is an internationally unique identifier consisting of the following 13 characters:",
      "length": "22",
      "data_type": "EI - Entity Identifier",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "6": {
      "field_id": "BPX.6",
      "name": "BC Component",
      "description": "The Component field includes an identifier and description of the specific blood component.\n\nThis field is required for blood components and is not applicable for commercial product messages.",
      "length": "250",
      "data_type": "CNE - Coded with No Exceptions",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "7": {
      "field_id": "BPX.7",
      "name": "BC Donation Type / Intended Use",
      "description": "This field indicates the type of donation or collection/intended use. This value is populated from Table 5 -Type of Donation in the ISBT 128 Application Specification . The default value is \"0\", meaning \"Not specified.\" Other values indicate whether the blood product (1) is an allogeneic unit from a volunteer donor, (2) is intended for a specific recipient but may be crossed over and used for another recipient, or (3) is an autologous donation intended only for that particular recipient.\n\nThis field is optional for blood component messages and is not applicable for commercial product messages.",
      "length": "250",
      "data_type": "CNE - Coded with No Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "8": {
      "field_id": "BPX.8",
      "name": "CP Commercial Product",
      "description": "This field contains the code and/or text to identify a commercial product. Examples of commercial products are blood derivatives such as Rh Immune Globulin and Factor VIII concentrate, Leukoreduction filters, and blood administration sets.\n\nThis field is required for commercial blood products and is not applicable for blood component messages.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "9": {
      "field_id": "BPX.9",
      "name": "CP Manufacturer",
      "description": "This field identifies the manufacturer of the commercial product. The manufacturer may be different from the supplier of the commercial product.\n\nThis field is required for commercial blood products and is not applicable for blood component messages.",
      "length": "250",
      "data_type": "XON - Extended Composite Name and Identification Number for Organizations",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    }
  }
}