{
  "segment_id": "BTX",
  "short_description": "Blood Product Transfusion/Disposition",
  "description": "No description found.",
  "fields": {
    "1": {
      "field_id": "BTX.1",
      "name": "Set ID – BTX",
      "description": "This field contains the sequence number for the BTX segment under the related BPO segment. For the first product transfusion/disposition transmitted, the sequence number shall be 1; for the second product transfusion/disposition, it shall be 2; and so on.",
      "length": "4",
      "data_type": "SI - Sequence ID",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "10": {
      "field_id": "BTX.10",
      "name": "BP Units",
      "description": "This field contains the units of measure for the blood component or commercial product amount. (See Chapter 7 for more details about reporting units.) This specifies the units of measure for volume of a blood component (i.e., 50 ml) or the units of measure or dosage of a commercial product (i.e., 910 I.U. - International Units - of Factor VIII Concentrate).",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "11": {
      "field_id": "BTX.11",
      "name": "BP Transfusion/Disposition Status",
      "description": "This field indicates the current status of the specified blood product as indicated by the placer. For example, the placer may return the blood product to the transfusion service unused because an IV could not be started. The blood component may have been entered, but the line was clogged and could not be used, in which case the component must be wasted. A final status would indicate that the product has actually been \"transfused.\" Refer to HL7 Table 0513 - Blood Product Transfusion/Disposition Status for suggested values.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "12": {
      "field_id": "BTX.12",
      "name": "BP Message Status",
      "description": "The most commonly used message status values in a BTX will be preliminary and final. A status is considered preliminary until a blood product has reached a final disposition for the patient. For example, when the product is first cross-matched and a status message is sent, it would be considered preliminary. When the product is dispensed to the patient, that status would also be considered preliminary. However, once the product is transfused, the status would be considered final. The status of a blood product (BTX-11) can continue to change and the previous result should be overwritten until it reaches a final status (BTX-12). Refer to HL7 Table 0511 - BP Observation Status Codes Interpretation for valid entries.",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "13": {
      "field_id": "BTX.13",
      "name": "BP Date/Time of Status",
      "description": "This field indicates the date and time that the status of the blood component was changed. For example, if the blood component had a status of \"TX\" (Transfused), the date and time in this field would indicate the date and time the component was transfused by the placer system.",
      "length": "24",
      "data_type": "DTM - Date/Time",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "14": {
      "field_id": "BTX.14",
      "name": "BP Administrator",
      "description": "This field contains the identity of the individual who administers the transfusion of the blood product. If the code is sent as a local code, it should be unique and unambiguous. This field can be free text to permit capture without table update. In this case, the administrator's name must be recorded as the second through fourth components of the field.",
      "length": "250",
      "data_type": "XCN - Extended Composite ID Number and Name for Persons",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "15": {
      "field_id": "BTX.15",
      "name": "BP Verifier",
      "description": "This field contains the identity of the individual who assists in the identification of the patient and verification of the product information prior to transfusion of the blood product. If the ID Number is sent as a local code, it should be unique and unambiguous. This field can be free text to permit capture without table update. In this case, the verifier's name must be recorded as the second through fourth components of the field.",
      "length": "250",
      "data_type": "XCN - Extended Composite ID Number and Name for Persons",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "16": {
      "field_id": "BTX.16",
      "name": "BP Transfusion Start Date/Time of Status",
      "description": "This field indicates the date and time that the administrator started the transfusion of the blood component or commercial product.",
      "length": "24",
      "data_type": "DTM - Date/Time",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "17": {
      "field_id": "BTX.17",
      "name": "BP Transfusion End Date/Time of Status",
      "description": "This field indicates the date and time that the transfusion of the blood component or commercial product was completed or stopped.",
      "length": "24",
      "data_type": "DTM - Date/Time",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "18": {
      "field_id": "BTX.18",
      "name": "BP Adverse Reaction Type",
      "description": "This field contains the type of adverse reaction that the recipient of the blood product experienced. Refer to User-Defined Table 0514 - Transfusion Adverse Reaction for suggested values.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "19": {
      "field_id": "BTX.19",
      "name": "BP Transfusion Interrupted Reason",
      "description": "This field contains the reason that the transfusion of the blood product was interrupted. Refer to User-Defined Table 0515 - Transfusion Interrupted Reason for suggested values.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "BTX.2",
      "name": "BC Donation ID",
      "description": "The donation ID is the unique identification number assigned to a blood donation. The Donation ID depends upon the bar code labeling system used for the component. There are currently two blood component labeling standards: ABC CODABAR and ISBT 128. The preferred labeling system is ISBT 128. If using ISBT 128, the Donation ID is an internationally unique identifier consisting of the following 13 characters:\n\nCountry Code & Collection Facility - 5 characters\nDonation Year - 2 characters\nSerial Number - 6 characters\n\nThis is required for blood components and is not applicable for commercial product messages.",
      "length": "22",
      "data_type": "EI - Entity Identifier",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "BTX.3",
      "name": "BC Component",
      "description": "The Blood Component field includes an identifier and description of the specific blood component.\n\nThis field is required for blood components and is not applicable for commercial product messages.",
      "length": "250",
      "data_type": "CNE - Coded with No Exceptions",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "4": {
      "field_id": "BTX.4",
      "name": "BC Blood Group",
      "description": "This field indicates the ABO/Rh blood group of the blood component. The preferred values for the blood group are the specified values in Table 3A - Encodation of ABO/Rh Blood Group in the ISBT 128 Application Specification.\n\nThis field is required for blood components and certain commercial products (such as solvent detergent plasma).",
      "length": "250",
      "data_type": "CNE - Coded with No Exceptions",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "BTX.5",
      "name": "CP Commercial Product",
      "description": "This field contains the code and/or text to identify a commercial product. Examples of commercial products are blood derivatives such as Rh Immune Globulin and Factor VIII concentrate, Leukoreduction filters, and blood administration sets.\n\nThis field is required for commercial blood products and is not applicable to blood component messages.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "6": {
      "field_id": "BTX.6",
      "name": "CP Manufacturer",
      "description": "This field identifies the manufacturer of the commercial product. The manufacturer may not be the same as the supplier of the commercial product.\n\nThis field is required for commercial blood products and is not applicable for blood component messages.",
      "length": "250",
      "data_type": "XON - Extended Composite Name and Identification Number for Organizations",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "7": {
      "field_id": "BTX.7",
      "name": "CP Lot Number",
      "description": "This field identifies the lot number for blood derivatives or commercially supplied items used as accessories to transfusion.\n\nThis field is required for commercial blood products and is not applicable for blood component messages.",
      "length": "22",
      "data_type": "EI - Entity Identifier",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "8": {
      "field_id": "BTX.8",
      "name": "BP Quantity",
      "description": "This field indicates the number of blood components or commercial products to which the message refers.",
      "length": "5",
      "data_type": "NM - Numeric",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "9": {
      "field_id": "BTX.9",
      "name": "BP Amount",
      "description": "This field contains the amount (volume) associated with each blood component or commercial product. When included in this segment, it may be used to indicate the volume of the blood component or product that was actually transfused.",
      "length": "5",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    }
  }
}