{
  "segment_id": "DMI",
  "short_description": "DRG Master File Information",
  "description": "The Technical Steward for the DMI segment is Financial Management.\n\nThe DMI segment contains the DRG related basic information, for example, relative weight, etc. The DMI segment is used to send the fixed information assigned to a specific DRG.",
  "fields": {
    "1": {
      "field_id": "DMI.1",
      "name": "Diagnostic Related Group",
      "description": "This field contains the DRG for the transaction. Interim DRG's could be determined for an encounter. Refer to Externally-defined Table 0055 - Diagnosis Related Group in Chapter 6 for suggested values.\n\nAs of v2.6, the known applicable external coding systems include those in Z001 - Diagnostic Related Group Coding Systems. If the code set you are using is in this table, then you must use that designation.",
      "length": "250",
      "data_type": "CNE - Coded with No Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "DMI.2",
      "name": "Major Diagnostic Category",
      "description": "This field indicates the determined Major Diagnostic Category (MDC) value. Refer to Externally-defined Table 0118 - Major Diagnostic Category for suggested values.\n\nAs of v2.6, the known applicable external coding systems include those in Z002 - Major Diagnostic Category Coding Systems. If the code set you are using is in this table, then you must use that designation.",
      "length": "1",
      "data_type": "CNE - Coded with No Exceptions",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "DMI.3",
      "name": "Lower and Upper Trim Points",
      "description": "This field contains the lower and upper trim points as calculated for this DRG..",
      "length": "7",
      "data_type": "NR - Numeric Range",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "4": {
      "field_id": "DMI.4",
      "name": "Average Length of Stay",
      "description": "This field contains the average length of stay in days, calculated as the geometric mean value, allocated to the determined DRG.",
      "length": "5",
      "data_type": "NM - Numeric",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "DMI.5",
      "name": "Relative Weight",
      "description": "Each DRG has its own relative weight (cost weight) which is calculated (defined) by official institutions. This value is the basis for calculating other values, e.g., the effective weight.",
      "length": "7",
      "data_type": "NM - Numeric",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    }
  }
}