{
  "segment_id": "GP1",
  "short_description": "Visit",
  "description": "These fields are used in grouping and reimbursement for CMS APCs. Please refer to the \"Outpatient Prospective Payment System Final Rule\" (\"OPPS Final Rule\") issued by CMS.\n\nThe GP1 segment is specific to the US and may not be implemented in non-US systems.",
  "fields": {
    "1": {
      "field_id": "GP1.1",
      "name": "Type of Bill Code",
      "description": "This field is the same as UB92 Form Locator 4 \"Type of Bill\". Refer to User-defined Table 0455 - Type of Bill Code for suggested values. Refer to a UB specification for additional information. This field is defined by CMS or other regulatory agencies. It is a code indicating the specific type of bill with digit 1 showing type of facility, digit 2 showing bill classification, and digit 3 showing frequency.",
      "length": "3",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "GP1.2",
      "name": "Revenue Code",
      "description": "This field is the same as UB92 Form Locator 42 \"Revenue Code\". Refer to User-defined Table 0456 - Revenue Code for suggested values. This field identifies revenue codes that are not linked to a HCPCS/CPT code. It is used for claiming for non-medical services such as telephone, TV or cafeteria charges, etc. There can be many per visit or claim. This field is defined by CMS or other regulatory agencies.",
      "length": "3",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "3": {
      "field_id": "GP1.3",
      "name": "Overall Claim Disposition Code",
      "description": "This field identifies the final status of the claim. The codes listed as examples are not an exhaustive or current list, refer to OPPS Final Rule. Refer to User-defined Table 0457 - Overall Claim Disposition Code for suggested values. This field is defined by CMS or other regulatory agencies.",
      "length": "1",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "4": {
      "field_id": "GP1.4",
      "name": "OCE Edits per Visit Code",
      "description": "This field contains the edits that result from processing the HCPCS/CPT procedures for a record after evaluating all the codes, revenue codes, and modifiers. The codes listed as examples are not an exhaustive or current list, refer to OPPS Final Rule. OCE (Outpatient Code Editor) edits also exist at the pre-procedure level. Refer to User-defined Table 0458 - OCE Edit Code for suggested values. This field is defined by CMS or other regulatory agencies.",
      "length": "2",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "5": {
      "field_id": "GP1.5",
      "name": "Outlier Cost",
      "description": "This field contains the amount that exceeds the outlier limitation as defined by APC regulations. This field is analogous to DRG-7 - Outlier Cost ; however, the definition in this field note supersedes the DRG-7 definition.",
      "length": "12",
      "data_type": "CP - Composite Price",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    }
  }
}