{
  "segment_id": "MFA",
  "short_description": "Master File Acknowledgment",
  "description": "The Technical Steward for the MFA segment is Infrastructure and Messaging.",
  "fields": {
    "1": {
      "field_id": "MFA.1",
      "name": "Record-Level Event Code",
      "description": "This field defines record-level event for the master file record identified by the MFI segment and the primary key in this segment. Refer to HL7 table 0180 - Record level event code for valid values.\n\nNote: If the MFI-3 - File-level event code is \"REP\" (replace file), then each MFA segment must have an MFA-1 - Record-level event code of \"MAD\" (add record to master file).",
      "length": "3",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "MFA.2",
      "name": "MFN Control ID",
      "description": "This field contains a number or other identifier that uniquely identifies this change to this record from the point of view of the originating system. This field uniquely identifies the particular record (identified by the MFE segment) being acknowledged by this MFA segment. When returned to the originating system via the MFA segment, this field allows the target system to precisely identify which change to this record is being acknowledged. It is only required if MFI-6 - Response Level Code requires responses at the record level (any value other than NE).",
      "length": "20",
      "data_type": "ST - String Data",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "MFA.3",
      "name": "Event Completion Date/Time",
      "description": "This field may be required or optional depending on the site specifications for the given master file, master file event, and receiving facility.",
      "length": "24",
      "data_type": "DTM - Date/Time",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "4": {
      "field_id": "MFA.4",
      "name": "MFN Record Level Error Return",
      "description": "This field contains the status of the requested update. Site-defined table, specific to each master file being updated via this transaction.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "MFA.5",
      "name": "Primary Key Value - MFA",
      "description": "This field uniquely identifies the record of the master file (identified in the MFI segment) for which the update status is being acknowledged (as defined by the field MFN-4 - Record Level Error Return ). The data type of this field is defined by the value of MFA-6 - Value Type - MFA, and may take on the format of any of the HL7 data types defined in HL7 table 0355 - Primary Key Value Type . The PL data type is used only on location master transactions.",
      "length": "250",
      "data_type": "VARIES - Variable Datatype",
      "optionality": "Required",
      "repeatability": "Repeatable indefinitely"
    },
    "6": {
      "field_id": "MFA.6",
      "name": "Primary Key Value Type - MFA",
      "description": "This field contains the HL7 data type of MFA-5 - Primary Key Value - MFA. The valid HL7 data types are listed in HL7 table 0355 - Primary key value type .",
      "length": "3",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Required",
      "repeatability": "Repeatable indefinitely"
    }
  }
}