{
  "segment_id": "MFE",
  "short_description": "Master File Entry",
  "description": "The Technical Steward for the MFE segment is Infrastructure and Messaging.",
  "fields": {
    "1": {
      "field_id": "MFE.1",
      "name": "Record-Level Event Code",
      "description": "This field defines the record-level event for the master file record identified by the MFI segment and the primary key field in this segment. Refer to HL7 table 0180 - Record level event code for valid values.",
      "length": "3",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "MFE.2",
      "name": "MFN Control ID",
      "description": "A number or other identifier that uniquely identifies this change to this record from the point of view of the originating system. When returned to the originating system via the MFA segment, this field allows the target system to precisely identify which change to this record is being acknowledged. It is only required if the MFI response level code requires responses at the record level (any value other than NE).",
      "length": "20",
      "data_type": "ST - String Data",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "MFE.3",
      "name": "Effective Date/Time",
      "description": "An optional effective date/time can be included for the record-level action specified. It is the date/time the originating system expects that the event is to have been completed on the receiving system. If this field is not present, the effective date/time should default to the current date/time (when the message is received).",
      "length": "26",
      "data_type": "DTM - Date/Time",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "4": {
      "field_id": "MFE.4",
      "name": "Primary Key Value - MFE",
      "description": "This field uniquely identifies the record of the master file (identified in the MFI segment) to be changed (as defined by the record-level event code). The data type of field is defined by the value of MFE-5 - Value Type, and may take on the format of any of the HL7 data types defined in HL7 table 0355 - Primary Key Value Type . The PL data type is used only on Location master transactions.",
      "length": "200",
      "data_type": "VARIES - Variable Datatype",
      "optionality": "Required",
      "repeatability": "Repeatable indefinitely"
    },
    "5": {
      "field_id": "MFE.5",
      "name": "Primary Key Value Type",
      "description": "This field contains the HL7 data type of MFE-4 - Primary Key Value - MFE. The valid values for the data type of a primary key are listed in HL7 table 0355 - Primary key value type .",
      "length": "3",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Required",
      "repeatability": "Repeatable indefinitely"
    },
    "6": {
      "field_id": "MFE.6",
      "name": "Entered Date/Time",
      "description": "This field contains the date and time of the last change of the record.",
      "length": "24",
      "data_type": "DTM - Date/Time",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "7": {
      "field_id": "MFE.7",
      "name": "Entered By",
      "description": "This field contains the identity of the person who actually keyed the master file entry into the application. It provides an audit trail in case the request is entered incorrectly and the ancillary department needs to clarify the request.",
      "length": "3220",
      "data_type": "XCN - Extended Composite ID Number and Name for Persons",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    }
  }
}