{
  "segment_id": "PRD",
  "short_description": "Provider Data",
  "description": "This segment will be employed as part of a patient referral message and its related transactions. The PRD segment contains data specifically focused on a referral, and it is inter-enterprise in nature. The justification for this new segment comes from the fact that we are dealing with referrals that are external to the facilities that received them. Therefore, using a segment such as the current PV1 would be inadequate for all the return information that may be required by the receiving facility or application. In addition, the PV1 does not always provide information sufficient to enable the external facility to make a complete identification of the referring entity. The information contained in the PRD segment will include the referring provider, the referred-to provider, the referred-to location or service, and the referring provider clinic address.",
  "fields": {
    "1": {
      "field_id": "PRD.1",
      "name": "Provider Role",
      "description": "This field contains the contact role that defines the relationship of the person or organization described in this segment to the patient being referred. When a referral is inter-enterprise in nature, there are several important relationships that must be identified. For example, the proper identification of both the referring and the referred-to provider is critical for proper processing of a referral. In addition, some enterprises may want information regarding a consulting provider or the identity of the person who actually prepared the referral. This contact role may also expand to represent affiliated persons to whom information regarding this referral must be forwarded or copied. Refer to User-defined Table 0286 - Provider role for suggested values.",
      "length": "705",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Required",
      "repeatability": "Repeatable indefinitely"
    },
    "10": {
      "field_id": "PRD.10",
      "name": "Provider Organization Name and Identifier",
      "description": "This field contains the name of the provider where the provider is an organization.",
      "length": "250",
      "data_type": "XON - Extended Composite Name and Identification Number for Organizations",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "11": {
      "field_id": "PRD.11",
      "name": "Provider Organization Address",
      "description": "This field contains the address of the provider if it is an organization.",
      "length": "60",
      "data_type": "XAD - Extended Address",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "12": {
      "field_id": "PRD.12",
      "name": "Provider Organization Location Information",
      "description": "This field contains the location details of the provider if it is an organization.",
      "length": "60",
      "data_type": "PL - Person Location",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "13": {
      "field_id": "PRD.13",
      "name": "Provider Organization Communication Information",
      "description": "This field contains information, such as the phone number or electronic mail address, used to communicate with the provider if it is an organization.",
      "length": "250",
      "data_type": "XTN - Extended Telecommunication Number",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "14": {
      "field_id": "PRD.14",
      "name": "Provider Organization Method of Contact",
      "description": "This field contains the preferred method to use when communicating with the provider if provider is an organization. Refer to User-defined Table 0185 - Preferred method of contact for suggested values.",
      "length": "705",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "PRD.2",
      "name": "Provider Name",
      "description": "This field contains the name of the provider identified in this segment. Generally, this field will describe a physician associated with the referral. However, it is not limited to physicians. If the provider is an organization then PRD-10 - Provider Organization Name and Identifier will be used. This field may contain the name of any valid healthcare provider associated with this referral. If this Provider Name is a physician's name, you may refer to PRD-7-Provider identifiers for the physician identifier.",
      "length": "250",
      "data_type": "XPN - Extended Person Name",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "3": {
      "field_id": "PRD.3",
      "name": "Provider Address",
      "description": "This field contains the mailing address of the provider identified in this segment. One of the key components to completing the \"circle of care\" and provider/institution bonding is the issuance of follow-up correspondence to the referring provider.",
      "length": "250",
      "data_type": "XAD - Extended Address",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "4": {
      "field_id": "PRD.4",
      "name": "Provider Location",
      "description": "This field contains the location of the provider as needed when a provider that may be external to a given enterprise must be referenced. For example, if this provider represented the referred-to physician, the PRD-4-Provider location should identify the clinic of the physician or provider to whom this referral has been sent. An application and facility identifier carried in the facility field specifies the identification of the providers location. The application ID and facility ID would be used in the same manner as their corresponding fields in the MSH segment ( MSH-3-Sending application, MSH-5-Receiving application, MSH-4-Sending facility, MSH-6-Receiving facility). That is, the facility field will contain an application identifier and facility identifier which describe the location of this provider. However, it should be noted that they may describe a different location because the provider location being referenced in this field may not be the location from which the message originated, which is being described by the MSH.",
      "length": "60",
      "data_type": "PL - Person Location",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "PRD.5",
      "name": "Provider Communication Information",
      "description": "This field contains information, such as the phone number or electronic mail address, used to communicate with the provider or organization.",
      "length": "250",
      "data_type": "XTN - Extended Telecommunication Number",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "6": {
      "field_id": "PRD.6",
      "name": "Preferred Method of Contact",
      "description": "This field contains the preferred method to use when communicating with the provider. Refer to User-defined Table 0185 - Preferred method of contact for suggested values.",
      "length": "705",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "7": {
      "field_id": "PRD.7",
      "name": "Provider Identifiers",
      "description": "This repeating field contains the provider's unique identifiers such as UPIN, Medicare and Medicaid numbers. Refer to User-defined Table 0338 - Practitioner ID number type (in Chapter 2A, section 2.A.54.2)for suggested values.",
      "length": "100",
      "data_type": "PLN - Practitioner License or Other ID Number",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "8": {
      "field_id": "PRD.8",
      "name": "Effective Start Date of Provider Role",
      "description": "This field contains the date that the role of the provider effectively began. For example, this date may represent the date on which a physician was assigned as a patient's primary care provider.\n\nNote: The PRD-8-Effective Start Date of Role and PRD-9-Effective End Date of Role fields should not be used as trigger events. For example, they should not be used to trigger a change in role. These two dates are for informational purposes only.",
      "length": "24",
      "data_type": "DTM - Date/Time",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "9": {
      "field_id": "PRD.9",
      "name": "Effective End Date of Provider Role",
      "description": "This field contains the date that the role of the provider effectively ended. For example, this date may represent the date that a physician was removed as a patient's primary care provider.\n\nNote: The PRD-8-Effective Start Date of Role and PRD-9-Effective End Date of Role fields should not be used as trigger events. For example, they should not be used to trigger a change in role. These two dates are for informational purposes only.",
      "length": "24",
      "data_type": "DTM - Date/Time",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    }
  }
}