{
  "segment_id": "QRI",
  "short_description": "Query Response Instance",
  "description": "The QRI segment is used to indicate the weight match for a returned record (where the responding system employs a numeric algorithm) and/or the match reason code (where the responding system uses rules or other match options).",
  "fields": {
    "1": {
      "field_id": "QRI.1",
      "name": "Candidate Confidence",
      "description": "This field contains a numeric value indicating the match weight or confidence level associated with the record.",
      "length": "10",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "QRI.2",
      "name": "Match Reason Code",
      "description": "This field contains a coded value indicating what search components (e.g., name, birth date, social security number) of the record returned matched the original query where the responding system does not assign numeric match weights or confidence levels. In short, it provides a method for passing a descriptive indication of why a particular record was found.",
      "length": "2",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "3": {
      "field_id": "QRI.3",
      "name": "Algorithm Descriptor",
      "description": "This field contains a text value indicating the name or identity of the specific search algorithm to which the RCP-5 Search confidence threshold and the QRI-1 Candidate confidence refer. Note that there are sometimes significant differences among the algorithms in their numeric scales (e.g., one is 0-100, another might be 10 - 20) as well as their meanings of the same value (two algorithms with an 80% match might not return the same records). Refer to User-defined Table 0393 - Match algorithms for suggested values.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    }
  }
}