{
  "segment_id": "RXE",
  "short_description": "Pharmacy/Treatment Encoded Order",
  "description": "The RXE segment details the pharmacy or treatment application's encoding of the order. It also contains several pharmacy-specific order status fields, such as RXE-16-number of refills remaining , RXE-17-number of refills/doses dispensed, RXE-18-D/T of most recent refill or dose dispensed , and RXE-19-total daily dose.",
  "fields": {
    "1": {
      "field_id": "RXE.1",
      "name": "Quantity/Timing",
      "description": "This field is retained for backward compatibility only. The reader is referred to the TQ1 and TQ2 segments described in sections 4.5.4, \"TQ1 – Timing/Quantity Segment\" and 4.5.5, \"TQ2 – Timing/Quantity Relationship\" respectively.",
      "length": "705",
      "data_type": "TQ - Timing Quantity",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    },
    "10": {
      "field_id": "RXE.10",
      "name": "Dispense Amount",
      "description": "This field contains the amount to be dispensed as encoded by the pharmacy or treatment supplier.",
      "length": "20",
      "data_type": "NM - Numeric",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "11": {
      "field_id": "RXE.11",
      "name": "Dispense Units",
      "description": "This field contains the units for the dispense amount as encoded by the pharmacy or treatment supplier. This field is required if the units are not implied by the actual dispense code. This must be in simple units that reflect the actual quantity of the substance dispensed. It does not include compound units.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "12": {
      "field_id": "RXE.12",
      "name": "Number Of Refills",
      "description": "This field contains the total original number of refills. Outpatient only.",
      "length": "3",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "13": {
      "field_id": "RXE.13",
      "name": "Ordering Provider's DEA Number",
      "description": "This field is defined as conditional because it is required when the substance requested is a controlled substance (e.g., a narcotic).",
      "length": "250",
      "data_type": "XCN - Extended Composite ID Number and Name for Persons",
      "optionality": "Conditional",
      "repeatability": "Repeatable indefinitely"
    },
    "14": {
      "field_id": "RXE.14",
      "name": "Pharmacist/Treatment Supplier's Verifier ID",
      "description": "This field contains the provider ID of Pharmacist/treatment supplier's verifier. Use if required by the pharmacy or treatment application or site on orders (or some subgroup of orders).",
      "length": "250",
      "data_type": "XCN - Extended Composite ID Number and Name for Persons",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "15": {
      "field_id": "RXE.15",
      "name": "Prescription Number",
      "description": "This field contains the prescription number as assigned by the pharmacy or treatment application. Equivalent in uniqueness to the pharmacy/treatment filler order number. At some sites, this may be the pharmacy or treatment system (internal) sequential form. At other sites, this may be an external form. This is a required field in RXE when used in pharmacy/treatment messages, but it is not required when used in product experience messages (see Chapter 7).",
      "length": "20",
      "data_type": "ST - String Data",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "16": {
      "field_id": "RXE.16",
      "name": "Number of Refills Remaining",
      "description": "Number of refills remaining. This field is conditional because it is required when a prescription is dispensed to an outpatient. It is not relevant to inpatient treatment orders.",
      "length": "20",
      "data_type": "NM - Numeric",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "17": {
      "field_id": "RXE.17",
      "name": "Number of Refills/Doses Dispensed",
      "description": "Number of refills dispensed. This field is conditional because it is required when a prescription is dispensed to an outpatient. It is not relevant to inpatient treatment orders.",
      "length": "20",
      "data_type": "NM - Numeric",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "18": {
      "field_id": "RXE.18",
      "name": "D/T of Most Recent Refill or Dose Dispensed",
      "description": "Date/time of the most recent refill or dose dispensed.",
      "length": "24",
      "data_type": "DTM - Date/Time",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "19": {
      "field_id": "RXE.19",
      "name": "Total Daily Dose",
      "description": "This field contains the total daily dose for this particular pharmaceutical as expressed in terms of actual dispense units.",
      "length": "10",
      "data_type": "CQ - Composite Quantity with Units",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "RXE.2",
      "name": "Give Code",
      "description": "This field identifies the medical substance or treatment that has been ordered to be given to the patient, as encoded by the pharmacy or treatment supplier; it is equivalent to OBR-4-universal service ID in function. In the RXE segment, this give code must be fully encoded. The dispense fields, which define the units and amount of what is to be issued to the patient (see RXE-10-dispense amount and RXE-11-dispense units below) do not necessarily correlate with the instructions of what amount is to be \"given\" or administered with each dose, and may or may not be specified with the order. For example, the \"give\" part of the order may convey the field-representation of give 250 mg of Ampicillin, while the request to dispense part of the order may convey issue 30 tablets of generic equivalent for this outpatient prescription.\n\nFor vaccines, HL7 Table 0292 – Vaccines Administered is the preferred coding system. For non-vaccine products, the coding system may be a local implementation of User-defined Table 0479 – Pharmaceutical Substances or an external coding system.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "20": {
      "field_id": "RXE.20",
      "name": "Needs Human Review",
      "description": "This field uses HL7 Table 0136 - Yes/No Indicator. The values have the following meaning for this field:\n\nYes - Indicates that a warning is present. The application receiving the encoded order needs to warn the person administering the drug or treatment to pay attention to the text in RXE-21-pharmacy/treatment special dispensing instructions.\nNo - Indicates no warning is present. This is the equivalent default (null) value.",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "21": {
      "field_id": "RXE.21",
      "name": "Pharmacy/Treatment Supplier's Special Dispensing Instructions",
      "description": "This field contains the pharmacy or treatment supplier's provider-generated special instructions to the provider dispensing/administering the order.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "22": {
      "field_id": "RXE.22",
      "name": "Give Per (Time Unit)",
      "description": "This field contains the time unit to use to calculate the rate at which the pharmaceutical is to be administered.\n\nThis field is defined as conditional because it is required when the ordered substance is to be administered continuously at a prescribed rate (e.g., certain IVs). For example, if the \"give amount/units\" were 300 ml and the \"give per\" time unit were H1 (equivalent to one hour), the rate is 300ml/hr.",
      "length": "20",
      "data_type": "ST - String Data",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "23": {
      "field_id": "RXE.23",
      "name": "Give Rate Amount",
      "description": "This field contains the rate at which the substance should be administered.",
      "length": "6",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "24": {
      "field_id": "RXE.24",
      "name": "Give Rate Units",
      "description": "This field contains the units for RXE-23-give rate amount. May be composite. The ratio of the RXE-23-give rate amount and RXE-24-give rate units defines the actual rate of administration. Thus, if RXE-23-give rate amount = 100 and RXE-24-give rate units = ml/hr, the requested rate of administration is 100 ml/hr. (See ISO+ figure 7-9 in Chapter 7 for possible compound units codes.)",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "25": {
      "field_id": "RXE.25",
      "name": "Give Strength",
      "description": "Use when RXE-2-give code does not specify the strength. This is the numeric part of the strength, used in combination with RXE-26-give strength units.",
      "length": "20",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "26": {
      "field_id": "RXE.26",
      "name": "Give Strength Units",
      "description": "Definition: Use when RXE-2-Give Code does not specify the strength. This is the unit of the strength, used in combination with RXE-25-Give Strength.\n\nNote: These units can be a \"compound quantity\"; i.e., the units may express a quantity per unit of time. For example, micrograms per hour (micg/h) is an acceptable value. These compound units are contained in the ISO+ table. See Chapter 7 for full definition of ISO+ units.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "27": {
      "field_id": "RXE.27",
      "name": "Give Indication",
      "description": "This field identifies the condition or problem for which the drug/treatment was prescribed. May repeat if multiple indications are relevant.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "28": {
      "field_id": "RXE.28",
      "name": "Dispense Package Size",
      "description": "This field contains the size of package to be dispensed. Units are transmitted in RXE-29-dispense package size unit.",
      "length": "20",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "29": {
      "field_id": "RXE.29",
      "name": "Dispense Package Size Unit",
      "description": "This field contains the units in which RXE-28-dispense package size is denominated.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "RXE.3",
      "name": "Give Amount - Minimum",
      "description": "This field contains the ordered amount as encoded by the pharmacy or treatment supplier. In a variable dose order, this is the minimum ordered amount. In a non-varying dose order, this is the exact amount of the order.\n\nNote: This field is not a duplication of the first component of the quantity/timing field, since in non-pharmacy/treatment orders, that component can be used to specify multiples of an ordered amount.\n\nAnother way to say this is that, for pharmacy/treatment orders, the quantity component of the quantity/timing field refers to what is to be given out at each service interval; thus, in terms of the RX order, that first component always defaults to 1. Hence, in the actual execution of the order, the value of 1 in the first component of the quantity/timing field always refers to one administration of the amount specified in this field (the requested Give Amount field).",
      "length": "20",
      "data_type": "NM - Numeric",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "30": {
      "field_id": "RXE.30",
      "name": "Dispense Package Method",
      "description": "This field contains the method by which treatment is dispensed. Refer to HL7 Table 0321 - Dispense Method for valid values.",
      "length": "2",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "31": {
      "field_id": "RXE.31",
      "name": "Supplementary Code",
      "description": "This field accommodates the identification of any codes that might be associated with the pharmaceutical substance. Common codes include: the Generic Product Identifier (GPI), Generic Code Number_Sequence Number (GCN_SEQNO), National Drug Code (NDC).",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "32": {
      "field_id": "RXE.32",
      "name": "Original Order Date/Time",
      "description": "This field contains the date/time of the original order (ORC-9) when a refill authorization is being requested. This was represented in the ORC-9 of the original order transaction.",
      "length": "24",
      "data_type": "DTM - Date/Time",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "33": {
      "field_id": "RXE.33",
      "name": "Give Drug Strength Volume",
      "description": "This numeric field defines the volume measurement in which the drug strength concentration is contained. For example, Acetaminophen 120 MG/5ML Elixir means that 120 MG of the drug is in a solution with a volume of 5 ML, which would be encoded in RXE-25, RXE-26, RXE-33 and RXE-34 as:",
      "length": "5",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "34": {
      "field_id": "RXE.34",
      "name": "Give Drug Strength Volume Units",
      "description": "This field indicates the volumetric unit associated with RXE-33 Give Drug Strength Volume. See example in RXE-33.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "35": {
      "field_id": "RXE.35",
      "name": "Controlled Substance Schedule",
      "description": "This field specifies the class of the drug or other substance if its usage is controlled by legislation. In the USA, such legislation includes the federal Controlled Substance Act (CSA) or a State Uniform Controlled Substance Act. Refer to User-defined table 0477 – Controlled Substance Schedule for valid values for USA usage. Other countries should create their own versions of this table.",
      "length": "60",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "36": {
      "field_id": "RXE.36",
      "name": "Formulary Status",
      "description": "This field specifies whether or not the pharmaceutical substance is part of the local formulary. Refer to HL7 table 0478 - Formulary Status for valid values.",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "37": {
      "field_id": "RXE.37",
      "name": "Pharmaceutical Substance Alternative",
      "description": "This field specifies a pharmaceutical substance that is in the formulary that could be prescribed in lieu of the substance being prescribed. In the case where the specified medication is non-formulary this field would contain therapeutic alternatives that are on the formulary.",
      "length": "60",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "38": {
      "field_id": "RXE.38",
      "name": "Pharmacy of Most Recent Fill",
      "description": "This field specifies the pharmacy that last filled the prescription.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "39": {
      "field_id": "RXE.39",
      "name": "Initial Dispense Amount",
      "description": "This field specifies the quantity dispensed on the original fill (first fill) of a prescription when that amount is not the same as the quantity to be used in refills. One use case is when a new medication is being prescribed and the prescriber wants to determine if the patient will tolerate the medication. The prescriber indicates that the medication should be filled for an initial amount of 30 tablets and, if tolerated, refilled using a quantity of 100 tablets. In this case, RXE-39 would contain 30 and RXE-10 would contain 100.",
      "length": "250",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "4": {
      "field_id": "RXE.4",
      "name": "Give Amount - Maximum",
      "description": "In a variable dose order, this is the maximum ordered amount. In a non-varying dose, this field is not used.",
      "length": "20",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "40": {
      "field_id": "RXE.40",
      "name": "Dispensing Pharmacy",
      "description": "This field specifies the pharmacy that will dispense or has dispensed the prescription. In the context of an order/request (i.e., in an RXO segment) this field represents the requested dispensing pharmacy. In the context of a registered order (i.e., in an RXE segment) this field represents the intended dispensing pharmacy, the pharmacy that is expected to dispense the prescription.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "41": {
      "field_id": "RXE.41",
      "name": "Dispensing Pharmacy Address",
      "description": "This field specifies the address of the dispensing facility.",
      "length": "250",
      "data_type": "XAD - Extended Address",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "42": {
      "field_id": "RXE.42",
      "name": "Deliver-to Patient Location",
      "description": "This field specifies the location of the patient to whom the pharmaceutical substance is to be delivered.",
      "length": "80",
      "data_type": "PL - Person Location",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "43": {
      "field_id": "RXE.43",
      "name": "Deliver-to Address",
      "description": "This field specifies the address, either mailing or physical, to which the prescription should be mailed or delivered.",
      "length": "250",
      "data_type": "XAD - Extended Address",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "44": {
      "field_id": "RXE.44",
      "name": "Pharmacy Order Type",
      "description": "The Pharmacy Order Type field defines the general category of pharmacy order which may be used to determine the processing path the order will take. Refer to HL7 Table 0480 Pharmacy Order Types for valid values.",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "RXE.5",
      "name": "Give Units",
      "description": "This field contains the units for the give amount as encoded by the pharmacy or treatment (e.g., respiratory therapy) application.\n\nNote: These units can be a \"compound quantity\"; i.e., the units may contain the word \"per.\" For example, micrograms per KG (micg/kg) is an acceptable value, which means that the units are micrograms per KG (of body weight).",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "6": {
      "field_id": "RXE.6",
      "name": "Give Dosage Form",
      "description": "The dosage form indicates the manner in which the medication or treatment is aggregated for dispensing, e.g., tablets, capsules, suppositories. In some cases, this information is implied by the give code in RXE-2-Give Code. Use the RXE-6-Give Dosage Form when the give code does not specify the dosage form.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "7": {
      "field_id": "RXE.7",
      "name": "Provider's Administration Instructions",
      "description": "This field contains the ordering provider's instructions to the patient or the provider administering the drug or treatment. If coded, a user-defined table must be used; if free text (describing a custom IV, mixture, or salve, for example), place the text in the second component, e.g., |^this is a free text administration instruction|.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "8": {
      "field_id": "RXE.8",
      "name": "Deliver-To Location",
      "description": "This field is retained for backward compatibility only as of v2.5. The reader is referred to RXE-40, RXE-41, RXE-42 and RXE-43. The first component contains the inpatient or outpatient location to which the pharmacy or treatment supplier is to deliver the drug or treatment (if applicable). The default (null) value is the current census location for the patient. Site-specific table. The first eight components have the same form as the first eight components of PV1-3-Assigned Patient Location. The final eight components replace the ninth component of PV1-3-Assigned Patient location and represent the full address specification.",
      "length": "200",
      "data_type": "LA1 - Location with Address Variation 1",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    },
    "9": {
      "field_id": "RXE.9",
      "name": "Substitution Status",
      "description": "Refer to HL7 Table 0167 - Substitution Status for valid values. If a substitution has been made, and a record of the original requested give code (RXO-1-requested give code) is needed, the optional RXO segment can be included in the RDE message.",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    }
  }
}