{
  "segment_id": "RXO",
  "short_description": "Pharmacy/Treatment Order",
  "description": "This is the \"master\" pharmacy/treatment order segment. It contains order data not specific to components or additives. Unlike the OBR, it does not contain status fields or other data that are results-only.",
  "fields": {
    "1": {
      "field_id": "RXO.1",
      "name": "Requested Give Code",
      "description": "This field identifies the treatment product or treatment ordered to be given to the patient; it is analogous to OBR-4-universal service IDin function. Examples of treatments products include medications and certain devices or supplies, e.g., inhaler spacers, blood glucose monitors, syringes, infusion sets, which might require prescription.\n\nThe RXO-1, RXO-2 and RXO-4 are mandatory unless the prescription/treatment is transmitted as free text using RXO-6, then RXO-1, RXO-2, and RXO-4 may be blank and the first subcomponent of RXO-6 must be blank.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "10": {
      "field_id": "RXO.10",
      "name": "Requested Dispense Code",
      "description": "This field indicates what is to be/was dispensed; it is analogous to OBR-4-universal service ID in function. It may be present in the order or not, depending on the application. If not present, and values are given for RXO-11-requested dispense amount and RXO-12-requested dispense units, the RXO-1-requested give code is assumed. If the requested dispense code does not include the dosage form, then RXO-5-requested dosage form is required.\n\nNote: Sometimes an order will be written in which the total amount of the drug or treatment requested to be dispensed has no direct relationship with the give amounts and schedule. For example, an outpatient pharmacy/treatment order might be take four tablets a day of <drug name, value>, Q6H (every 6 hours) -- dispense 30 tablets. An inpatient order might be NS/D5W (normal saline with 5% dextrose) at 1000cc/hour—dispense 3 1-liter bottles of NSD5W solution. The request-to-dispense fields support this common style of ordering.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "11": {
      "field_id": "RXO.11",
      "name": "Requested Dispense Amount",
      "description": "This field specifies the amount to be dispensed.\n\nNote: Sometimes an order will be written in which the total amount of the drug or treatment requested to be dispensed has no direct relationship with the give amounts and schedule. For example, an outpatient pharmacy/treatment order might be take four tablets a day of <drug name, value>, Q6H (every 6 hours) -- dispense 30 tablets. An inpatient order might be NS/D5W (normal saline with 5% dextrose) at 1000cc/hour—dispense 3 1-liter bottles of NSD5W solution. The request-to-dispense fields support this common style of ordering.",
      "length": "20",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "12": {
      "field_id": "RXO.12",
      "name": "Requested Dispense Units",
      "description": "This field identifies the units for the dispense amount. This must be in simple units that reflect the actual quantity of the substance to be dispensed. It does not include compound units.\n\nNote: Sometimes an order will be written in which the total amount of the drug or treatment requested to be dispensed has no direct relationship with the give amounts and schedule. For example, an outpatient pharmacy/treatment order might be take four tablets a day of <drug name, value>, Q6H (every 6 hours) -- dispense 30 tablets. An inpatient order might be NS/D5W (normal saline with 5% dextrose) at 1000cc/hour—dispense 3 1-liter bottles of NSD5W solution. The request-to-dispense fields support this common style of ordering.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "13": {
      "field_id": "RXO.13",
      "name": "Number Of Refills",
      "description": "This field defines the number of times the requested dispense amount can be given to the patient, subject to local regulation. Refers to outpatient only.",
      "length": "3",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "14": {
      "field_id": "RXO.14",
      "name": "Ordering Provider's DEA Number",
      "description": "This field identifies the provider's controlled substance number, if required, by site. It is defined as conditional because it is required when the substance being requested is a controlled substance (e.g., a narcotic).",
      "length": "250",
      "data_type": "XCN - Extended Composite ID Number and Name for Persons",
      "optionality": "Conditional",
      "repeatability": "Repeatable indefinitely"
    },
    "15": {
      "field_id": "RXO.15",
      "name": "Pharmacist/Treatment Supplier's Verifier ID",
      "description": "This field is the provider ID of the pharmacist/treatment supplier verifier. Use if required by the pharmacy or treatment application or site on orders (or some subgroup of orders), in addition to ORC-11-verified by.",
      "length": "250",
      "data_type": "XCN - Extended Composite ID Number and Name for Persons",
      "optionality": "Conditional",
      "repeatability": "Repeatable indefinitely"
    },
    "16": {
      "field_id": "RXO.16",
      "name": "Needs Human Review",
      "description": "This field uses HL7 Table 0136 - Yes/No Indicator. The values have the following meaning for this field:\n\nYes - Indicates that the pharmacist or non-pharmacist treatment supplier filling the order needs to pay special attention to the text in the RXO-6-provider's pharmacy/treatment instructions. A warning is present.\nNo - No warning is present. This is the equivalent default (null) value.",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "17": {
      "field_id": "RXO.17",
      "name": "Requested Give Per (Time Unit)",
      "description": "This field identifies the time unit to use to calculate the rate at which the pharmaceutical is to be administered.\n\nThis field is defined as conditional because it is required when the ordered substance is to be administered continuously at a prescribed rate (e.g., certain IVs). For example, if the \"give amount/units\" are 300 ml and the \"give per\" time unit is H1, the rate is 300ml/hr and the duration of this dose is 1 hour. Thus the give amount and give per time unit define the duration of the service.",
      "length": "20",
      "data_type": "ST - String Data",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "18": {
      "field_id": "RXO.18",
      "name": "Requested Give Strength",
      "description": "Required when RXO-1-requested give code does not specify the strength; optionally included otherwise. This is the numeric part of the strength, used in combination with RXO-19-requested give strength units.",
      "length": "20",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "19": {
      "field_id": "RXO.19",
      "name": "Requested Give Strength Units",
      "description": "Required when both RXO-1-requested give code and RXO-10-requested dispense code do not specify the strength; optionally included otherwise. This is the unit of the strength, used in combination with RXO-18-requested give strength.\n\nNote: These units can be a \"compound quantity;\" i.e., the units may express a quantity per unit of time. For example, micrograms per hour (micg/h) is an acceptable value. These compound units are contained in the ISO+ table. See Chapter 7 for full definition of ISO+ units.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "RXO.2",
      "name": "Requested Give Amount - Minimum",
      "description": "This field is the ordered amount. In a variable dose order, this is the minimum ordered amount. In a non-varying dose order, this is the exact amount of the order.\n\nThe RXO-1, RXO-2 and RXO-4 are mandatory unless the prescription/treatment is transmitted as free text using RXO-6, then RXO-1, RXO-2, and RXO-4 may be blank and the first subcomponent of RXO-6 must be blank.\n\nNote: This field is not a duplication of the first component of the quantity/timing field, since in non-pharmacy/treatment orders, that component can be used to specify multiples of an ordered amount.\n\nAnother way to say this is that, for pharmacy/treatment orders, the quantity component of the quantity/timing field refers to what is to be given out at each service interval; thus, in terms of the RX order, that first component always defaults to 1. Hence, in the actual execution of the order, the value of 1 in the first component of the quantity/timing field always refers to one administration of the amount specified in this field (the Requested Give Amount field).",
      "length": "20",
      "data_type": "NM - Numeric",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "20": {
      "field_id": "RXO.20",
      "name": "Indication",
      "description": "This field identifies the condition or problem for which the drug/treatment was prescribed. May repeat if multiple indications are relevant.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "21": {
      "field_id": "RXO.21",
      "name": "Requested Give Rate Amount",
      "description": "This field contains the rate at which to administer a treatment, e.g., 150 ml/hr (for an IV) or 4 liters/min for nasal oxygen.",
      "length": "6",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "22": {
      "field_id": "RXO.22",
      "name": "Requested Give Rate Units",
      "description": "This field contains the units in which RXO-21-requested give rate amount is denominated.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "23": {
      "field_id": "RXO.23",
      "name": "Total Daily Dose",
      "description": "This field contains the total daily dose for this particular pharmaceutical as expressed in terms of actual dispense units.",
      "length": "10",
      "data_type": "CQ - Composite Quantity with Units",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "24": {
      "field_id": "RXO.24",
      "name": "Supplementary Code",
      "description": "This field accommodates the identification of any codes that might be associated with the pharmaceutical substance. Common codes include: the Generic Product Identifier (GPI), Generic Code Number_Sequence Number (GCN_SEQNO), National Drug Code (NDC).",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "25": {
      "field_id": "RXO.25",
      "name": "Requested Drug Strength Volume",
      "description": "This numeric field defines the volume measurement in which the drug strength concentration is contained. For example, Acetaminophen 120 MG/5ML Elixir means that 120 MG of the drug is in a solution with a volume of 5 ML, which would be encoded in RXO-18, RXO-19, RXO-25 and RXO-26 as:\nRXO| | | | | | | | | | | | | | | | | |120|mg^^ISO| | | | | |5|ml^^ISO ...<cr>",
      "length": "5",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "26": {
      "field_id": "RXO.26",
      "name": "Requested Drug Strength Volume Units",
      "description": "This field indicates the volumetric unit associated with RXO-25 Requested Drug Strength Volume. See example in RXO-25.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "27": {
      "field_id": "RXO.27",
      "name": "Pharmacy Order Type",
      "description": "The Pharmacy Order Type field defines the general category of pharmacy order which may be used to determine the processing path the order will take. Refer to HL7 Table 0480 Pharmacy Order Types for valid values.",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "28": {
      "field_id": "RXO.28",
      "name": "Dispensing Interval",
      "description": "This field specifies the minimum number of days that must occur between dispensing events",
      "length": "20",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "29": {
      "field_id": "RXO.29",
      "name": "Medication Instance Identifier",
      "description": "This field contains a value that uniquely identifies the medication associated with this segment. Rather than identifying the product to be given, as in RXO-1 Requested Give Code , this field serves to identify the medication in association with the order represented by the segment instance. This identifier is persistent within and across message instances.\n\nNote: RXO-39 Medication Instance Identifier was introduced in v2.6 to support Patient Care messaging concepts and constructs. At this time, there are no documented use cases for this field in the context of a pharmacy/treatment orders as described in this chapter. This statement does not preclude the use of RXO-29 in pharmacy messages, but implementers should exercise caution in using this field outside of the Patient Care context until the pharmacy/treatment use cases are established.",
      "length": "60",
      "data_type": "EI - Entity Identifier",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "RXO.3",
      "name": "Requested Give Amount - Maximum",
      "description": "In a variable dose order, this is the maximum ordered amount. In a non-varying dose order, this field is not used.",
      "length": "20",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "30": {
      "field_id": "RXO.30",
      "name": "Segment Instance Identifier",
      "description": "This field contains a value that uniquely identifies this segment across time and messages. This is not intended as a \"Set ID\", but as a unique identifier allowing references not only to segments of the same message, but also to segments of other messages and indirectly to the entities described in those segments if the necessary persistence was manageable by the applications. This identifier is persistent within and across message instances.\n\nNote: RXO-30 Segment Instance Identifier was introduced in v2.6 to support Patient Care messaging concepts and constructs. At this time, there are no documented use cases for this field in the context of a pharmacy/treatment orders as described in this chapter. This statement does not preclude the use of RXO-30 in pharmacy messages, but implementers should exercise caution in using this field outside of the Patient Care context until the pharmacy/treatment use cases are established.",
      "length": "60",
      "data_type": "EI - Entity Identifier",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "31": {
      "field_id": "RXO.31",
      "name": "Mood Code",
      "description": "This field represents the functional state of the order represented by this segment instance. Refer to HL7 Table 0725 - Mood Codes for valid values. This field may only be used with new trigger events and new messages from v2.6 onward. When this field is not valued in a message that qualifies, then the value is assumed to be 'EVN'.\n\nNote: RXO-31 Mood Code was introduced in v2.6 to support Patient Care messaging concepts and constructs. At this time, there are no documented use cases for this field in the context of a pharmacy/treatment orders as described in this chapter. This statement does not preclude the use of RXO-31 in pharmacy messages, but implementers should exercise caution in using this field outside of the Patient Care context until the pharmacy/treatment use cases are established. While a similar note exists for RXO-29 Medication Instance Identifier and RXO-30 Segment Instance Identifier, particular care should be taken with RXO-31 as this could modify the intent of the segment/message and create backward compatibility problems.",
      "length": "2",
      "data_type": "CNE - Coded with No Exceptions",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "32": {
      "field_id": "RXO.32",
      "name": "Dispensing Pharmacy",
      "description": "This field specifies the pharmacy that will dispense or has dispensed the prescription. In the context of an order/request (i.e., in an RXO segment) this field represents the requested dispensing pharmacy. In the context of a registered order (i.e., in an RXE segment) this field represents the intended dispensing pharmacy, the pharmacy that is expected to dispense the prescription.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "33": {
      "field_id": "RXO.33",
      "name": "Dispensing Pharmacy Address",
      "description": "This field specifies the address of the dispensing facility.",
      "length": "250",
      "data_type": "XAD - Extended Address",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "34": {
      "field_id": "RXO.34",
      "name": "Deliver-to Patient Location",
      "description": "This field specifies the location of the patient to whom the pharmaceutical substance is to be delivered.",
      "length": "80",
      "data_type": "PL - Person Location",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "35": {
      "field_id": "RXO.35",
      "name": "Deliver-to Address",
      "description": "This field specifies the address, either mailing or physical, to which the prescription should be mailed or delivered.",
      "length": "250",
      "data_type": "XAD - Extended Address",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "4": {
      "field_id": "RXO.4",
      "name": "Requested Give Units",
      "description": "This field indicates the units for the give amount.\n\nThe RXO-1, RXO-2 and RXO-4 are mandatory unless the prescription/treatment is transmitted as free text using RXO-6, then RXO-1, RXO-2, and RXO-4 may be blank and the first subcomponent of RXO-6 must be blank.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "RXO.5",
      "name": "Requested Dosage Form",
      "description": "This field indicates the manner in which the treatment is aggregated for dispensing, e.g., tablets, capsules suppositories. In some cases, this information is implied by the dispense/give code in RXO-1-requested give code or RXO-10-Requested dispense code. Required when both RXO-1-Requested give code and RXO-10-Requested dispense code do not specify the drug/treatment form; optionally included otherwise.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "6": {
      "field_id": "RXO.6",
      "name": "Provider's Pharmacy/Treatment Instructions",
      "description": "This field identifies the ordering provider's instructions to the pharmacy or the non-pharmacy treatment provider (e.g., respiratory therapy). If coded, a user-defined table must be used. If transmitted as a free text field, place a null in the first component and the text in the second, e.g., |^this is a free text treatment instruction|.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "7": {
      "field_id": "RXO.7",
      "name": "Provider's Administration Instructions",
      "description": "This field identifies the ordering provider's instructions to the patient or to the provider administering the drug or treatment. If coded, a user-defined table must be used. If transmitted as free text, place a null in the first component and the text in the second, e.g., |^this is a free text administration instruction|.",
      "length": "250",
      "data_type": "CWE - Coded with Exceptions",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "8": {
      "field_id": "RXO.8",
      "name": "Deliver-To Location",
      "description": "This field is retained for backward compatibility only as of v 2.6 . The reader is referred to RXO-32, RXO-33, RXO-34 and RXO-35. The first components contain the inpatient or outpatient location to which the pharmacy provider or treatment supplier is to deliver the drug or treatment device (if applicable). The default (null) value is the current census location for the patient. The last component can be used to specify an address. This could be used to fill mail orders to a patient or provider, or to account for home health care.",
      "length": "200",
      "data_type": "LA1 - Location with Address Variation 1",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    },
    "9": {
      "field_id": "RXO.9",
      "name": "Allow Substitutions",
      "description": "No description found.",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    }
  }
}