{
  "segment_id": "TQ2",
  "short_description": "Timing/Quantity Relationship",
  "description": "The TQ2 segment is used to form a relationship between the service request the TQ1/TQ2 segments are associated with, and other service requests. The TQ2 segment will link the current service request with one or more other service requests.",
  "fields": {
    "1": {
      "field_id": "TQ2.1",
      "name": "Set ID - TQ2",
      "description": "For the first timing specification transmitted, the sequence number shall be 1; for the second timing specification, it shall be 2; and so on.",
      "length": "4",
      "data_type": "SI - Sequence ID",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "10": {
      "field_id": "TQ2.10",
      "name": "Special Service Request Relationship",
      "description": "This defines an additional or alternate relationship between this service request and other service requests. Its primary intended use is for Pharmacy administration service requests, but it may be useful for other domains. See HL7 Table 0506 - Service Request Relationship for allowed values.\n\nEither this field or TQ2-6 must be present.",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "TQ2.2",
      "name": "Sequence/Results Flag",
      "description": "This flag defines the sequencing relationship between the current service request, and the related service request(s) specified in this TQ2 segment. See HL7 Table 0503 - Sequence/Results Flag for values. If not value is present, the S - Sequential is the default value.",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "TQ2.3",
      "name": "Related Placer Number",
      "description": "The placer numbers of the service request(s) to which this TQ2 segment links the current service request. This field should be populated with the appropriate \"Placer number\" from the current service request. For orders, the Placer Order Number from ORC-2 is the appropriate \"Placer number\". Repeats of this field indicate the current service request is related to multiple service requests.\n\nAt least one of TQ2-3, TQ2-4, TQ2-5 must contain a value.",
      "length": "22",
      "data_type": "EI - Entity Identifier",
      "optionality": "Conditional",
      "repeatability": "Repeatable indefinitely"
    },
    "4": {
      "field_id": "TQ2.4",
      "name": "Related Filler Number",
      "description": "The filler numbers of the service request(s) to which this TQ2 segment links the current service request. This field should be populated with the appropriate \"Filler number\" from the current service request. For orders, the Filler Order Number from ORC-3 is the appropriate \"Filler number\". Repeats of this field indicate the current service request is related to multiple service requests.\n\nAt least one of TQ2-3, TQ2-4, TQ2-5 must contain a value.",
      "length": "22",
      "data_type": "EI - Entity Identifier",
      "optionality": "Conditional",
      "repeatability": "Repeatable indefinitely"
    },
    "5": {
      "field_id": "TQ2.5",
      "name": "Related Placer Group Number",
      "description": "The placer group numbers of the service request(s) to which this TQ2 segment links the current service request. This field should be populated with the appropriate \"Placer group number\" from the current service request. For orders, the Placer Group Number from ORC-4 is the appropriate \"Placer group number\". Repeats of this field indicate that the current service request is related to multiple groups of service requests.\n\nAt least one of TQ2-3, TQ2-4, TQ2-5 must contain a value.",
      "length": "22",
      "data_type": "EI - Entity Identifier",
      "optionality": "Conditional",
      "repeatability": "Repeatable indefinitely"
    },
    "6": {
      "field_id": "TQ2.6",
      "name": "Sequence Condition Code",
      "description": "Defines the relationship between the start/end of the related service request(s) (from TQ2-3, TQ2-4, or TQ2-5) and the current service request from ORC-2, 3 or 4. See HL7 Table 0504 - Sequence Condition Code for allowed values.\n\nEither this field or TQ2-10 must be present.",
      "length": "2",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "7": {
      "field_id": "TQ2.7",
      "name": "Cyclic Entry/Exit Indicator",
      "description": "Indicates if this service request is the first, last, service request in a cyclic series of service requests. If null or not present, this field indicates that the current service request is neither the first or last service request in a cyclic series of service requests. Refer to HL7 Table 0505 - Cyclic Entry/Exit Indicator for allowed values.\n\nShould not be populated when TQ2-2 (Sequence/Results Flag) is not equal to a 'C' (cyclic service request).",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "8": {
      "field_id": "TQ2.8",
      "name": "Sequence Condition Time Interval",
      "description": "Defines the interval of time between the start/end of the related service request(s) and the start/end of the current service request. The unit's component is constrained to units of time. If this field is not populated, then there should be no interruption between start/ending the current service request, and the related service request(s).",
      "length": "20",
      "data_type": "CQ - Composite Quantity with Units",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "9": {
      "field_id": "TQ2.9",
      "name": "Cyclic Group Maximum Number of Repeats",
      "description": "The maximum number of repeats for a cyclic group.",
      "length": "10",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    }
  }
}