{
  "segment_id": "VTQ",
  "short_description": "Virtual Table Query Request",
  "description": "The VTQ segment is used to define queries that are responded to with the Tabular Data Message (TBR). The VTQ query message is an alternate method to the EQQ query message that some systems may find easier to implement, due to its use of HL7 delimiters that separate components of the selection definition, and its limited selection criteria. Queries involving complex selection criteria (nested operators, etc.) may need to be formatted as an EQL segment.\n\nAs with the other query methods, the functional chapters define specific queries supported as VTQ messages. Refer to these functional chapters for the lists of HL7-defined Virtual Tables, selection lists and criteria",
  "fields": {
    "1": {
      "field_id": "VTQ.1",
      "name": "Query Tag",
      "description": "This field may be valued by the initiating system to identify the query, and may be used to match response messages to the originating query. If it is valued, the responding system is required to echo it back as the first field in the query acknowledgment segment (QAK). This field differs from MSA-2Message control ID in that its value remains constant for each message (i.e., all continuation messages) associated with the query, whereas MSA-2-Message control ID may vary with each continuation message, since it is associated with each individual message, not the query as a whole.",
      "length": "32",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "VTQ.2",
      "name": "Query/Response Format Code",
      "description": "This field refers to HL7 Table 0106 - Query/response format code for valid values.",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "VTQ.3",
      "name": "VT Query Name",
      "description": "This field contains the name of the Virtual Table query. These names are assigned by the function-specific chapters of this specification. Site-specific VT query names begin with the letter “Z.”",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "4": {
      "field_id": "VTQ.4",
      "name": "Virtual Table Name",
      "description": "This field contains the name of the Virtual Table being referenced. This table name may refer to an HL7-defined segment, an HL7 Virtual Table (refer to the functional chapters), or a site-specific “Z table.”",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "VTQ.5",
      "name": "Selection Criteria",
      "description": "Each repetition of this field defines a column in the RDT segment: the first repetition defines the first column of the RDT segment; the second repetition defines the second column of the RDT segments, etc.",
      "length": "256",
      "data_type": "QSC - Query Selection Criteria",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    }
  }
}