{
  "segment_id": "ERQ",
  "short_description": "Event replay query segment",
  "description": "The ERQ segment is used to issue queries where the desired response is formatted as an event replay response message. This enables the querying application to request detailed event data from an application that supports this feature, such that it may no longer be necessary for it to capture and store all event information at the time of the original trigger event.",
  "fields": {
    "1": {
      "field_id": "ERQ.1",
      "name": "Query Tag",
      "description": "This field may be valued by the initiating system to identify the query, and may be used to match response messages to the originating query. If it is valued, the responding system is required to echo it back as the first field in the query acknowledgment segment (QAK). This field differs from MSA-2-message control ID in that its value remains constant for each message (i.e., all continuation messages) associated with the query, whereas MSA-2- message control ID may vary with each continuation message, since it is associated with each individual message, not the query as a whole.",
      "length": "32",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "ERQ.2",
      "name": "Event Identifier",
      "description": "This field contains the HL7 event identifier corresponding to the original trigger event. Its contents dictate the format of the response message. Hence, a value of 'A04' in this field indicates a request for the data associated with the 'register a patient' trigger event. The ERP response message returns the contents of the 'register a patient' message defined in Chapter 3. If more than one match is found, the ERP returns repeating groups of the segments defined by the 'A04' message.",
      "length": "60",
      "data_type": "CE - Coded Element",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "ERQ.3",
      "name": "Input Parameter List",
      "description": "This field contains the list of parameter names and values to be passed to the responding system, in the form ' <segment field name> ^ <value1 & value2 & value3 ...>. ' A single valued parameter contains only a single subcomponent in the second component: thus no subcomponent delimiters are needed (e.g., <segment field name> ^ <value>). A simple list of values (i.e., a one-dimensional array) may be passed instead of a single value by separating each value with the subcomponent delimiter: ' <segment field name> ^ <value1&value2 &...> .' Refer to Section 2.24.16.4, 'EQL query statement (ST) 00710,' for segment field name definition conventions.",
      "length": "256",
      "data_type": "QIP - Query Input Parameter List",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    }
  }
}