{
  "segment_id": "OBX",
  "short_description": "Observation/result segment",
  "description": "The OBX segment is used to transmit a single observation or observation fragment. It represents the smallest indivisible unit of a report. Its structure is summarized in Figure 7-5.",
  "fields": {
    "1": {
      "field_id": "OBX.1",
      "name": "Set ID - OBX",
      "description": "This field contains the sequence number. For compatibility with ASTM.",
      "length": "4",
      "data_type": "SI - Sequence ID",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "10": {
      "field_id": "OBX.10",
      "name": "Nature of Abnormal Test",
      "description": "This field contains the nature of the abnormal test. Refer to HL7 table 0080 - Nature of abnormal testing for valid values. As many of the codes as apply may be included, separated by repeat delimiters. For example, normal values based on age, sex, and race would be codes as A~S~R.",
      "length": "2",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "11": {
      "field_id": "OBX.11",
      "name": "Observation Result Status",
      "description": "This field contains the observation result status. Refer to HL7 table 0085 - Observation result status codes interpretation for valid values. This field reflects the current completion status of the results for one Observation Identifier.",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "12": {
      "field_id": "OBX.12",
      "name": "Date Last Obs Normal Values",
      "description": "This field contains the changes in the observation methods that would make values obtained from the old method not comparable with those obtained from the new method.",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "13": {
      "field_id": "OBX.13",
      "name": "User Defined Access Checks",
      "description": "This field permits the producer to record results-dependent codes for classifying the observation at the receiving system. This field should be needed only rarely, because most classifications are fixed attributes of the observation ID and can be defined in the associated observation master file (see description in Chapter 8).",
      "length": "20",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "14": {
      "field_id": "OBX.14",
      "name": "Date/Time of the Observation",
      "description": "This field is required in two circumstances. The first is when the observations reported beneath one report header (OBR) have different dates. This could occur in the case of queries, timed test sequences, or clearance studies where one measurement within a battery may have a different time than another measurement.",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "15": {
      "field_id": "OBX.15",
      "name": "Producer's ID",
      "description": "This field contains a unique identifier of the responsible producing service. It should be reported explicitly when the test results are produced at outside laboratories, for example. When this field is null, the receiving system assumes that the observations were produced by the sending organization. This information supports CLIA regulations in the US. The code for producer ID is recorded as a CE data type. In the US, the Medicare number of the producing service is suggested as the identifier.",
      "length": "60",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "16": {
      "field_id": "OBX.16",
      "name": "Responsible Observer",
      "description": "When required, this field contains the identifier of the individual directly responsible for the observation (i.e., the person who either performed or verified it). In a nursing service, the observer is usually the professional who performed the observation (e.g., took the blood pressure). In a laboratory, the observer is the technician who performed or verified the analysis. The code for the observer is recorded as a CE data type. If the code is sent as a local code, it should be unique and unambiguous when combined with OBX-15-producer ID.",
      "length": "80",
      "data_type": "XCN - Extended Composite ID Number And Name For Persons",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "17": {
      "field_id": "OBX.17",
      "name": "Observation Method",
      "description": "No description found.",
      "length": "60",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "2": {
      "field_id": "OBX.2",
      "name": "Value Type",
      "description": "This field contains the format of the observation value in OBX. It must be valued if OBX-11-Observ result status is not valued with an X'. If the value is CE then the result must be a coded entry. When the value type is TX or FT then the results are bulk text. The valid values for the value type of an observation are listed in HL7 table 0125 - Value type .",
      "length": "3",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "OBX.3",
      "name": "Observation Identifier",
      "description": "This field contains a unique identifier for the observation. The format is that of the Coded Element (CE). Example: 93000.3^P-R interval^A34.",
      "length": "80",
      "data_type": "CE - Coded Element",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "4": {
      "field_id": "OBX.4",
      "name": "Observation Sub-ID",
      "description": "This field is used to distinguish between multiple OBX segments with the same observation ID organized under one OBR. For example, a chest X-ray report might include three separate diagnostic impressions. The standard requires three OBX segments, one for each impression. By putting a 1 in the Sub-ID of the first of these OBX segments, 2 in the second, and 3 in the third, we can uniquely identify each OBX segment for editing or replacement.",
      "length": "20",
      "data_type": "ST - String Data",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "OBX.5",
      "name": "Observation Value",
      "description": "This field contains the value observed by the observation producer. OBX-2-value type contains the data type for this field according to which observation value is formatted. It is not a required field because some systems will report only the normalcy/abnormalcy (OBX-8), especially in product experience reporting.",
      "length": "65536",
      "data_type": "VARIES - Variable Datatype",
      "optionality": "Conditional",
      "repeatability": "Repeatable indefinitely"
    },
    "6": {
      "field_id": "OBX.6",
      "name": "Units",
      "description": "This field contains the units that have a data type of CE. The default coding system for the units codes consists of the ISO+ abbreviation for a single case unit (ISO 2955-83) plus extensions, that do not collide with ISO abbreviations (see introductory section to this chapter). We designate this coding system as ISO+. Both the ISO unit's abbreviations and the extensions are defined in Section 7.3.2.6.2, 'ISO and ANSI customary units abbreviations,' and listed in Figure 7-13. The ISO+ abbreviations are the codes for the default coding system. Consequently, when ISO+ units are being used, only ISO+ abbreviations need be sent, and the contents of the units field will be backward compatible to HL7 Version. 2.1.",
      "length": "60",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "7": {
      "field_id": "OBX.7",
      "name": "References Range",
      "description": "When the observation quantifies the amount of a toxic substance, then the upper limit of the range identifies the toxic limit. If the observation quantifies a drug, the lower limits identify the lower therapeutic bounds and the upper limits represent the upper therapeutic bounds above which toxic side effects are common.",
      "length": "60",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "8": {
      "field_id": "OBX.8",
      "name": "Abnormal Flags",
      "description": "This field contains a table lookup indicating the normalcy status of the result. We strongly recommend sending this value when applicable. If the observation is an antimicrobial susceptibility, the interpretation codes are: S=susceptible; R=resistant; I=intermediate; MS=moderately susceptible; VS=very susceptible. (See ASTM 1238 - review for more details). Refer to HL7table 0078 - Abnormal flags for valid entries.",
      "length": "5",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Repeatable 5 times"
    },
    "9": {
      "field_id": "OBX.9",
      "name": "Probability",
      "description": "This field contains the probability of a result being true for results with categorical values. It mainly applies to discrete coded results. It is a decimal number represented as an ASCII string that must be between 0 and 1, inclusive.",
      "length": "5",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Repeatable 5 times"
    }
  }
}