{
  "segment_id": "AUT",
  "short_description": "Authorization Information",
  "description": "This segment represents an authorization or a pre-authorization for a referred procedure or requested service by the payor covering the patient’s health care.",
  "fields": {
    "1": {
      "field_id": "AUT.1",
      "name": "Authorizing Payor, Plan Code",
      "description": "This field contains the ID of the coverage plan authorizing treatment. Values should be entries in a locally-defined table of plan codes. Refer to user-defined table 0072 - Insurance company plans for suggested values",
      "length": "200",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "10": {
      "field_id": "AUT.10",
      "name": "Process Date",
      "description": "This field contains the date that the authorization originated with the authorizing party",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "AUT.2",
      "name": "Authorizing Payor, Company ID",
      "description": "This field contains the ID of the insurance company or other entity that administers the authorizing coverage plan. Values may be entries in a locally-defined table of payor codes. Refer to userdefined table 0285 - Insurance company ID codes for suggested values",
      "length": "200",
      "data_type": "CE - Coded Element",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "AUT.3",
      "name": "Authorizing Payor, Company Name",
      "description": "This field contains the name of the insurance company or other entity that administers the authorizing coverage plan",
      "length": "45",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "4": {
      "field_id": "AUT.4",
      "name": "Authorization Effective Date",
      "description": "This field contains the effective date of the authorization",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "AUT.5",
      "name": "Authorization Expiration Date",
      "description": "This field contains the expiration date after which the authorization to treat will no longer be in effect from the perspective of the coverage plan",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "6": {
      "field_id": "AUT.6",
      "name": "Authorization Identifier",
      "description": "This field contains the coverage application’s permanent identifier assigned to track the authorization and all related billing documents. This field is conditionally required. It is not required when authorization information is being requested. However, it is required when this segment is contained in a message which is responding to a request and contains the authorization information. This is a composite field.\n\nThe first component of this field is a string of up to 15 characters that identifies an individual authorization. It is assigned by the coverage application, and it identifies an authorization, and the subsequent billing transactions resulting from the given authorization, uniquely among all such authorizations granted from a particular processing application.\n\nThe second component is optional because this field, itself, is already defined as an authorization identifier.\n\nThe third component is optional. If used it should contain the application identifier for the coverage application. The application identifier is a string of up to six characters that is uniquely associated with an application. A given healthcare provider facility, or group of intercommunicating healthcare provider facilities, should establish a unique list of applications that may be potential originators and recipients, and then assign unique application identifiers to each of those applications. This list of application identifiers becomes one of the healthcare provider facility’s master dictionary lists. Since applications fulfilling different application roles can send and receive referral messages containing authorizations, the coverage application identifier may not identify the application sending or receiving a particular message. Data elements on the Message Header (MSH) segment are available to identify the actual sending and receiving applications",
      "length": "30",
      "data_type": "EI - Entity Identifier",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "7": {
      "field_id": "AUT.7",
      "name": "Reimbursement Limit",
      "description": "This field contains the dollar limit for reimbursement specified by the coverage plan for the authorized treatment",
      "length": "25",
      "data_type": "CP - Composite Price",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "8": {
      "field_id": "AUT.8",
      "name": "Requested Number of Treatments",
      "description": "This field contains the requested number of times that the treatment may be administered to the patient without obtaining additional authorization",
      "length": "2",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "9": {
      "field_id": "AUT.9",
      "name": "Authorized Number of Treatments",
      "description": "This field contains the number of times that the authorized treatment may be administered to the patient without obtaining additional authorization",
      "length": "2",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    }
  }
}