{
  "segment_id": "LOC",
  "short_description": "Location Identification",
  "description": "The LOC segment can identify any patient location referenced by information systems. This segment gives physical set up information about the location. This is not intended to include any current occupant or current use information. There should be one LOC segment for each patient location. If desired, there can also be one LOC segment for each nursing unit and room.",
  "fields": {
    "1": {
      "field_id": "LOC.1",
      "name": "Primary Key Value",
      "description": "This field contains the institution’s identification code for the location. The identifying key value. Must match MFE-4-primary key value. This field has the same components as the patient location fields in the PV1 segment (except that bed status is not included here).\nAt least the first component of this field is required. The first component can be an identifying code for the nursing station for inpatient locations, or clinic, department or home for patient locations other than inpatient ones.",
      "length": "200",
      "data_type": "PL - Person Location",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "LOC.2",
      "name": "Location Description",
      "description": "This field contains the optional free text description of the location, to elaborate upon LOC primary key value",
      "length": "48",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "LOC.3",
      "name": "Location Type",
      "description": "This field contains the code identifying what type of location this is. Refer to user-defined table 0260 - Patient location type for suggested values",
      "length": "2",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Required",
      "repeatability": "Repeatable indefinitely"
    },
    "4": {
      "field_id": "LOC.4",
      "name": "Organization Name",
      "description": "This field contains the organization of which this location is a part. For inpatient locations, this can be the hospital or institution name. For outpatient locations, this can be the clinic or office name",
      "length": "90",
      "data_type": "XON - Extended Composite Name And ID For Organizations",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "LOC.5",
      "name": "Location Address",
      "description": "This field contains the address of the patient location, especially for use for outpatient clinic or office locations",
      "length": "106",
      "data_type": "XAD - Extended Address",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "6": {
      "field_id": "LOC.6",
      "name": "Location Phone",
      "description": "This field contains the phone number within the patient location, if any. For example, the room or bed phone for use by the patient",
      "length": "40",
      "data_type": "XTN - Extended Telecommunication Number",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "7": {
      "field_id": "LOC.7",
      "name": "License Number",
      "description": "This field contains the multiple license numbers for the facility",
      "length": "60",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "8": {
      "field_id": "LOC.8",
      "name": "Location Equipment",
      "description": "This repeating field indicates what types of equipment are built in. Applies only to room or bed locations. If LOC-3-location type indicates that this is a room, this will be the equipment in the room which can be used by more than one bed. If LOC-3-location type indicates this is a bed, this will be the bedside devices available to this bed. Refer to user-defined table 0261 - Location equipment for suggested values",
      "length": "3",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    }
  }
}