{
  "segment_id": "MRG",
  "short_description": "Merge patient information",
  "description": "The MRG segment provides receiving applications with information necessary to initiate the merging of patient data as well as groups of records. It is intended that this segment be used throughout the Standard to allow the merging of registration, accounting, and clinical records within specific applications\n\nSegment notes: MRG merge patient information\nThe assigning facility ID, the fourth component of the patient identifiers, is an HD data type that is uniquely associated with the facility that originally assigned the number. A given institution, or group of intercommunicating institutions, should establish a list of facilities that may be potential assignors of patient identification (and other important identification) numbers. The list will be one of the institution’s master dictionary lists. Since third parties (other than the assignors of patient identification numbers) may send or receive HL7 messages containing patient identification numbers, the assigning facility ID in the patient identification numbers may not be the same as those of the sending and receiving systems identified in the MSH. The assigning facility ID must be unique across applications at a given site. This field is required in HL7 implementations that have more than a single Patient Administration application assigning such numbers",
  "fields": {
    "1": {
      "field_id": "MRG.1",
      "name": "Prior Patient ID - Internal",
      "description": "This field contains the internal prior patient identifier. This field contains a list of potential “old” numbers to match. Only one old number can be merged with one new number in a transaction. When merging patient IDs, A34 (merge patient information - patient ID only) and A36 (merge patient informationpatient ID & account number), the patient ID contained in the PID segment cannot repeat. Refer to HL7 table 0061 - Check digit scheme",
      "length": "20",
      "data_type": "CX - Extended Composite ID With Check Digit",
      "optionality": "Required",
      "repeatability": "Repeatable indefinitely"
    },
    "2": {
      "field_id": "MRG.2",
      "name": "Prior Alternate Patient ID",
      "description": "This field contains the prior alternate patient identifier. Refer to HL7 table 0061 - Check digit scheme",
      "length": "20",
      "data_type": "CX - Extended Composite ID With Check Digit",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "3": {
      "field_id": "MRG.3",
      "name": "Prior Patient Account Number",
      "description": "This field contains the prior patient account number. Refer to HL7 table 0061 - Check digit scheme",
      "length": "20",
      "data_type": "CX - Extended Composite ID With Check Digit",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "4": {
      "field_id": "MRG.4",
      "name": "Prior Patient ID - External",
      "description": "This field contains the external prior patient identifier. Refer to HL7 table 0061 - Check digit scheme",
      "length": "20",
      "data_type": "CX - Extended Composite ID With Check Digit",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "MRG.5",
      "name": "Prior Visit Number",
      "description": "This field contains the prior visit number. Refer to HL7 table 0061 - Check digit scheme",
      "length": "20",
      "data_type": "CX - Extended Composite ID With Check Digit",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "6": {
      "field_id": "MRG.6",
      "name": "Prior Alternate Visit ID",
      "description": "This field contains the prior alternate visit number. Refer to HL7 table 0061 - Check digit scheme",
      "length": "20",
      "data_type": "CX - Extended Composite ID With Check Digit",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "7": {
      "field_id": "MRG.7",
      "name": "Prior Patient Name",
      "description": "This field contains the prior name of the patient This field is not used to change a patient name. Refer to Chapter 2 for the name type code table",
      "length": "48",
      "data_type": "XPN - Extended Person Name",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    }
  }
}