{
  "segment_id": "OM2",
  "short_description": "Numeric observation",
  "description": "This segment contains the attributes of observations with continuous values (including those with data types of numeric, date, or time stamp). It can be applied to observation batteries of type A and C (see OM119-nature of test/observation).",
  "fields": {
    "1": {
      "field_id": "OM2.1",
      "name": "Sequence Number",
      "description": "This field contains the same value as the sequence number of the associated OM1 segment",
      "length": "4",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "10": {
      "field_id": "OM2.10",
      "name": "Minimum Meaningful Increments",
      "description": "This field contains the numerically valued single observations (a nature code of A or C, as described in OM1-19-nature of test/observation) and specifies the smallest meaningful difference between reported values (the effective resolution of the measuring instrument or technique for continuous data, or the smallest discrete interval that can occur for discrete data).",
      "length": "20",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "OM2.2",
      "name": "Units of Measure",
      "description": "This field contains the single tests/observations (those with a nature code of A or C, as described in OM1-18-nature of test/observation) that have numeric values. This field contains their customary units of measure",
      "length": "60",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "OM2.3",
      "name": "Range of Decimal Precision",
      "description": "This field contains the numerically valued single observations (code A or C as described in OM1-18-nature of test/observation), specifies the total length in characters of the field needed to display the observation, and the number of digits displayed to the right of the decimal point. This is coded as a single number in the format <length>.<decimal-digits>. For example, a value of 6.2 implies 6 characters total (including the sign and decimal point) with 2 digits after the decimal point. For integer values, the period and <decimal-digits> portion may be omitted (that is, 5.0 and 5 are equivalent). More than one such mask may be transmitted (separated by repeat delimiters) when it is necessary to define multiple display formats that are possible.",
      "length": "10",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "4": {
      "field_id": "OM2.4",
      "name": "Corresponding SI Units of Measure",
      "description": "This field contains the single tests/observations - the corresponding SI units of measure in the format, when these differ from the customary units of measure given in the previous field",
      "length": "60",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "OM2.5",
      "name": "SI Conversion Factor",
      "description": "This field contains the continuous, numerically valued tests/observations, with a nature code of A or C (see OM1-18-nature of test/observation). This is a factor for converting the customary units to SI units.\n\nIn the case that the observation units are not SI units, this field provides the formula needed to convert from the reported units to SI units, this shall include the equation needed to convert from the reporting to the SI units.\n\nIn the case that the relation is simply multiplicative, this field shall include only the conversion factor. For example., if (results SI units) = c * (results reporting units),then only c would be stored in this field. In the case of any other functional relationship, the entire equation would be stored as a test.",
      "length": "60",
      "data_type": "TX - Text Data",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "6": {
      "field_id": "OM2.6",
      "name": "Reference",
      "description": "This field contains the reference (normal) ranges for “numeric” observations/tests with a nature code of A or C (see OM1-18-nature of test/observation). It can identify different reference (normal) ranges for different categories of patients according to age, sex, race, and other conditions.\n\nThe general format is\n<ref. (normal) range1>^<sex1>^<age range1>^<age gestation1>^<species1>^<race/subspecies1>^<text condition1>~\n<ref. (normal) range2>^<sex2>^<age range2>^<age gestation2>^<species2>^<race/subspecies2>^<text condition2>~\n<ref. (normal) rangen>^<sexn>^<age rangen>^<age gestationn>^<speciesn>^<race/subspeciesn>^<text conditionn>\n\nThe components are defined in the following sections",
      "length": "200",
      "data_type": "CM_RFR - Reference Range",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "7": {
      "field_id": "OM2.7",
      "name": "Critical Range for Ordinal & Continuous Obs",
      "description": "This field applies only to single tests/observations (i.e., a nature code of A or C, as described in OM1-19-nature of test/observations) with numeric results. When a critical range is defined for such observations, it should be recorded here in the same format as the normal range (see OM2-7-reference (normal) range-ordinal and continuous obs).",
      "length": "200",
      "data_type": "CM_RANGE - Wertebereich",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "8": {
      "field_id": "OM2.8",
      "name": "Absolute Range for Ordinal & Continuous Obs",
      "description": "This field applies only to single tests/observations with a nature code of A or C (see OM1-19nature of test/observation). It defines the range of possible results. Results outside this range are not possible. The field should be recorded in the same format as the normal and critical ranges.",
      "length": "200",
      "data_type": "CM_ABS_RANGE - Absolute Range",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "9": {
      "field_id": "OM2.9",
      "name": "Delta Check Criteria",
      "description": "This field applies only to single tests/observations with a nature code of A or C (see OM1-19nature of test/observation). It defines the range of possible results. Results outside this range are not possible. The field should be recorded in the same format as the normal and critical ranges.\n\nMore than one delta check rule can apply. 13&16^10^%^100~16.1&20^2^a^100 implies that the delta check will trigger on a 10% change when the value of the observation is between 13 and 16. The check will trigger on an absolute change of 2 when the value is between 16.1 and 20. In both cases, the system will keep the last result for 100 days. In this example, beyond 100 days, the computer will not compute a delta check because it will not have a comparison value",
      "length": "200",
      "data_type": "CM_DLT - Delta Check",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    }
  }
}