{
  "segment_id": "RQ1",
  "short_description": "Requisition detail-1 segment",
  "description": "RQ1 contains additional detail for each nonstock requisitioned item. This segment definition is paired with a preceding RQD segment.",
  "fields": {
    "1": {
      "field_id": "RQ1.1",
      "name": "Anticipated Price",
      "description": "This field contains the reference price for the requisition unit of measure that is known to the requisition application. It may or may not be the actual cost of acquiring the item from a supplier. It is also not the price charged to the patient",
      "length": "10",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "RQ1.2",
      "name": "Manufactured ID",
      "description": "This field contains the unique code that identifies the manufacturer on the application receiving the requisition. This field is conditional because either RQ1-2-manufacturer ID and RQ1-3-manufacturer’s catalog or RQ1-4-vendor ID and RQ1-5-vendor catalog must be valued.\n\nCodes may be selected from HIBCC Manufacturers Labeler ID Code (LIC), the UPC or the NDC.",
      "length": "60",
      "data_type": "CE - Coded Element",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "RQ1.3",
      "name": "Manufacturer's Catalog",
      "description": "This field is the manufacturer’s catalog number or code for this item. This field is conditional because either RQ1-2-manufacturer ID and RQ1-3-manufacturer’s catalog or RQ1-4-vendor ID and RQ1-5vendor catalog must be valued.",
      "length": "16",
      "data_type": "ST - String Data",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "4": {
      "field_id": "RQ1.4",
      "name": "Vendor ID",
      "description": "This field is the unique code that identifies the vendor on the application receiving the requisition. This field is conditional because either RQ1-2-manufacturer ID and RQ1-3-manufacturer’s catalog or RQ1-4-vendor ID and RQ1-5-vendor catalog must be valued.\n\nBecause of this, it is recommended that each nonstock item have RQ1-2-manufacturers ID and RQ1-3manufacturer’s catalog, or RQ1-4-vendor ID and RQ1-5-vendor catalog. It is also possible that the requisitioning application will not know the identifier, as listed in the Manufacturer’s or Vendor’s catalog. In this case, it is important to include the name portion of this coded element field.",
      "length": "60",
      "data_type": "CE - Coded Element",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "RQ1.5",
      "name": "Vendor Catalog",
      "description": "This field is the vendor’s catalog number, name, or code for this item. This field is conditional because either RQ1-2-manufacturer ID and RQ1-3-manufacturer’s catalog or RQ1-4-vendor ID and RQ1-5vendor catalog must be valued.",
      "length": "16",
      "data_type": "ST - String Data",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "6": {
      "field_id": "RQ1.6",
      "name": "Taxable",
      "description": "This field indicates whether this item is subject to tax.\n\nIn general, nonstock requisitioned items will be printed by the receiving application and then processed by a human. In other words, the human will use the information to call the vendor or manufacturer to get pricing and other related purchasing information before placing the order with an outside vendor.",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "7": {
      "field_id": "RQ1.7",
      "name": "Substitute Allowed",
      "description": "This field indicates whether the ancillary department may substitute an equivalent version of the item(s) ordered. Refer to HL7 table 0136 - Yes/no indicator",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    }
  }
}