{
  "segment_id": "AIP",
  "short_description": "Personnel Resource",
  "description": "The AIP segment contains information about the personnel types that can be scheduled. Personnel included in a transaction using this segment are assumed to be controlled by a schedule on a schedule filler application. Personnel not controlled by a schedule are not identified on a schedule request using this segment. The kinds of personnel described on this segment include any healthcare provider in the institution controlled by a schedule (for example: technicians, physicians, nurses, surgeons, anesthesiologists, or CRNAs).",
  "fields": {
    "1": {
      "field_id": "AIP.1",
      "name": "Set ID - AIP",
      "description": "This field contains a number that uniquely identifies the information represented by this segment in this transaction for the purposes of addition, change or deletion.",
      "length": "4",
      "data_type": "SI - Sequence ID",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "10": {
      "field_id": "AIP.10",
      "name": "Duration Units",
      "description": "This field contains a code describing the units of time used associated with AIP-9-Duration. This field should be valued according to the recommendations made in Chapters 2 and 7. If this field is not valued, the ISO base unit of seconds (code s) will be assumed. Refer to Chapter 7, Figures 7-6 through 7-9, for a list of ISO and ANSI+ unit codes.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "11": {
      "field_id": "AIP.11",
      "name": "Allow Substitution Code",
      "description": "This field contains a code indicating whether the identified personnel resource can be replaced with an equivalent substitute personnel resource by the filler application. Refer to User-defined Table 0279 - Allow substitution codes for suggested codes.",
      "length": "10",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "12": {
      "field_id": "AIP.12",
      "name": "Filler Status Code",
      "description": "This field contains a code that describes the requested/scheduled status of the personnel resource, from the point of view of the filler application. Refer to User-defined Table 0278 - Filler status code s for suggested codes.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "AIP.2",
      "name": "Segment Action Code",
      "description": "This field contains the action to be taken when updating or modifying information in this segment from previously sent interface transactions. Refer to HL7 Table 0206 - Segment action code in Chapter 2, Section 2.15.4.2, Action code/unique identifier mode update definition, for valid values.",
      "length": "3",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "AIP.3",
      "name": "Personnel Resource ID",
      "description": "This field contains the ID number and name of the person being requested or scheduled for an appointment. This field is used to identify a specific person being requested, or a specific person who has been scheduled as a resource for an appointment. If the specific person is not known, but the type of resource is, AIP-4-Resource role is used to identify the type of personnel resource required or scheduled. Refer to Chapter 2, Section 2.9.52, XCN - extended composite ID number and name for persons, for a description of the components contained in the XCN data type.",
      "length": "250",
      "data_type": "XCN - Extended Composite ID Number And Name For Persons",
      "optionality": "Conditional",
      "repeatability": "Repeatable indefinitely"
    },
    "4": {
      "field_id": "AIP.4",
      "name": "Resource Role",
      "description": "This field identifies the role of the personnel requested/scheduled for an appointment. For requests, if a specific person is not identified in the AIP-3-Personnel resource ID field, then this field identifies the type of person that should be scheduled by the filler application. At a minimum, the AIP-4-Resource role component should be valued.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "AIP.5",
      "name": "Resource Group",
      "description": "This field identifies the requested resource as a member of the indicated group. If, in a Schedule Request Message (SRM), no specific resource is requested, but an AIP-4-Resource role is requested, the AIP-5-Resource group field can be used to further qualify the type of resource being requested.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "6": {
      "field_id": "AIP.6",
      "name": "Start Date/Time",
      "description": "This field contains the date and time this service needs for the appointment. This field allows the application to identify that the service is required for the appointment at a different time than the appointments start date/time.",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "7": {
      "field_id": "AIP.7",
      "name": "Start Date/Time Offset",
      "description": "This field contains the offset this resource needs for the appointment, expressed in units of time relative to the scheduled start date/time. This field indicates to the application that the resource is required for the appointment at a different time than the appointments start date/time. The first component contains the offset amount. An offset of zero (0), or an unvalued field, indicates that the resource is required at the start date/time of the appointment.",
      "length": "20",
      "data_type": "NM - Numeric",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "8": {
      "field_id": "AIP.8",
      "name": "Start Date/Time Offset Units",
      "description": "This field contains a code describing the units of time used for expressing AIP-7-Start date/time offset. This field should be valued according to the recommendations made in Chapters 2 and 7. If this field is not valued, the ISO base unit of seconds (code s) is assumed. Refer to Chapter 7, Figures 7-6 through 7-9, for a list of ISO and ANSI+ unit codes.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "9": {
      "field_id": "AIP.9",
      "name": "Duration",
      "description": "This field contains the duration for which the resource is requested/scheduled for an appointment, if different from the overall duration of the requested/scheduled appointment. This field indicates to the application that a resource is required for a different amount of time than the appointments overall duration. An unvalued duration indicates that the resource is required from its start date/time offset (specified in the previous two fields) until the end of the appointment. If no start date/time offset is specified, then the resource is required for the full duration of the appointment.",
      "length": "20",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    }
  }
}