{
  "segment_id": "DG1",
  "short_description": "Diagnosis",
  "description": "The DG1 segment contains patient diagnosis information of various types, for example, admitting, primary, etc. The DG1 segment is used to send multiple diagnoses (for example, for medical records encoding). It is also used when the FT1-19 - diagnosis code - FT1 does not provide sufficient information for a billing system. This diagnosis coding should be distinguished from the clinical problem segment used by caregivers to manage the patient (see Chapter 12, Patient Care). Coding methodologies are also defined.",
  "fields": {
    "1": {
      "field_id": "DG1.1",
      "name": "Set ID - DG1",
      "description": "This field contains the number that identifies this transaction. For the first occurrence of the segment the sequence number shall be 1, for the second occurrence it shall be 2, etc.",
      "length": "4",
      "data_type": "SI - Sequence ID",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "10": {
      "field_id": "DG1.10",
      "name": "DRG Grouper Review Code",
      "description": "This field has been retained for backward compatibility only. This field has moved to the new DRG segment. Refer to User-defined Table 0056 - DRG grouper review code for suggested values. This code indicates that the grouper results have been reviewed and approved.",
      "length": "2",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    },
    "11": {
      "field_id": "DG1.11",
      "name": "Outlier Type",
      "description": "This field has been retained for backward compatibility only. This field has moved to the new DRG segment. When used for backward compatibility, this field contains the type of outlier (i.e. period of care beyond DRG-standard stay in facility) that has been paid. Refer to User-defined Table 0083 - Outlier type for suggested values.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    },
    "12": {
      "field_id": "DG1.12",
      "name": "Outlier Days",
      "description": "This field has been retained for backward compatibility only. This field has moved to the new DRG segment. When used for backward compatibility, this field contains the number of days that have been approved for an outlier payment.",
      "length": "3",
      "data_type": "NM - Numeric",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    },
    "13": {
      "field_id": "DG1.13",
      "name": "Outlier Cost",
      "description": "This field has been retained for backward compatibility only. This field has moved to the new DRG segment. When used for backward compatibility, this field contains the amount of money that has been approved for an outlier payment.",
      "length": "12",
      "data_type": "CP - Composite Price",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    },
    "14": {
      "field_id": "DG1.14",
      "name": "Grouper Version And Type",
      "description": "This field has been retained for backward compatibility only. This field has moved to the new DRG segment; refer to the field definition in Section 6.5.3.1. When used for backward compatibility, this field contains the grouper version and type.",
      "length": "4",
      "data_type": "ST - String Data",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    },
    "15": {
      "field_id": "DG1.15",
      "name": "Diagnosis Priority",
      "description": "This field contains the number that identifies the significance or priority of the diagnosis code. Refer to User-defined Table 0359 - Diagnosis priority for suggested values.",
      "length": "2",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "16": {
      "field_id": "DG1.16",
      "name": "Diagnosing Clinician",
      "description": "This field contains the individual responsible for generating the diagnosis information. Multiple names and identifiers for the same person may be sent in this field, not multiple diagnosing clinicians. The legal name is assumed to be in the first repetition. When the legal name is not sent, a repeat delimiter must be sent first for the first repetition.",
      "length": "250",
      "data_type": "XCN - Extended Composite ID Number And Name For Persons",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "17": {
      "field_id": "DG1.17",
      "name": "Diagnosis Classification",
      "description": "This field indicates if the patient information is for a diagnosis or a non-diagnosis code. Refer to User-defined Table 0228 - Diagnosis classification for suggested values.",
      "length": "3",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "18": {
      "field_id": "DG1.18",
      "name": "Confidential Indicator",
      "description": "This field indicates whether the diagnosis is confidential. Refer to HL7 table 0136 - Yes/no indicator for valid values\n\n- Y the diagnosis is a confidential diagnosis\n- N the diagnosis does not contain a confidential diagnosis",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "19": {
      "field_id": "DG1.19",
      "name": "Attestation Date/Time",
      "description": "This field contains the time stamp that indicates the date and time that the attestation was signed.",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "DG1.2",
      "name": "Diagnosis Coding Method",
      "description": "This field has been retained for backward compatibility only. Use the components of DG1-3 diagnosis code-DG1 instead of this field. When used for backward compatibility, ICD9 is the recommended coding methodology. Refer to User-defined Table 0053 - Diagnosis coding method for suggested values.",
      "length": "2",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "DG1.3",
      "name": "Diagnosis Code - DG1",
      "description": "Use this field instead of DG1-2 - diagnosis coding method and DG1-4 - diagnosis description. (Those two fields have been retained for backward compatibility only.) DG1-3 - diagnosis code DG1 contains the diagnosis code assigned to this diagnosis. Refer to User-defined Table 0051 - Diagnosis code for suggested values. This field is a CE data type for compatibility with clinical and ancillary systems.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "4": {
      "field_id": "DG1.4",
      "name": "Diagnosis Description",
      "description": "This field has been retained for backward compatibility only. Use the components of DG1-3 diagnosis code-DG1 field instead of this field. When used for backward compatibility, DG1-4 - diagnosis description contains a description that best describes the diagnosis.",
      "length": "40",
      "data_type": "ST - String Data",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "DG1.5",
      "name": "Diagnosis Date/Time",
      "description": "This field contains the date/time that the diagnosis was determined.",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "6": {
      "field_id": "DG1.6",
      "name": "Diagnosis Type",
      "description": "This field contains a code that identifies the type of diagnosis being sent. Refer to Userdefined Table 0052 - Diagnosis type for suggested values. This field should no longer be used to indicate “DRG” because the DRG fields have moved to the new DRG segment.",
      "length": "2",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "7": {
      "field_id": "DG1.7",
      "name": "Major Diagnostic Category",
      "description": "This field has been retained for backward compatibility only. This field should only be used in a master file transaction. Refer to User-defined Table 0118 - Major diagnostic category for suggested values.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    },
    "8": {
      "field_id": "DG1.8",
      "name": "Diagnostic Related Group",
      "description": "This field has been retained for backward compatibility only. This field has moved to the new DRG segment. It contains the DRG for the transaction. Interim DRGs could be determined for an encounter. Refer to User-defined Table 0055 - Diagnosis Related Group for suggested values.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    },
    "9": {
      "field_id": "DG1.9",
      "name": "DRG Approval Indicator",
      "description": "This field has been retained for backward compatibility only. This field has moved to the new DRG segment. This field indicates if the DRG has been approved by a reviewing entity. Refer to HL7 table 0136 - Yes/no indicator for valid values.",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    }
  }
}