{
  "segment_id": "OM5",
  "short_description": "Observation Batteries (Sets)",
  "description": "This segment contains the information about batteries and supersets (a nature code of F, P or S, as described in OM1-18 - Nature of service/test/observation).\n\nThe Technical Steward for the OM5 segment is ORDERS.",
  "fields": {
    "1": {
      "field_id": "OM5.1",
      "name": "Sequence Number - Test/ Observation Master File",
      "description": "This field contains the same value as the sequence number of the associated OM1 segment.",
      "length": "4",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "OM5.2",
      "name": "Test/Observations Included within an Ordered Test Battery",
      "description": "This field contains the codes and names of all tests/observations included within a single battery (nature code P, as described in OM1-18 - Nature of service/test/observation ), a single functional procedure (nature code F), or a given superset (nature code S). When a segment includes a list of component elements, the sending system should be sure that the segments defining all of the components are sent before the segment that references them. An entry in this list can itself be a battery.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "3": {
      "field_id": "OM5.3",
      "name": "Observation ID Suffixes",
      "description": "This field contains the tests or procedures that produce a type which uses observation ID suffixes following the service/test/observation ID code. This field lists the possible options. The applicable three-character mnemonics given in ASTM Table 20 (or others appropriate to the application) are listed, separated by repeat delimiters. For example, a chest X-ray may use the suffixes IMP, REC, DEV, or others. Each of the expected suffixes should be listed here.",
      "length": "250",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    }
  }
}