{
  "segment_id": "PID",
  "short_description": "Patient identification",
  "description": "The PID segment is used by all applications as the primary means of communicating patient identification information. This segment contains permanent patient identifying and demographic information that, for the most part, is not likely to change frequently.",
  "fields": {
    "1": {
      "field_id": "PID.1",
      "name": "Set ID - PID",
      "description": "This field contains the number that identifies this transaction. For the first occurrence of the segment, the sequence number shall be one, for the second occurrence, the sequence number shall be two, etc.",
      "length": "4",
      "data_type": "SI - Sequence ID",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "10": {
      "field_id": "PID.10",
      "name": "Race",
      "description": "No description found.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "11": {
      "field_id": "PID.11",
      "name": "Patient Address",
      "description": "This field contains the mailing address of the patient. Address type codes are defined by HL7 Table 0190 - Address type. Multiple addresses for the same person may be sent in the following sequence: The primary mailing address must be sent first in the sequence (for backward compatibility); if the mailing address is not sent, then a repeat delimiter must be sent in the first sequence.",
      "length": "250",
      "data_type": "XAD - Extended Address",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "12": {
      "field_id": "PID.12",
      "name": "County Code",
      "description": "This field has been retained for backward compatibility. This field contains the patients county code. The county can now be supported in the county/parish code component of the XAD data type ( PID-11 - Patient Address ). Refer to User-defined Table 0289 - County/parish for suggested values",
      "length": "4",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    },
    "13": {
      "field_id": "PID.13",
      "name": "Phone Number - Home",
      "description": "This field contains the patients personal phone numbers. All personal phone numbers for the patient are sent in the following sequence. The first sequence is considered the primary number (for backward compatibility). If the primary number is not sent, then a repeat delimiter is sent in the first sequence. Refer to HL7 Table 0201 - Telecommunication use code and HL7 Table 0202 - Telecommunication equipment type for valid values.",
      "length": "250",
      "data_type": "XTN - Extended Telecommunication Number",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "14": {
      "field_id": "PID.14",
      "name": "Phone Number - Business",
      "description": "This field contains the patients business telephone numbers. All business numbers for the patient are sent in the following sequence. The first sequence is considered the patients primary business phone number (for backward compatibility). If the primary business phone number is not sent, then a repeat delimiter must be sent in the first sequence. Refer to HL7 Table 0201 - Telecommunication use code and HL7 Table 0202 - Telecommunication equipment type for valid values.",
      "length": "250",
      "data_type": "XTN - Extended Telecommunication Number",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "15": {
      "field_id": "PID.15",
      "name": "Primary Language",
      "description": "This field contains the patients primary language. HL7 recommends using ISO table 639 as the suggested values in User-defined Table 0296 - Primary Language.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "16": {
      "field_id": "PID.16",
      "name": "Marital Status",
      "description": "This field contains the patients marital (civil) status. Refer to User-defined Table 0002 - Marital status for suggested values.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "17": {
      "field_id": "PID.17",
      "name": "Religion",
      "description": "This field contains the patients religion, for example, Baptist, Catholic, Methodist, etc. Refer to User-defined Table 0006 - Religion for suggested values.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "18": {
      "field_id": "PID.18",
      "name": "Patient Account Number",
      "description": "This field contains the patient account number assigned by accounting to which all charges, payments, etc., are recorded. It is used to identify the patients account. Refer to HL7 Table 0061 - Check digit scheme for valid values.",
      "length": "250",
      "data_type": "CX - Extended Composite ID With Check Digit",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "19": {
      "field_id": "PID.19",
      "name": "SSN Number - Patient",
      "description": "This field has been retained for backward compatibility only. It is recommended to use PID-3 - Patient Identifier List for all patient identifiers. However, in order to maintain backward compatibility, this field should also be populated. When used for backward compatibility, this field contains the patients social security number. This number may also be a RR retirement number.",
      "length": "16",
      "data_type": "ST - String Data",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "PID.2",
      "name": "Patient ID",
      "description": "This field has been retained for backward compatibility only. The arbitrary term of \"external ID\" has been removed from the name of this field. The repetition, assigning authority, healthcare facility, and identifier type code attributes of PID-3 - patient identifier list allow for distinctive identifier representation. This field remains for systems with a negotiated understanding of \"external.\" It is recommended to use PID-3 - patient identifier list for all patient identifiers.",
      "length": "20",
      "data_type": "CX - Extended Composite ID With Check Digit",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    },
    "20": {
      "field_id": "PID.20",
      "name": "Driver's License Number - Patient",
      "description": "This field contains the patients drivers license number. Some sites may use this number as a unique identifier of the patient. The default of the second component is the state in which the patients license is registered.",
      "length": "25",
      "data_type": "DLN - Driver's License Number",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "21": {
      "field_id": "PID.21",
      "name": "Mother's Identifier",
      "description": "This field is used, for example, as a link field for newborns. Typically a patient ID or account number may be used. This field can contain multiple identifiers for the same mother. Refer to HL7 Table 0061 - Check digit scheme for valid values.",
      "length": "250",
      "data_type": "CX - Extended Composite ID With Check Digit",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "22": {
      "field_id": "PID.22",
      "name": "Ethnic Group",
      "description": "This field further defines the patients ancestry. Refer to User-defined Table 0189 - Ethnic group for suggested values. The second triplet of the CE data type for ethnic group (alternate identifier, alternate text, and name of alternate coding system) is reserved for governmentally assigned codes. In the US, a current use is to report ethnicity in line with US federal standards for Hispanic origin.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "23": {
      "field_id": "PID.23",
      "name": "Birth Place",
      "description": "This field indicates the location of the patients birth, for example \"St. Francis Community Hospital of Lower South Side\". The actual address is reported in PID-11 with an identifier of \"N\".",
      "length": "250",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "24": {
      "field_id": "PID.24",
      "name": "Multiple Birth Indicator",
      "description": "This field indicates whether the patient was part of a multiple birth. Refer to HL7 Table 0136 - Yes/No Indicator for valid values.",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "25": {
      "field_id": "PID.25",
      "name": "Birth Order",
      "description": "When a patient was part of a multiple birth, a value (number) indicating the patients birth order is entered in this field.",
      "length": "2",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "26": {
      "field_id": "PID.26",
      "name": "Citizenship",
      "description": "This field contains the patients country of citizenship. HL7 recommends using ISO table 3166 as the suggested values in User-defined Table 0171 - Citizenship.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "27": {
      "field_id": "PID.27",
      "name": "Veterans Military Status",
      "description": "This field contains the military status assigned to a veteran. Refer to User-defined Table 0172 - Veterans military status for suggested values.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "28": {
      "field_id": "PID.28",
      "name": "Nationality",
      "description": "From V2.4 onward, this field has been retained for backward compatibility only. It is recommended to refer to PID-10 - Race , PID-22 - Ethnic group and PID-26 - Citizenship. This field contains a code that identifies the nation or national grouping to which the person belongs. This information may be different from a persons citizenship in countries in which multiple nationalities are recognized (for example, Spain: Basque, Catalan, etc.).",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    },
    "29": {
      "field_id": "PID.29",
      "name": "Patient Death Date and Time",
      "description": "This field contains the date and time at which the patient death occurred.",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "PID.3",
      "name": "Patient Identifier List",
      "description": "This field contains the list of identifiers (one or more) used by the healthcare facility to uniquely identify a patient (e.g., medical record number, billing number, birth registry, national unique individual identifier, etc.). In Canada, the Canadian Provincial Healthcare Number should be sent in this field. Refer to HL7 Table 0061 - Check digit scheme for valid values. The arbitrary term of \"internal ID\" has been removed from the name of this field for clarity. Refer also to HL7 Table 0203 - Identifier type and User-defined Table 0363 - Assigning authority for valid values.",
      "length": "250",
      "data_type": "CX - Extended Composite ID With Check Digit",
      "optionality": "Required",
      "repeatability": "Repeatable indefinitely"
    },
    "30": {
      "field_id": "PID.30",
      "name": "Patient Death Indicator",
      "description": "This field indicates whether the patient is deceased. Refer to HL7 Table 0136 - Yes/no indicator for valid values.",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "31": {
      "field_id": "PID.31",
      "name": "Identity Unknown Indicator",
      "description": "This field indicates whether or not the patients/persons identity is known. Refer to HL7 Table 0136 - Yes/no indicatorfor suggested values.",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "32": {
      "field_id": "PID.32",
      "name": "Identity Reliability Code",
      "description": "This field contains a coded value used to communicate information regarding the reliability of patient/person identifying data transmitted via a transaction. Values could indicate that certain fields on a PID segment for a given patient/person are known to be false (e.g., use of default or system-generated values for Date of Birth or Social Security Number. Refer to User-defined Table 0445 - Identity reliability code for suggested values.",
      "length": "20",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "33": {
      "field_id": "PID.33",
      "name": "Last Update Date/Time",
      "description": "This field contains the last update date and time for the patients/persons identifying and demographic data, as defined in the PID segment. Receiving systems will use this field to determine how to apply the transaction to their systems. If the receiving system (such as an enterprise master patient index) already has a record for the person with a later last update date/time, then the EMPI could decide not to apply the patients/persons demographic and identifying data from this transaction.",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "34": {
      "field_id": "PID.34",
      "name": "Last Update Facility",
      "description": "This field identifies the facility of the last update to a patients/persons identifying and demographic data, as defined in the PID segment. Receiving systems or users will use this field to determine how to apply the transaction to their systems. If the receiving system (such as a hospitals patient management system) already has a record for the patient/person, then it may decide to only update its data if the source is a \"trusted\" source. A hospital might consider other hospitals trusted sources, but not \"trust\" updates from non-acute care facilities. For example:",
      "length": "40",
      "data_type": "HD - Hierarchic Designator",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "35": {
      "field_id": "PID.35",
      "name": "Species Code",
      "description": "The species of living organism. This may include the common or scientific name, based on the coding system(s) used. SNOMED is the recommended coding system. If this field is not valued, a human is assumed. Refer to User-defined Table 0446 - Species Code for suggested values.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "36": {
      "field_id": "PID.36",
      "name": "Breed Code",
      "description": "The specific breed of animal. This field, unlike Species and Strain is specific to animals and cannot be generally used for all living organisms. SNOMED is the recommended coding system. Refer to User-defined Table 0447 - Breed Code for suggested values.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "37": {
      "field_id": "PID.37",
      "name": "Strain",
      "description": "This field contains the specific strain of animal. It can also be expanded to include strain of any living organism and is not restricted to animals.",
      "length": "80",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "38": {
      "field_id": "PID.38",
      "name": "Production Class Code",
      "description": "This field contains the code and/or text indicating the primary use for which the living subject was bred or grown. Refer to User-defined Table 0429 - Production Class Code for suggested values. For example:",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "4": {
      "field_id": "PID.4",
      "name": "Alternate Patient ID - PID",
      "description": "This field has been retained for backward compatibility only. It is recommended to use PID-3 - patient identifier list for all patient identifiers. When used for backward compatibility, this field contains the alternate, temporary, or pending optional patient identifier to be used if needed - or additional numbers that may be required to identify a patient. This field may be used to convey multiple patient IDs when more than one exist for a patient. Possible contents might include a visit number, a visit date, or a Social Security Number.",
      "length": "20",
      "data_type": "CX - Extended Composite ID With Check Digit",
      "optionality": "Backward Compatibility",
      "repeatability": "Repeatable indefinitely"
    },
    "5": {
      "field_id": "PID.5",
      "name": "Patient Name",
      "description": "This field contains the names of the patient, the primary or legal name of the patient is reported first. Therefore, the name type code in this field should be \"L - Legal\". Refer to HL7 Table 0200 - Name type for valid values. Repetition of this field is allowed for representing the same name in different character sets. Note that \"last name prefix\" is synonymous to \"own family name prefix\" of previous versions of HL7, as is \"second and further given names or initials thereof\" to \"middle initial or name\". Multiple given names and/or initials are separated by spaces.",
      "length": "250",
      "data_type": "XPN - Extended Person Name",
      "optionality": "Required",
      "repeatability": "Repeatable indefinitely"
    },
    "6": {
      "field_id": "PID.6",
      "name": "Mother's Maiden Name",
      "description": "This field contains the family name under which the mother was born (i.e., before marriage). It is used to distinguish between patients with the same last name.",
      "length": "250",
      "data_type": "XPN - Extended Person Name",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "7": {
      "field_id": "PID.7",
      "name": "Date/Time Of Birth",
      "description": "This field contains the patients date and time of birth.",
      "length": "26",
      "data_type": "TS - Time Stamp",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "8": {
      "field_id": "PID.8",
      "name": "Administrative Sex",
      "description": "This field contains the patients sex. Refer to User-defined Table 0001 - Administrative sex for suggested values.",
      "length": "1",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "9": {
      "field_id": "PID.9",
      "name": "Patient Alias",
      "description": "This field has been retained for backward compatibility only. It is recommended to use PID-5 - patient name for all patient names. This field contained the name(s) by which the patient has been known at some time. Refer to HL7 Table 0200 - Name type for valid values.",
      "length": "250",
      "data_type": "XPN - Extended Person Name",
      "optionality": "Backward Compatibility",
      "repeatability": "Repeatable indefinitely"
    }
  }
}