{
  "segment_id": "PRA",
  "short_description": "Practitioner Detail",
  "description": "The PRA segment adds detailed medical practitioner information to the personnel identified by the STF segment. A PRA segment may optionally follow an STF segment. A PRA segment must always have been preceded by a corresponding STF segment. The PRA segment may also be used for staff who work in healthcare who are not practitioners, but need to be certified, e.g., “medical records staff.”\n\nThe Technical Steward for the PRA segment is PAFM and Personnel Management",
  "fields": {
    "1": {
      "field_id": "PRA.1",
      "name": "Primary Key Value - PRA",
      "description": "For MFN Master File Notification, this field is required and must match MFE-4-primary key value, to identify which entry is being referenced. For all other messages, this field should not be used",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "10": {
      "field_id": "PRA.10",
      "name": "Date Left Practice",
      "description": "This field contains the date the practitioner ended or intends to end practicing at the given institution (e.g., at hospital, at physician organization, at managed care network).",
      "length": "8",
      "data_type": "DT - Date",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "11": {
      "field_id": "PRA.11",
      "name": "Government Reimbursement Billing Eligibility",
      "description": "This field contains a code that indicates the agency that the practitioner is authorized to bill for medical services. Refer to User-defined Table 0401 - Government reimbursement program for valid values. This is a repeating field",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "12": {
      "field_id": "PRA.12",
      "name": "Set ID - PRA",
      "description": "For all messages except the Staff/Practitioner Master File Notification, this field is required and contains the number that identifies this transaction. For the first occurrence of the segment, the sequence number shall be one, for the second occurrence, the sequence number shall be two, etc. For the Staff/Practitioner Master File Notification message, this field should not be used",
      "length": "60",
      "data_type": "SI - Sequence ID",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "PRA.2",
      "name": "Practitioner Group",
      "description": "This field contains the name and/or code of a group of practitioners to which this practitioner belongs. Refer to User-defined Table 0358 Practitioner group for suggested values",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "3": {
      "field_id": "PRA.3",
      "name": "Practitioner Category",
      "description": "This field contains the category of practitioner. Refer to User-defined Table 0186 Practitioner category for suggested values. Values may include codes for staff physician, courtesy physician, resident, physician assistant, physical therapist, psychiatrist, psychologist, pharmacist, registered nurse, licensed practical nurse, licensed vocational nurse, nurse practitioner, etc. If the provider works in different Practitioner Categories in different organization units, then this information should be recorded separately in ORG-6,7,8",
      "length": "3",
      "data_type": "IS - Coded value for user-defined tables",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "4": {
      "field_id": "PRA.4",
      "name": "Provider Billing",
      "description": "This field indicates how provider services are billed. Refer to HL7 Table 0187 - Provider billing for valid values",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "PRA.5",
      "name": "Specialty",
      "description": "This repeating field is made up of multiple components to record the practitioner’s specialties. The multiple components of each specialty are: (1) specialty name or abbreviation, identifies provider’s specialty, (2) name of specialty governing board, (3) Certification Status, (4) certified date contains the date of certification, if certified. Refer to HL7 Table 0337 – Certification status for valid values",
      "length": "100",
      "data_type": "SPD - Specialty",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "6": {
      "field_id": "PRA.6",
      "name": "Practitioner ID Numbers",
      "description": "This repeating field contains this practitioner’s license numbers and other ID numbers. This is a field made up of the following components: (1) the ID number, and (2) the type of number, and optionally (3) the state or province in which it is valid, if relevant, or other qualifying information. It is recommended that state qualifications use the abbreviations from the postal service of the country. The practitioner ID number type (component 2) is a user-defined table (Table 0338).",
      "length": "100",
      "data_type": "PLN - Practitioner ID Numbers",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "7": {
      "field_id": "PRA.7",
      "name": "Privileges",
      "description": "This field contains the institutional privileges which this provider may exercise. Depends upon institutional needs. For example, admit, transfer, discharge, place orders, verify orders, review results, etc. Can also be used for privileges other than patient services. This is a repeating field, with each privilege made up of the following components: (1) privilege; (2) privilege class; (3) privilege expiration date, if any; (4) privilege activation date, if any, and (5) facility. Note that the privilege and privilege class components are CE data types, and thus they are encoded with the subcomponent delimiter (&) rather than the component delimiter (^). The facility component is an EI data type specifying the facility to which the privilege applies and is encoded with the subcomponent delimiter (&) rather than the component delimiter (^). The facility component is an EI data type specifying the facility to which the privilege applies and is encoded with the subcomponent delimiter (&) rather than the component delimiter (^).",
      "length": "200",
      "data_type": "PIP - Privileges",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "8": {
      "field_id": "PRA.8",
      "name": "Date Entered Practice",
      "description": "This field contains the date the practitioner began practicing at the present institution (e.g., at hospital, at physician organization, at managed care network).",
      "length": "8",
      "data_type": "DT - Date",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "9": {
      "field_id": "PRA.9",
      "name": "Institution",
      "description": "This field contains the institution the practitioner began or intends to begin practicing at (e.g., at hospital, at physician organization, at managed care network).",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    }
  }
}