{
  "segment_id": "RXC",
  "short_description": "Pharmacy/Treatment Component Order",
  "description": "If the drug or treatment ordered with the RXO segment is a compound drug OR an IV solution, AND there is not a coded value for OBR-4-universal service ID , which specifies the components (base and all additives), then the components (the base and additives) are specified by two or more RXC segments. The policy of the pharmacy or treatment application on substitutions at the RXC level is identical to that for the RXO level.",
  "fields": {
    "1": {
      "field_id": "RXC.1",
      "name": "RX Component Type",
      "description": "Following are the values for this field : HL7 Table 0166 - RX component type",
      "length": "1",
      "data_type": "ID - Coded values for HL7 tables",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "RXC.2",
      "name": "Component Code",
      "description": "This field is equivalent to OBR-4-universal service ID. It defines the base or component in the same manner as the give and dispense codes. As with the give and dispense codes, it may contain text only, code only, text + code, or text + code + units (implied or explicit). As with the give and dispense codes, if RXC-4-component units is present, this overrides the units implied by the code. If only text is present, the pharmacy or treatment application must include a manual review or reentering of the component drug or treatment.",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "RXC.3",
      "name": "Component Amount",
      "description": "This field identifies the amount of this component to be added to the specified amount of the base.",
      "length": "20",
      "data_type": "NM - Numeric",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "4": {
      "field_id": "RXC.4",
      "name": "Component Units",
      "description": "This field identifies the units for the component amount. If present, this overrides the units implied by RXC-2-component code. This must be in simple units that reflect the actual quantity of the component being added. It does not include compound units",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "RXC.5",
      "name": "Component Strength",
      "description": "Use when RXC-2-component code does not specify the strength. This is the numeric part of the strength, used in combination with RXC-6-component strength units",
      "length": "20",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "6": {
      "field_id": "RXC.6",
      "name": "Component Strength Units",
      "description": "Use when RXC-2-component code does not specify the strength. This is the unit of the strength, used in combination with RXC-5-component strength",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "7": {
      "field_id": "RXC.7",
      "name": "Supplementary Code",
      "description": "This field accommodates the identification of any codes that might be associated with the pharmaceutical or other treatment substance. Common codes include: the Generic Product Identifier (GPI), Generic Code Number_Sequence Number (GCN_SEQNO), National Drug Code (NDC).",
      "length": "250",
      "data_type": "CE - Coded Element",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    }
  }
}