{
  "segment_id": "APR",
  "short_description": "Appointment Preferences",
  "description": "The APR segment contains parameters and preference specifications used for requesting appointments in the SRM message. It allows placer applications to provide coded parameters and preference indicators to the filler application, to help determine when a requested appointment should be scheduled. An APR segment can be provided in conjunction with either the ARQ segment or any of the service and resource segments (AIG, AIS, AIP, and AIL). If an APR segment appears in conjunction with an ARQ segment, its parameters and preference indicators pertain to the schedule request as a whole. If the APR segment appears with any of the service and resource segments, then its parameters and preferences apply only to the immediately preceding service or resource.",
  "fields": {
    "1": {
      "field_id": "APR.1",
      "name": "Time Selection Criteria",
      "description": "This field is used to communicate parameters and preferences to the filler application regarding the selection of an appropriate time slot for an appointment. The first component of this field is a code identifying the parameter or preference being passed to the filler application. The second component is the actual data value for that parameter.\n\nFor example, if a filler application allows preference parameters to be passed to specify a preferred start time, a preferred end time, and preferred days of the week for the appointment, it may define the parameter class codes and valid data sets based on suggested codes from User-defined Table 0294 - Time Selection Criteria Parameter Class Codes in Chapter 2C, Code Tables, for suggested values.\n\nGiven the set of parameter class codes and valid value sets from User-Defined table 0294, a placer may indicate a preferred start time of 8:00 AM on Monday, Wednesday or Friday by specifying the following in APR-1 Time Selection Criteria:\n...|PREFSTART^0800~MON^OK~WED^OK~FRI^OK~TUE^NO~THU^NO~SAT^NO~SUN^NO|...\n\nThe valid set of preferences should be determined by the placer and filler applications during implementation of the interface.",
      "length": "0",
      "data_type": "SCV - Scheduling Class Value Pair",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "2": {
      "field_id": "APR.2",
      "name": "Resource Selection Criteria",
      "description": "This field is used to communicate parameters and preferences to the filler application regarding the selection of an appropriate resource for an appointment. The first component of this field is a code identifying the parameter or preference being passed to the filler application. The second component is the actual data value for that parameter.\n\nRefer to Section 10.6.8.1, \"APR-1 Time Selection Criteria (SCV) 00908,\" for an example illustrating how this mechanism works within an interface.\n\nThe valid set of preferences should be determined by the placer and filler applications during implementation of the interface. Refer to User-defined Table 0294 - Time Selection Criteria Parameter Class Codes in Chapter 2C, Code Tables, for suggested examples.",
      "length": "0",
      "data_type": "SCV - Scheduling Class Value Pair",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "3": {
      "field_id": "APR.3",
      "name": "Location Selection Criteria",
      "description": "This field is used to communicate parameters and preferences to the filler application regarding the selection of an appropriate location for the appointment. The first component of this field is a code identifying the parameter or preference being passed to the filler application. The second component is the actual data value for that parameter.\n\nRefer to Section 10.6.8.1, \"APR-1 Time Selection Criteria (SCV) 00908,\" for an example illustrating how this mechanism works within an interface.\n\nThe valid set of preferences should be determined by the placer and filler applications during implementation of the interface. Refer to User-defined Table 0294 - Time Selection Criteria Parameter Class Codes in Chapter 2C, Code Tables, for suggested examples.",
      "length": "0",
      "data_type": "SCV - Scheduling Class Value Pair",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "4": {
      "field_id": "APR.4",
      "name": "Slot Spacing Criteria",
      "description": "This field is used in queries returning lists of possible appointment slots, or other lists of slots. If the filler application allows it, the querying application may indicate the spacing of the slots returned to the querying application, in relation to the requested start date/time in the ARQ segment. The value in this field should be a positive integer, representing the number of minutes between slot starting times that is returned in the query.\n\nFor example, if there is a request that an appointment with a duration of 1.5 hours be scheduled some time between 9:00 AM and 11:30 AM, and the APR-4 Slot Spacing Criteria field contains a value of 15, then the list of slots returned should read as follows:\n9:00 - 10:30\n9:15 - 10:45\n9:30 - 11:00\n9:45 - 11:15\n10:00 - 11:30",
      "length": "0",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "APR.5",
      "name": "Filler Override Criteria",
      "description": "This field is used to communicate override parameters to the filler application. These override parameters allow placer applications to override specific features of filler applications such as conflict checking. It is assumed that the placer and filler applications will pass enough information to determine whether the requestor is allowed to override such features. This chapter does not provide any security or permission information.\nThe first component of this field is a code identifying the parameter being passed to the filler application. The second component is the actual data value for that parameter.\n\nRefer to Section 10.6.8.1, \"APR-1 Time Selection Criteria (SCV) 00908,\" for an example illustrating how this mechanism works within an interface.\n\nThe valid set of parameters should be determined by the placer and filler applications during implementation of the interface.",
      "length": "0",
      "data_type": "SCV - Scheduling Class Value Pair",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    }
  }
}