{
  "segment_id": "ARV",
  "short_description": "Access Restriction",
  "description": "The ARV segment is used to communicate the requested/required type of access restrictions from system to system, at both the person/patient and the encounter/visit level.\n\nExamples:\nA person/patient may have the right to object to any or all of his/her information to be disclosed. In addition, the patient may request that protected information not be disclosed to family members or friends who may be involved in their care or for notification purposes.\n\nA realm or organization may have certain privacy policies.\n\nA patient may have the right to opt out of being included on facility directories.\nIn an international context, a physician may be culturally obligated to protect the patient's privacy.\n\nAny \"opt-in\" or \"opt-out\" restrictions are communicated in ARV-3 - Access Restriction Value. This segment replaces PD1-12 and PV2-22, which have been deprecated in V2.6. The ARV segment is optional and is sent after the PID/PD1 segments to describe access restrictions associated with the person/patient. The ARV segment is optional and is sent after the PV1/PV2 segments to describe access restrictions associated with that specific encounter.\n\nUsage Notes:\n\nThe individual system security may want to utilize the Access Restriction Value along with the Access Restriction Reason (and/or with the Confidentiality Code from another segment, e.g., OM1-30 or other data) in order to implement the appropriate type of protection for the person, patient, visit and/or visit data. Each system has the flexibility to incorporate/map the access values into their security system appropriately; the actual implementation for access to protected data is determined by the individual system. The Access Restriction Values supported by an enterprise/system would be defined and determined by that organization.\n\nIt is expected that these access restriction values would be utilized in combination with other system security information (e.g., patient locations, user department, caregiver-patient relationships, other access restriction parameters) to determine user access.\n\nSystem implementers should carefully control access to the restriction codes and values, as they themselves hold sensitive information.",
  "fields": {
    "1": {
      "field_id": "ARV.1",
      "name": "Set Id",
      "description": "This field contains the number that identifies this segment. For the first occurrence of the segment, the sequence number shall be one, for the second occurrence, the sequence number shall be two, etc.",
      "length": "4",
      "data_type": "SI - Sequence Id",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "ARV.2",
      "name": "Access Restriction Action Code",
      "description": "This field contains a code defining the action to be taken for this segment. It allows access restriction information to be sent to delete or update previously sent access restrictions. Refer to HL7 Table 0206 - Segment Action Code for suggested values.",
      "length": "0",
      "data_type": "CNE - Coded With No Exceptions",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "ARV.3",
      "name": "Access Restriction Value",
      "description": "This field specifies the information to which access is restricted. This access may be restricted at a field level by employing the specific HL7 field identifiers or may be otherwise determined by user-defined coded values. Refer to User-defined Table 0717 – Access Restriction Value for suggested values.",
      "length": "0",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "4": {
      "field_id": "ARV.4",
      "name": "Access Restriction Reason",
      "description": "This field is used to convey the reason for the restricted access. Repeat of the Access Restriction Reason is allowed to accommodate communication of multiple reasons for an access restriction. Refer to User-defined Table 0719 – Access Restriction Reason Code for suggested values.",
      "length": "0",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "5": {
      "field_id": "ARV.5",
      "name": "Special Access Restriction Instructions",
      "description": "Used to convey specific instructions about the protection of the patient's data (e.g., \"Always refer to the patient as Mr. Everyman\"). This field may also be used to specify instructions about the release of information to family and friends (e.g., \"Do not release information to patient's brother, Adam Everyman\"). These instructions may be in conjunction with other fields (as elected by the system).",
      "length": "0",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "6": {
      "field_id": "ARV.6",
      "name": "Access Restriction Date Range",
      "description": "This element defines the date from which an access restriction commences until the date it is specifically rescinded.",
      "length": "0",
      "data_type": "DR - Date/time Range",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    }
  }
}