{
  "segment_id": "BPO",
  "short_description": "Blood Product Order",
  "description": "Blood product order messages require additional information that is not available in other standard HL7 order messages. Blood product order messages need to contain accompanying details regarding the blood product component, such as special processing requirements (e.g., irradiation and leukoreduction) and the amount of the blood product to be administered.",
  "fields": {
    "1": {
      "field_id": "BPO.1",
      "name": "Set Id - Bpo",
      "description": "This field contains the sequence number for the BPO segment within the message. For the first order transmitted, the sequence number shall be 1; for the second order, it shall be 2; and so on.",
      "length": "4",
      "data_type": "SI - Sequence Id",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "10": {
      "field_id": "BPO.10",
      "name": "Bp Requested Dispense Date/Time",
      "description": "This field specifies the date/time that the requested blood products must be ready to dispense. This date/time may be different from the intended use date/time. For example, the patient may be scheduled to come in for a transfusion at a specified time. However, the placer would request that the blood product be ready to dispense prior to that time in order to have the blood component ready for transfusion at the scheduled time. The field may also be used to indicate that the placer is now ready to pick up the ordered blood product and is requesting the blood product be ready to dispense at that time.",
      "length": "0",
      "data_type": "DTM - Date/time",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "11": {
      "field_id": "BPO.11",
      "name": "Bp Requested Dispense To Location",
      "description": "This field contains the inpatient or outpatient location to which the blood component is to be dispensed. The default dispense to location is the current census location for the patient.",
      "length": "0",
      "data_type": "PL - Person Location",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "12": {
      "field_id": "BPO.12",
      "name": "Bp Requested Dispense To Address",
      "description": "This field contains the actual address of the location to which the blood component is to be dispensed. The default dispense to location is the current census location for the patient.",
      "length": "0",
      "data_type": "XAD - Extended Address",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "13": {
      "field_id": "BPO.13",
      "name": "Bp Indication For Use",
      "description": "This is a coded optional field. The value indicates the reason that the blood product was ordered. This information is helpful for prospective review or retrospective studies of blood product ordering practices of the ordering provider by the Quality Assurance Department and/or Transfusion Committee. Refer to User-Defined Table 0509 - Indication for Use for suggested values.",
      "length": "0",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "14": {
      "field_id": "BPO.14",
      "name": "Bp Informed Consent Indicator",
      "description": "This field indicates whether consent for the transfusion has been obtained. Refer to HL7 table 0136 -Yes/No indicator as defined in Chapter 2.",
      "length": "1",
      "data_type": "ID - Coded Value For Hl7 Defined Tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "BPO.2",
      "name": "Bp Universal Service Identifier",
      "description": "This field contains the identifier code for the requested blood product. This can be based on local and/or \"universal\" codes. We recommend the \"universal\" procedure identifier. The structure of this CWE data type is described in the control section. The preferred coding system is the ISBT 128 Product Code.\n\nBlood Product Orders for commercial products, such as Rh Immune Globulin or Factor VIII concentrate, are not at this time defined in an international or national coding system as are blood products. Therefore, locally defined codes can be used for the Universal Service Identifier for commercial products.",
      "length": "0",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "BPO.3",
      "name": "Bp Processing Requirements",
      "description": "This field contains additional information about the blood component class associated with the Universal Service ID. The placer of the order can specify any required processing of the blood product that must be completed prior to transfusion to the intended recipient. Refer to User-Defined Table 0508 - Blood Product Processing Requirements for suggested values.",
      "length": "0",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "4": {
      "field_id": "BPO.4",
      "name": "Bp Quantity",
      "description": "This field contains the number of blood products ordered.",
      "length": "0",
      "data_type": "NM - Numeric",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "BPO.5",
      "name": "Bp Amount",
      "description": "This field contains the ordered amount (volume) associated with each quantity of blood product.",
      "length": "0",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "6": {
      "field_id": "BPO.6",
      "name": "Bp Units",
      "description": "This field contains the units of measure for the blood product amount. (See Chapter 7 for more details about reporting units.) This field specifies the units of measure for volume of a blood component (i.e., 50 ml) or the units of measure or dosage of a commercial product (i.e., 910 I.U. - International Units - of Factor VIII Concentrate).",
      "length": "0",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "7": {
      "field_id": "BPO.7",
      "name": "Bp Intended Use Date/Time",
      "description": "This field specifies the date/time that the placer intends to use the blood product that is being ordered.\n\nThis is the time when the placer expects the product to be available within the transfusion service. For example, the product should be available for use, but not dispensed, on this date/time.",
      "length": "0",
      "data_type": "DTM - Date/time",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "8": {
      "field_id": "BPO.8",
      "name": "Bp Intended Dispense From Location",
      "description": "This field contains the location from which the blood component is to be dispensed.",
      "length": "0",
      "data_type": "PL - Person Location",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "9": {
      "field_id": "BPO.9",
      "name": "Bp Intended Dispense From Address",
      "description": "This field contains the actual address of the location from which the blood component is to be dispensed.",
      "length": "0",
      "data_type": "XAD - Extended Address",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    }
  }
}