{
  "segment_id": "MFA",
  "short_description": "Master File Acknowledgment",
  "description": "No description found.",
  "fields": {
    "1": {
      "field_id": "MFA.1",
      "name": "Record-level Event Code",
      "description": "A number or other identifier that uniquely identifies this change to this record from the point of view of the originating system. When returned to the originating system via the MFA segment, this field allows the target system to precisely identify which change to this record is being acknowledged. It is only required if the MFI response level code requires responses at the record level (any value other than NE).",
      "length": "3",
      "data_type": "ID - Coded Value For Hl7 Defined Tables",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "MFA.2",
      "name": "Mfn Control Id",
      "description": "An optional effective date/time can be included for the record-level action specified. It is the date/time the originating system expects that the event is to have been completed on the receiving system. If this field is not present, the effective date/time should default to the current date/time (when the message is received).",
      "length": "0",
      "data_type": "ST - String Data",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "MFA.3",
      "name": "Event Completion Date/Time",
      "description": "Refer to User-defined Table 0181 - MFN Record-level Error Return for suggested values. All such tables will have at least the following two return code values: \"S\" for successful and \"U\" for unsuccessful.\n\nThis field contains the status of the requested update. Site-defined table, specific to each master file being updated via this transaction.",
      "length": "0",
      "data_type": "DTM - Date/time",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "4": {
      "field_id": "MFA.4",
      "name": "Mfn Record Level Error Return",
      "description": "The repetition of the primary key permits the identification of an individual component of a complex record as the object of the record-level event code. This feature allows the Master Files protocol to be used for modifications of single components of complex records. If this field repeats, the field MFA-6 - Primary Key Value Type - MFA must also repeat (with the same number of repetitions), and the data type of each repetition of MFA-5 - Primary Key Value - MFA is specified by the corresponding repetition of MFA-6 - Value Type - MFA.\n\nThis field uniquely identifies the record of the master file (identified in the MFI segment) for which the update status is being acknowledged (as defined by the field MFN-4 - Record Level Error Return). The data type of this field is defined by the value of MFA-6 - Value Type - MFA, and may take on the format of any of the HL7 data types defined in HL7 Table 0355 - Primary Key Value Type. The PL data type is used only on location master transactions.",
      "length": "0",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "MFA.5",
      "name": "Primary Key Value - Mfa",
      "description": "This field contains the HL7 data type of MFA-5 - Primary Key Value - MFA. The valid HL7 data types are listed in HL7 Table 0355 - Primary Key Value Type.",
      "length": "0",
      "data_type": "varies - Varies",
      "optionality": "Required",
      "repeatability": "Repeatable indefinitely"
    },
    "6": {
      "field_id": "MFA.6",
      "name": "Primary Key Value Type - Mfa",
      "description": "No description found.",
      "length": "3",
      "data_type": "ID - Coded Value For Hl7 Defined Tables",
      "optionality": "Required",
      "repeatability": "Repeatable indefinitely"
    }
  }
}