{
  "segment_id": "MSH",
  "short_description": "Message Header",
  "description": "The MSH segment defines the intent, source, destination, and some specifics of the syntax of a message.",
  "fields": {
    "1": {
      "field_id": "MSH.1",
      "name": "Field Separator",
      "description": "This field contains the separator between the segment ID and the first real field, MSH-2 Encoding Characters. As such it serves as the separator and defines the character to be used as a separator for the rest of the message. Recommended value is | (ASCII 124).",
      "length": "1",
      "data_type": "ST - String Data",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "10": {
      "field_id": "MSH.10",
      "name": "Message Control Id",
      "description": "This field contains a number or other identifier that uniquely identifies the message. The receiving system echoes this ID back to the sending system in the Message acknowledgment segment (MSA).",
      "length": "199",
      "data_type": "ST - String Data",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "11": {
      "field_id": "MSH.11",
      "name": "Processing Id",
      "description": "This field is used to decide whether to process the message as defined in HL7 Application (level 7) Processing rules.",
      "length": "0",
      "data_type": "PT - Processing Type",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "12": {
      "field_id": "MSH.12",
      "name": "Version Id",
      "description": "This field is matched by the receiving system to its own version to be sure the message will be interpreted correctly. Beginning with Version 2.3.1, it has two additional \"internationalization\" components, for use by HL7 international affiliates. The <internationalization code> is CE data type (using the ISO country codes where appropriate) which represents the HL7 affiliate. The <internal version ID> is used if the HL7 Affiliate has more than a single 'local' version associated with a single US version. The <international version ID> has a CE data type, since the table values vary for each HL7 Affiliate. Refer to HL7 Table 0104 – Version ID for valid values.",
      "length": "0",
      "data_type": "VID - Version Identifier",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "13": {
      "field_id": "MSH.13",
      "name": "Sequence Number",
      "description": "A non-null value in this field implies that the sequence number protocol is in use. This numeric field is incremented by one for each subsequent value.",
      "length": "0",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "14": {
      "field_id": "MSH.14",
      "name": "Continuation Pointer",
      "description": "This field is used to define continuations in application-specific ways.",
      "length": "0",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "15": {
      "field_id": "MSH.15",
      "name": "Accept Acknowledgment Type",
      "description": "This field identifies the conditions under which accept acknowledgments are required to be returned in response to this message. Required for enhanced acknowledgment mode. Refer to HL7 Table 0155 - Accept/Application Acknowledgment Conditions for valid values.",
      "length": "2",
      "data_type": "ID - Coded Value For Hl7 Defined Tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "16": {
      "field_id": "MSH.16",
      "name": "Application Acknowledgment Type",
      "description": "This field contains the conditions under which application acknowledgments are required to be returned in response to this message. Required for enhanced acknowledgment mode. Refer to HL7 Table 0155 - Accept/Application Acknowledgment Conditions for valid values for MSH-15 Accept Acknowledgment Type and MSH-16 Application Acknowledgment Type.\n\nIf MSH-15-accept acknowledgment type and MSH-16-application acknowledgment type are omitted (or are both null), the original acknowledgment mode rules are used.",
      "length": "2",
      "data_type": "ID - Coded Value For Hl7 Defined Tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "17": {
      "field_id": "MSH.17",
      "name": "Country Code",
      "description": "This field contains the country of origin for the message. It will be used primarily to specify default elements, such as currency denominations. The values to be used are those of ISO 3166,.4. The ISO 3166 table has three separate forms of the country code: HL7 specifies that the 3-character (alphabetic) form be used for the country code.\n\nRefer to External Table 0399 - Country Code for the 3-character codes as defined by ISO 3166-1.",
      "length": "3",
      "data_type": "ID - Coded Value For Hl7 Defined Tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "18": {
      "field_id": "MSH.18",
      "name": "Character Set",
      "description": "This field contains the character set for the entire message. Refer to HL7 Table 0211 - Alternate Character Sets for valid values.\n\nAn HL7 message uses field MSH-18 Character Set to specify the character set(s) in use. Valid values for this field are specified in HL7 Table 0211 - Alternate Character Sets. MSH-18 Character Set may be left blank, or may contain one or more values delimited by the repetition separator. If the field is left blank, the character set in use is understood to be the 7-bit ASCII set, decimal 0 through decimal 127 (hex 00 through hex 7F). This default value may also be explicitly specified as ASCII.\n\nMore than one character set may be used in a message. The first occurrence, if supplied, of the MSH-18 must indicate the default encoding of the message. The second and subsequent occurrences of MSH-18-character set are used to specify additional character sets that are used.\nThe repetitions of this field to specify different character sets apply only to fields of the FT, ST and TX data types. See also section 2.7.2, \"Escape sequences supporting multiple character sets\".\n\nAny encoding system, single-byte or multi-byte, may be specified as the default character encoding in MSH-18 Character Set. If the default encoding is other than 7-bit ASCII, sites shall document this usage in the dynamic conformance profile or other implementation agreement. This is particularly effective in promoting interoperability between nations belonging to different HL7 Affiliates, while limiting the amount of testing required to determine the encoding of a message.\n\nBy using built-in language functions for string and character manipulation, parsers and applications need not be concerned whether a single or double byte character set is in use, provided it is applied to the entire message. Using a built in function to extract the fourth CHARACTER will always yield the field separator character, regardless of coding set. On the other hand, if the parser looks at the fourth BYTE, it is then limited to single byte character sets, since the fourth byte would contain the low order 8 bits of the character S in a double-byte system.\n\nNote: When describing encoding rules, this standard always speaks in terms of character position, not byte offset. Similarly, comparisons should be done on character values, not their byte equivalents. For this reason, delimiter characters should always have representation in the standard 7-bit ASCII character set, regardless of the actual character set being used, so that a search for the character CR (carriage return) can be performed.\na) if the field is not valued, the default single-byte character set (ASCII (\"ISO IR6\")) should be assumed. No other character sets are allowed in the message.\nb) if the field repeats, but the first element is NULL (i.e., present but unvalued), the single-byte ASCII (\"ISO IR6\") is assumed as the default character set.\nc) elements in the remainder of the sequence (i.e., elements 2..n) are alternate character sets that may be used.",
      "length": "15",
      "data_type": "ID - Coded Value For Hl7 Defined Tables",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "19": {
      "field_id": "MSH.19",
      "name": "Principal Language Of Message",
      "description": "This field contains the principal language of the message. Codes come from ISO 639.",
      "length": "0",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "MSH.2",
      "name": "Encoding Characters",
      "description": "This field contains four characters in the following order: the component separator, repetition separator, escape character, and subcomponent separator. Recommended values are ^~\\& (ASCII 94, 126, 92, and 38, respectively). See Section 2.5.4, \"Message delimiters'.",
      "length": "5",
      "data_type": "ST - String Data",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "20": {
      "field_id": "MSH.20",
      "name": "Alternate Character Set Handling Scheme",
      "description": "When any alternative character sets are used (as specified in the second or later iterations of MSH-18 Character Set), and if any special handling scheme is needed, this component is to specify the scheme used, according to HL7 Table 0356- Alternate Character Set Handling Scheme as defined in Chapter 2.C, Code Tables.",
      "length": "13",
      "data_type": "ID - Coded Value For Hl7 Defined Tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "21": {
      "field_id": "MSH.21",
      "name": "Message Profile Identifier",
      "description": "Sites may use this field to assert adherence to, or reference, a message profile. Message profiles contain detailed explanations of grammar, syntax, and usage for a particular message or set of messages. See section 2B, \"Conformance Using Message Profiles\".\n\nRepetition of this field allows more flexibility in creating and naming message profiles. Using repetition, this field can identify a set of message profiles that the message conforms to. For example, the first repetition could reference a vendor's message profile. The second could reference another compatible provider's profile or a later version of the first vendor profile.\n\nAs of v2.5, the HL7 message profile identifiers might be used for conformance claims and/or publish/subscribe systems. Refer to sections 2B.1.1\"Message profile identifier\" and 2.B.1.2, \"Message profile publish/subscribe topics\" for details of the message profile identifiers. Refer to sections 2.B.4.1, \"Static definition identifier\" and 2.B.4.2, \"Static definition publish/subscribe topics\" for details of the static definition identifiers.\n\nPrior to v2.5, the field was called Conformance Statement ID. For backward compatibility, the Conformance Statement ID can be used here. Examples of the use of Conformance Statements appear in Chapter 5, \"Query.\"",
      "length": "0",
      "data_type": "EI - Entity Identifier",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "22": {
      "field_id": "MSH.22",
      "name": "Sending Responsible Organization",
      "description": "Business organization that originated and is accountable for the content of the message.\n\nCurrently, MSH provides fields to transmit both sending/receiving applications and facilities (MSH.3 – MSH.6). However, these levels of organization do not necessarily relate to or imply a legal entity such as a business organization. As such, multiple legal entities (organizations) may share a service bureau, with the same application and facility identifiers. Another level of detail is required to delineate the various organizations using the same service bureau.\n\nTherefore, the Sending Responsible Organization field provides a complete picture from the application level to the overall business level. The Business Organization represents the legal entity responsible for the contents of the message.\n\nUse Case #1: A centralized system responsible for recording and monitoring instances of communicable diseases enforces a stringent authentication protocol with external applications that have been certified to access its information base. In order to allow message exchange, the centralized system mandates that external applications must provide the identity of the business organization sending the message (Sending Responsible Organization), the organization it is sending the message to (Receiving Responsible Organization, in this case the \"owner\" of the communicable diseases system), the network address from which the message has originated (Sending Network Address), the network address the message is being transmitted to (Receiving Network Address). The organization responsible for protecting the information stored within the communicable disease system requires this authentication due to the sensitive nature of the information it contains.",
      "length": "0",
      "data_type": "XON - Extended Composite Name And Identification Number For Organizations",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "23": {
      "field_id": "MSH.23",
      "name": "Receiving Responsible Organization",
      "description": "Business organization that is the intended receiver of the message and is accountable for acting on the data conveyed by the transaction.\nThis field has the same justification as the Sending Responsible Organization except in the role of the Receiving Responsible Organization. The receiving organization has the legal responsibility to act on the information in the message.",
      "length": "0",
      "data_type": "XON - Extended Composite Name And Identification Number For Organizations",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "24": {
      "field_id": "MSH.24",
      "name": "Sending Network Address",
      "description": "Identifier of the network location the message was transmitted from. Identified by an OID or text string (e.g., URI). The reader is referred to the \"Report from the Joint W3C/IETF URI Planning Interest Group: Uniform Resource Identifiers (URIs), URLs, and Uniform Resource Names (URNs): Clarifications and Recommendations\".5\n\nAs with the Sending/Receiving Responsible Organization, the Sending Network Address provides a more detailed picture of the source of the message. This information is lower than the application layer, but is often useful/necessary for routing and identification purposes. This field should only be populated when the underlying communication protocol does not support identification of sending network locations.\n\nAn agreement about the specific values and usage must exist among messaging partners. Use Case:\n\nDr. Hippocrates works for the ''Good Health Clinic\" (Sending facility) with a laptop running application XYZ (Sending App). He needs to talk to the provincial pharmacy system. He dials in and is assigned a network address. He then sends a message to the pharmacy system, which transmits a response back to him. Because the underlying network protocol does not have a place to communicate the sender and receiver network addresses, it therefore requires these addresses to be present in a known position in the payload.\n\nThere may be many doctors running application XYZ. In addition, the network address assigned to the laptop may change with each dial-in. This means there is not a 1..1 association between either the facility or the application and the network address.\nMSH||RX|GHC|||||OMP^O09^OMP_O09||||||||||||||||05782|\n\nExample 1: The Lone Tree Island satellite clinic transmits a notification of patient registration to its parent organization Community Health and Hospitals. The communication protocol does not support the identification of sending network location, so the sending network location is identified in the message by using its enterprise-wide network identifier \"HNO2588\".\nMSH||Reg|Lone|||||ADT^A04^ADT_A04||||||||||||||||HN02588|\n\nExample 2: The Stone Mountain satellite clinic transmits a notification of patient registration to its parent organization Community Health and Hospitals. The sending network location is identified by using its URI.\nMSH||Reg|Stone|||||ADT^A04^ADT_A04|||||||||||||||| ^ftp://www.goodhealth.org/somearea/someapp^URI|\n\nExample 3: The Three Rivers satellite clinic transmits a notification of patient registration to its parent organization Community Health and Hospitals. The sending network location is identified by using its Ipv4 address, port 5123 at node 25.152.27.69. The following example shows how to represent a port and DNS address using HD as the scheme MSH||Reg|TRC||||| ADT^A04^ADT_A04||||||||||||||||5123^25.152.27.69^DNS|\n\nExample 4: The Bayview satellite clinic transmits a notification of patient registration to its parent organization Community Health and Hospitals. The sending network location is identified by using \"4086::132:2A57:3C28\" its IPv6 address.\nMSH||REG|BAY||||| ADT^A04^ADT_A04||||||||||||||||^4086::132:2A57:3C28^IPv6|",
      "length": "0",
      "data_type": "HD - Hierarchic Designator",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "25": {
      "field_id": "MSH.25",
      "name": "Receiving Network Address",
      "description": "tifier of the network location the message was transmitted to. Identified by an OID or text string (e.g., URL).\n\nThis is analogous with the Sending Network Address, however in the receiving role.\n\nThis field should only be populated when the underlying communication protocol does not support identification receiving network locations.",
      "length": "0",
      "data_type": "HD - Hierarchic Designator",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "MSH.3",
      "name": "Sending Application",
      "description": "This field uniquely identifies the sending application among all other applications within the network enterprise. The network enterprise consists of all those applications that participate in the exchange of HL7 messages within the enterprise. Entirely site-defined. User-defined Table 0361- Application is used as the user-defined table of values for the first component.\n\nNote: By site agreement, implementers may continue to use User-defined Table 0300 – Namespace ID for the first component.",
      "length": "0",
      "data_type": "HD - Hierarchic Designator",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "4": {
      "field_id": "MSH.4",
      "name": "Sending Facility",
      "description": "This field further describes the sending application, MSH-3 Sending Application. With the promotion of this field to an HD data type, the usage has been broadened to include not just the sending facility but other organizational entities such as a) the organizational entity responsible for sending application; b) the responsible unit; c) a product or vendor's identifier, etc. Entirely site-defined. User-defined Table 0362 - Facility is used as the HL7 identifier for the user-defined table of values for the first component.\n\nNote: By site agreement, implementers may continue to use User-defined Table 0300 – Namespace ID for the first component.",
      "length": "0",
      "data_type": "HD - Hierarchic Designator",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "MSH.5",
      "name": "Receiving Application",
      "description": "This field uniquely identifies the receiving application among all other applications within the network enterprise. The network enterprise consists of all those applications that participate in the exchange of HL7 messages within the enterprise. Entirely site-defined User-defined Table 0361- Application is used as the HL7 identifier for the user-defined table of values for the first component.\n\nNote: By site agreement, implementers may continue to use User-defined Table 0300 – Namespace ID for the first component.",
      "length": "0",
      "data_type": "HD - Hierarchic Designator",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "6": {
      "field_id": "MSH.6",
      "name": "Receiving Facility",
      "description": "This field identifies the receiving application among multiple identical instances of the application running on behalf of different organizations. User-defined Table 0362 - Facility is used as the HL7 identifier for the user-defined table of values for the first component. Entirely site-defined.\n\nNote: By site agreement, implementers may continue to use User-defined Table 0300 – Namespace ID for the first component.",
      "length": "0",
      "data_type": "HD - Hierarchic Designator",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "7": {
      "field_id": "MSH.7",
      "name": "Date/Time Of Message",
      "description": "This field contains the date/time that the sending system created the message. If the time zone is specified, it will be used throughout the message as the default time zone.\n\nNote: This field was made required in version 2.4. Messages with versions prior to 2.4 are not required to value this field. This usage supports backward compatibility.",
      "length": "0",
      "data_type": "DTM - Date/time",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "8": {
      "field_id": "MSH.8",
      "name": "Security",
      "description": "In some applications of HL7, this field is used to implement security features. Its use is not yet further specified.",
      "length": "0",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "9": {
      "field_id": "MSH.9",
      "name": "Message Type",
      "description": "This field contains the message type, trigger event, and the message structure ID for the message.\n\nRefer to HL7 Table 0076 - Message Type for valid values for the message type code. This table contains values such as ACK, ADT, ORM, ORU etc.\n\nRefer to HL7 Table 0003 – Event Type for valid values for the trigger event. This table contains values like A01, O01, R01 etc.\n\nRefer to HL7 Table 0354 - Message Structure for valid values for the message structure. This table contains values such as ADT_A01, ORU_R01, SIU_S12, etc.\n\nThe receiving system uses this field to recognize the data segments, and possibly, the application to which to route this message. For certain queries, which may have more than a single response event type, the second component may, in the response message, vary to indicate the response event type. See the discussion of the display query variants in chapter 5.",
      "length": "0",
      "data_type": "MSG - Message Type",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    }
  }
}