{
  "segment_id": "NTE",
  "short_description": "Notes And Comments",
  "description": "The NTE segment is defined here for inclusion in messages defined in other chapters. It is commonly used for sending notes and comments.\n\nThe technical committees define the meaning of the NTE segments within the context of the messages in their chapters. For each NTE, the description in the message attribute table should include an indication of the segment associated with the NTE, for example \"Notes and Comments for the PID\".",
  "fields": {
    "1": {
      "field_id": "NTE.1",
      "name": "Set Id - Nte",
      "description": "This field may be used where multiple NTE segments are included in a message. Their numbering must be described in the application message definition.",
      "length": "0",
      "data_type": "SI - Sequence Id",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "NTE.2",
      "name": "Source Of Comment",
      "description": "This field is used when source of comment must be identified. This table may be extended locally during implementation. Refer to HL7 Table 0105 - Source of Comment for valid values.",
      "length": "1",
      "data_type": "ID - Coded Value For Hl7 Defined Tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "NTE.3",
      "name": "Comment",
      "description": "This field contains the comment contained in the segment.\n\nNote: As of v2.2, this field uses the FT rather than a TX data type. Since there is no difference between an FT data type without any embedded formatting commands, and a TX data type, this change is compatible with the previous version.",
      "length": "0",
      "data_type": "FT - Formatted Text Data",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "4": {
      "field_id": "NTE.4",
      "name": "Comment Type",
      "description": "This field contains a value to identify the type of comment text being sent in the specific comment record. Refer to User-Defined Table 0364 - Comment Type for suggested values.\n\nNote: A field already exists on the NTE record that identifies the Sources of Comment (e.g., ancillary, placer, other). However some applications need to support other types of comment text (e.g., instructions, reason, remarks, etc.). A separate NTE segment can be used for each type of comment (e.g., instructions are on one NTE and remarks on another NTE).",
      "length": "0",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "NTE.5",
      "name": "Entered By",
      "description": "This field contains the identity of the person who actually keyed the comment into the application. It provides an audit trail in case the comment is entered incorrectly and the ancillary department needs to clarify the comment. By local agreement, either the ID number or name component may be omitted.",
      "length": "0",
      "data_type": "XCN - Extended Composite Id Number And Name For Persons",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "6": {
      "field_id": "NTE.6",
      "name": "Entered Date/Time",
      "description": "This field contains the actual date the comment was keyed into the application.",
      "length": "0",
      "data_type": "DTM - Date/time",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "7": {
      "field_id": "NTE.7",
      "name": "Effective Start Date",
      "description": "This field contains the date the comment becomes or became effective.",
      "length": "0",
      "data_type": "DTM - Date/time",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "8": {
      "field_id": "NTE.8",
      "name": "Expiration Date",
      "description": "This field contains the date the comment becomes or became non-effective.",
      "length": "0",
      "data_type": "DTM - Date/time",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    }
  }
}