{
  "segment_id": "ORG",
  "short_description": "Practitioner Organization Unit",
  "description": "The ORG segment relates a practitioner to an organization unit and adds detailed information regarding the practitioner's practicing specialty in that organization unit. An ORG segment may optionally follow an STF segment. An ORG segment must always have been preceded by a corresponding STF segment. If no organization unit is specified, this segment is used to relate practitioners with their practicing specialties, including effective and end dates. When it is not necessary to record organization unit or dates associated with the practicing specialty, this data is recorded in PRA-3-Practitioner Category.",
  "fields": {
    "1": {
      "field_id": "ORG.1",
      "name": "Set Id - Org",
      "description": "This field contains the number that identifies this transaction. For the first occurrence of the segment, the sequence number shall be one; for the second occurrence, the sequence number shall be two; etc.",
      "length": "4",
      "data_type": "SI - Sequence Id",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "10": {
      "field_id": "ORG.10",
      "name": "Employment Status Code",
      "description": "This field contains a code indicating the working relationship of the practitioner at this organization unit. It may be different than the work status specified in STF-20. Refer to User-defined Table 0066 - Employment Status, in Chapter 6, Financial Management, for suggested values.",
      "length": "0",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "11": {
      "field_id": "ORG.11",
      "name": "Board Approval Indicator",
      "description": "This field contains an indicator for whether this practice specialty requires board approval. Refer to HL7 Table 0136 - Yes/no Indicator for valid values.",
      "length": "1",
      "data_type": "ID - Coded Value For Hl7 Defined Tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "12": {
      "field_id": "ORG.12",
      "name": "Primary Care Physician Indicator",
      "description": "This field contains an indicator for whether this practice specialty may act as a primary care physician (PCP). Refer to HL7 Table 0136 - Yes/no Indicator for valid values.",
      "length": "1",
      "data_type": "ID - Coded Value For Hl7 Defined Tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "13": {
      "field_id": "ORG.13",
      "name": "Cost Center Code",
      "description": "This field contains the cost center name or code assigned to this organization unit. Refer to HL7 User-defined Table 0539 - Cost Center Code for valid values.",
      "length": "0",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "2": {
      "field_id": "ORG.2",
      "name": "Organization Unit Code",
      "description": "This field contains the hierarchical components of the organization unit, as defined by the institution. Refer to User-defined Table 0405 - Organization Unit for suggested values.",
      "length": "0",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "ORG.3",
      "name": "Organization Unit Type Code",
      "description": "This field contains a code indicating the classification of the organization unit. HL7 suggests using values in User-defined Table 0474 - Organization Unit Type.",
      "length": "0",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "4": {
      "field_id": "ORG.4",
      "name": "Primary Org Unit Indicator",
      "description": "This field contains an indicator for whether this organization unit is the primary organization unit for this practitioner. Refer to HL7 Table 0136 - Yes/no Indicator for valid values.",
      "length": "1",
      "data_type": "ID - Coded Value For Hl7 Defined Tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "ORG.5",
      "name": "Practitioner Org Unit Identifier",
      "description": "This field contains an identification code used by the institution to identify this person at this specific organization unit. If the person is identified with the same code at all organization units, then this data should be coded in STF-2 Staff ID Codes.",
      "length": "0",
      "data_type": "CX - Extended Composite Id With Check Digit",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "6": {
      "field_id": "ORG.6",
      "name": "Health Care Provider Type Code",
      "description": "This field contains the major grouping of the service or occupation of the practitioner at a specific organization unit, for example, Behavioral Health & Social Service. HL7 suggests using values derived from the ANSI ASC X12 Health Care Provider Taxonomy, Level 1 - Type.",
      "length": "0",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "7": {
      "field_id": "ORG.7",
      "name": "Health Care Provider Classification Code",
      "description": "This field contains the more specific service or occupation within the health care provider type of the practitioner at a specific organization unit, for example, Counselor. HL7 suggests using values derived from the ANSI ASC X12 Health Care Provider Taxonomy, Level 2 - Classification.",
      "length": "0",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "8": {
      "field_id": "ORG.8",
      "name": "Health Care Provider Area Of Specialization Code",
      "description": "This field contains the segment of the population that a health care provider chooses to service, a specific medical service, a specialization in treating a specific disease, or any other descriptive characteristic about the provider's practice relating to the services rendered of the practitioner at a specific organization unit, for example, Mental Health. HL7 suggests using values derived from the ANSI ASC X12 Health Care Provider Taxonomy, Level 3 - specialization.",
      "length": "0",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "9": {
      "field_id": "ORG.9",
      "name": "Effective Date Range",
      "description": "This field contains the date range in which the practitioner started and ended working at the specific organization unit in the specific practicing specialty category.",
      "length": "0",
      "data_type": "DR - Date/time Range",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    }
  }
}