{
  "segment_id": "PRC",
  "short_description": "Pricing",
  "description": "The PRC segment contains the pricing information for the preceding CDM segment's chargeable item. It contains the fields which, for the same chargeable item, might vary depending upon facility or department or patient type. The preceding CDM segment contains the fields which, for one chargeable item, remain the same across facilities, departments, and patient types.",
  "fields": {
    "1": {
      "field_id": "PRC.1",
      "name": "Primary Key Value - Prc",
      "description": "This field contains the code assigned by the institution for the purpose of uniquely identifying the thing that can be charged. The key field of the entry. For example, this field would be used to uniquely identify a procedure, item, or test for charging purposes. Probably the same set of values as used in FT1-7 - Transaction Code in financial messages. Must match MFE-4 - Primary Key - MFE and CDM-1 - Primary Key - CDM. Refer to User-defined Table 0132 - Transaction code in Chapter 2C, Code Tables, for suggested values. See Chapter 7 for discussion of the universal service ID.",
      "length": "0",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "10": {
      "field_id": "PRC.10",
      "name": "Maximum Price",
      "description": "This field contains the maximum total price (after computation of components of price) that can be charged for this item.",
      "length": "0",
      "data_type": "MO - Money",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "11": {
      "field_id": "PRC.11",
      "name": "Effective Start Date",
      "description": "This field contains the date/time when this CDM entry becomes effective",
      "length": "0",
      "data_type": "DTM - Date/time",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "12": {
      "field_id": "PRC.12",
      "name": "Effective End Date",
      "description": "This field contains the date/time when this CDM entry is no longer effective.",
      "length": "0",
      "data_type": "DTM - Date/time",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "13": {
      "field_id": "PRC.13",
      "name": "Price Override Flag",
      "description": "This field indicates whether this CDM entry's price can be overridden. Refer to User-defined Table 0268 - Override in Chapter 2C, Code Tables, for suggested values.",
      "length": "0",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "14": {
      "field_id": "PRC.14",
      "name": "Billing Category",
      "description": "This field contains the billing category codes for any classification systems needed, for example, general ledger codes and UB92 categories. Repeating field with coded entry made up of category code plus category system. Refer to User-defined Table 0293 - Billing category in Chapter 2C, Code Tables, for suggested values.",
      "length": "0",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "15": {
      "field_id": "PRC.15",
      "name": "Chargeable Flag",
      "description": "This field contains a chargeable indicator. Refer to HL7 Table 0136 - Yes/no Indicator in Chapter 2C, Code Tables, for valid values.\nN- charge is not billable, that is, do not create charges for this CDM entry; this is zero price item\nY- item is billable (this is also the default when NULL)",
      "length": "1",
      "data_type": "ID - Coded Value For Hl7 Defined Tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "16": {
      "field_id": "PRC.16",
      "name": "Active/Inactive Flag",
      "description": "This indicates whether this is a usable CDM entry. Refer to HL7 Table 0183 - Active/Inactive in Chapter 2C, Code Tables, for valid values.",
      "length": "1",
      "data_type": "ID - Coded Value For Hl7 Defined Tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "17": {
      "field_id": "PRC.17",
      "name": "Cost",
      "description": "This field contains the institution's calculation of how much it costs to provide this item, that is, what the institution had to pay for the material plus any specified payment expenditure, effort or loss due to performing or providing the chargeable item.",
      "length": "0",
      "data_type": "MO - Money",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "18": {
      "field_id": "PRC.18",
      "name": "Charge On Indicator",
      "description": "This field contains the user-defined table of values which indicates when a charge for services or procedures should be accrued. Refer to User-defined Table 0269 - Charge On Indicator in Chapter 2C, Code Tables, for suggested values.",
      "length": "0",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "PRC.2",
      "name": "Facility Id - Prc",
      "description": "This field contains the facility of the institution for which this price (for the preceding CDM entry) is valid. For use when needing multi-facility pricing. If null, assume all facilities. In a multi-facility environment, the facility associated with this chargeable item may not be the same as the sending or receiving facility identified in the MSH segment. Use only when the price is not the same for all facilities, that is, a null value indicates that this pricing is valid for all facilities.\n\nWhen two PRC segments are sent with the same key values but different facility identifiers, the second is sent in addition to the first, not to replace the first. The effective unique identifier is the charge code (PRC-1 - Primary Key Value - PRC) plus the facility ID (PRC-2 - Facility ID). Multiple facility identifiers can be sent in the same segment to indicate that those facilities use the same pricing. Refer to User-defined Table 0464 - Facility ID in Chapter 2C, Code Tables, for suggested values.",
      "length": "0",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "3": {
      "field_id": "PRC.3",
      "name": "Department",
      "description": "This field contains the department of the facility which accrues revenue/cost for this type of charge. When pricing is different for different departments within the same facility, this will indicate for which department the following pricing information is valid. Use only when the price is not the same for all departments, that is, a null value indicates that this pricing is valid for all departments.\n\nWhen two PRC segments are sent the same key values but with different departments, the second is sent in addition to the first, not to replace the first. The effective unique identifier is the charge code (PRC-1 - Primary Key - PRC) plus the facility ID (PRC-2 - Facility ID) plus the department (PRC-3 - Department). Multiple departments can be sent in the same segment to indicate that those departments use the same pricing. Refer to User-defined Table 0184 - Department in Chapter 2C, Code Tables, for suggested values.",
      "length": "0",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "4": {
      "field_id": "PRC.4",
      "name": "Valid Patient Classes",
      "description": "This field contains the patient types for which this charge description is valid. For example, Inpatient, Outpatient, Series, Clinic, ER, Ambulatory, Observation, etc. These values should be the same set of values as those used for PV1-3 - Patient Class, which is site defined. Use only when the price is not valid for all patient types, that is, a null value indicates that this pricing is valid for all patient classes. Refer to User-defined Table 0004 - Patient Class in Chapter 2C, Code Tables, for suggested values.\n\nWhen two PRC segments are sent the same key values but with different valid patient classes, the second is sent in addition to the first, not to replace the first. The effective unique identifier is the charge code (PRC-1 - PRC Primary Key) plus the facility ID (PRC-2 - Facility ID) plus the department (PRC-3 - Department) plus the patient class (PRC-4 - Valid Patient Classes). Multiple patient classes can be sent in the same segment to indicate that those patient classes use the same pricing.",
      "length": "0",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "5": {
      "field_id": "PRC.5",
      "name": "Price",
      "description": "This field contains the price to be charged for service, item, or procedure. If CDM price will always be overridden when charges are posted, then this field is optional. Otherwise, price would be a required field. The formula or calculation that is to be used to get total price from these price components is left to implementation negotiations agreed upon by the participating institutions. See Chapter 2, section 2.8.8, \"CP - composite price,\" for a description of the use of the composite price (CP) data type.",
      "length": "0",
      "data_type": "CP - Composite Price",
      "optionality": "Conditional",
      "repeatability": "Repeatable indefinitely"
    },
    "6": {
      "field_id": "PRC.6",
      "name": "Formula",
      "description": "This field contains the mathematical formula to apply to PRC-5 - Price in order to compute total price. The syntax of this formula must conform to Arden Syntax rules.",
      "length": "0",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "7": {
      "field_id": "PRC.7",
      "name": "Minimum Quantity",
      "description": "This field contains the minimum number of identical charges allowed on one patient account for this CDM entry",
      "length": "0",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "8": {
      "field_id": "PRC.8",
      "name": "Maximum Quantity",
      "description": "This field contains the maximum number of identical charges allowed on one patient account for this CDM entry.",
      "length": "0",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "9": {
      "field_id": "PRC.9",
      "name": "Minimum Price",
      "description": "This field contains the minimum total price (after computation of components of price) that can be charged for this item.",
      "length": "0",
      "data_type": "MO - Money",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    }
  }
}