{
  "segment_id": "RQD",
  "short_description": "Requisition Detail",
  "description": "RQD contains the detail for each requisitioned item.",
  "fields": {
    "1": {
      "field_id": "RQD.1",
      "name": "Requisition Line Number",
      "description": "This field contains the number that identifies this line in the requisition.",
      "length": "4",
      "data_type": "SI - Sequence Id",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "10": {
      "field_id": "RQD.10",
      "name": "Date Needed",
      "description": "This field contains the date this item is required.\n\nNote: Although none of the fields are required, one of the three identifying codes—RQD-2-item code-internal, RQD-3-item code-external, or RQD-4-hospital item code—must be specified in order for the receiving application to process the request.\n\nIt is left to the vendors to determine which will be used as the common link between the two applications. HL7 recommends using the RQD-4-Hospital Item Code.\n\nHospital accounting requires an identifier to charge a particular cost center or patient for a requisitioned supply. If the supply is for a patient, then this identifier comes from the PID segment; otherwise, from RQD-7-Dept. Cost Center and RQD-8-Item Natural Account Code must be used. It is recommended that the \"final\" cost center responsible for providing the supply to the patient be included, even when the patient ID is provided.\n\nHospital accounting applications use RQD-7-Dept. Cost Center concatenated with RQD-8-Item Natural Account Code in order to post this transaction to the General Ledger. This concatenated value should correspond to a valid entry in the accounting applications \"Chart of Accounts.\"",
      "length": "0",
      "data_type": "DT - Date",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "RQD.2",
      "name": "Item Code - Internal",
      "description": "This field contains the identifier and description that uniquely identify the item on the application sending the requisition. This field is conditional because at least one of the three fields – RQD-2-item code- internal, RQD-3-item code-external, or RQD-4-hospital item code – must be valued.",
      "length": "0",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "RQD.3",
      "name": "Item Code - External",
      "description": "This field contains the identifier and description that uniquely identify the item on the application receiving the requisition. This field is conditional because at least one of the three fields – RQD-2-item code-internal, RQD-3-item code-external or RQD-4-hospital item code – must be valued.",
      "length": "0",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "4": {
      "field_id": "RQD.4",
      "name": "Hospital Item Code",
      "description": "This field contains the identifier and description that uniquely identify the item on all applications in the hospital. The identifier is usually controlled by the hospital financial application in the charge description master file. This field is conditional because at least one of the three fields – RQD-2-item code-internal, RQD-3-item code-external or RQD-4-hospital item code -- must be valued.\n\nNote: At least one of the three fields 4.11.1.2 through 4.11.1.4 must be non-null.",
      "length": "0",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "RQD.5",
      "name": "Requisition Quantity",
      "description": "This field contains the quantity requisitioned for this item.",
      "length": "0",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "6": {
      "field_id": "RQD.6",
      "name": "Requisition Unit Of Measure",
      "description": "This field contains the unit of measure for this item.",
      "length": "0",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "7": {
      "field_id": "RQD.7",
      "name": "Cost Center Account Number",
      "description": "This field contains the general ledger cost center account number associated with a department that may issue or charge for this item. Refer to HL7 Table 0319 – Department Cost Center for valid values.",
      "length": "0",
      "data_type": "CX - Extended Composite Id With Check Digit",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "8": {
      "field_id": "RQD.8",
      "name": "Item Natural Account Code",
      "description": "This field contains the accounting code that identifies this item in order to charge for this item. User-Defined Table 0320 - Item Natural Account Code is used as the HL7 identifier for the user-defined table of values for this field.",
      "length": "0",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "9": {
      "field_id": "RQD.9",
      "name": "Deliver To Id",
      "description": "This field contains the unique identifier and descriptive name of the department/location where the item should be delivered.",
      "length": "0",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    }
  }
}