{
  "segment_id": "RXG",
  "short_description": "Pharmacy/treatment Give",
  "description": "No description found.",
  "fields": {
    "1": {
      "field_id": "RXG.1",
      "name": "Give Sub-id Counter",
      "description": "Use if this RXG segment carries information about a single administration. This field must contain a unique number for the placer order number. This field along with the placer order number provides a unique reference to the specific scheduled give date/time transmitted by the pharmacy/treatment supplier for this order.\n\nIf the RXG segment carries information about multiple administrations, this field's value is zero (0), since in this case a one-to-one matching with the RXA segment is ambiguous.",
      "length": "0",
      "data_type": "NM - Numeric",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "10": {
      "field_id": "RXG.10",
      "name": "Substitution Status",
      "description": "Refer to HL7 Table 0167 - Substitution Status for valid values.\n\nNote: The next two fields are equivalent to the corresponding fields of the RXE segment. They are included (optionally) in the RXG so that it may \"stand alone\" as a \"give\" instruction segment.",
      "length": "1",
      "data_type": "ID - Coded Value For Hl7 Defined Tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "11": {
      "field_id": "RXG.11",
      "name": "Dispense-to Location",
      "description": "This field is retained for backward compatibility only as of v 2.6 and removed from the standard as of v 2.8. The reader is referred to RXG-27 and RXG-28.",
      "length": "0",
      "data_type": "ST - String Data",
      "optionality": "Withdrawn",
      "repeatability": "Not repeatable"
    },
    "12": {
      "field_id": "RXG.12",
      "name": "Needs Human Review",
      "description": "Refer to HL7 Table 0136 - Yes/No Indicator for valid values. The values have the following meaning for this field:\nY - Indicates that a warning is present. The application receiving the dispense order needs to warn the person dispensing/administering the drug or treatment to pay attention to the text in RXG-13-pharmacy/treatment supplier's special administration instructions.\nN - Indicates no warning is present. This is the equivalent default (null) value.",
      "length": "1",
      "data_type": "ID - Coded Value For Hl7 Defined Tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "13": {
      "field_id": "RXG.13",
      "name": "Pharmacy/Treatment Supplier's Special Administration Instructions",
      "description": "This field contains pharmacy/treatment supplier-generated special instructions to the provider administering the order.",
      "length": "250",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "14": {
      "field_id": "RXG.14",
      "name": "Give Per (time Unit)",
      "description": "This field contains the time unit to use to calculate the rate at which the pharmaceutical/treatment is to be administered.\nFormat:\nS<integer> = <integer> seconds\nM<integer> = <integer> minutes\nH<integer> = <integer> hours\nD<integer> = <integer> days\nW<integer> = <integer> weeks\nL<integer> = <integer> months\nT<integer> = at the interval and amount stated until a total of <integer> \"DOSAGE\" is accumulated. Units would be assumed to be the same as in the QUANTITY field.\nINDEF = do indefinitely - also the default\n\nThis is the same as the format specified for the DURATION component of the quantity/timing field, excluding the \"X\" specification.\n\nRequired when relevant (e.g., certain IVs). For example, if the \"give amount/units\" were 300 ml and the \"give per\" time unit were H1 (equivalent to one hour), the rate is 300ml/hr.",
      "length": "0",
      "data_type": "ST - String Data",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "15": {
      "field_id": "RXG.15",
      "name": "Give Rate Amount",
      "description": "This field contains the rate at which the substance should be administered.",
      "length": "0",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "16": {
      "field_id": "RXG.16",
      "name": "Give Rate Units",
      "description": "This field contains the units for RXG-15-give rate amount. May be composite. The ratio of the RXG-15-give rate amount and RXG-16-give rate units fields define the actual rate of administration. Thus, if RXG-15-give rate amount = 100 and RXG-16-give rate units = ml/hr, the requested rate of administration is 100 ml/hr.",
      "length": "0",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "17": {
      "field_id": "RXG.17",
      "name": "Give Strength",
      "description": "Use when RXE-2-give code does not specify the strength. This is the numeric part of the strength, used in combination with RXE-26-give strength units.",
      "length": "0",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "18": {
      "field_id": "RXG.18",
      "name": "Give Strength Units",
      "description": "Use when RXG-4-Give Code does not specify the strength. This is the unit of the strength, used in combination with RXG-17-Give Strength.\n\nNote: These units can be a \"compound quantity\"; i.e., the units may express a quantity per unit of time. For example, micrograms per hour (micg/h) is an acceptable value. These compound units are contained in the ISO+ table. See Chapter 7 for full definition of ISO+ units.",
      "length": "0",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "19": {
      "field_id": "RXG.19",
      "name": "Substance Lot Number",
      "description": "This field contains the lot number of the medical substance administered.\n\nNote: The lot number is the number printed on the label attached to the container holding the substance and on the packaging which houses the container. If the substance is a vaccine, for example, and a diluent is required, a lot number may appear on the vial containing the diluent; however, any such identifier associated with a diluent is not the identifier of interest. The substance lot number should be reported, not that of the diluent.",
      "length": "0",
      "data_type": "ST - String Data",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "2": {
      "field_id": "RXG.2",
      "name": "Dispense Sub-id Counter",
      "description": "This is the dispense sub-ID to which this give message is related.",
      "length": "0",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "20": {
      "field_id": "RXG.20",
      "name": "Substance Expiration Date",
      "description": "This field contains the expiration date of the medical substance administered.\n\nNote: Vaccine expiration date does not always have a \"day\" component; therefore, such a date may be transmitted as YYYYMM.",
      "length": "0",
      "data_type": "DTM - Date/time",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "21": {
      "field_id": "RXG.21",
      "name": "Substance Manufacturer Name",
      "description": "This field contains the manufacturer of the medical substance administered.\n\nNote: For vaccines, code system MVX may be used to code this field (see section 4A.7.1, \"Vaccine administration data\"). This field may be used if the manufacturer of the substance is not identified by the code used in RXA-5-administered code.",
      "length": "0",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "22": {
      "field_id": "RXG.22",
      "name": "Indication",
      "description": "This field contains the identifier of the condition or problem for which the drug/treatment was prescribed. May repeat if multiple indications are relevant.",
      "length": "0",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "23": {
      "field_id": "RXG.23",
      "name": "Give Drug Strength Volume",
      "description": "This numeric field defines the volume measurement in which the drug strength concentration is contained. For example, Acetaminophen 120 MG/5ML Elixir means that 120 MG of the drug is in a solution with an RXG-17, RXG-18, RXG-23 and RXG-24 as:\nRXG|||||||||||||||||120|mg^^ISO|||||5|ml^^ISO ...<cr>",
      "length": "0",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "24": {
      "field_id": "RXG.24",
      "name": "Give Drug Strength Volume Units",
      "description": "Description: This field indicates the volumetric unit associated with RXG-23 Give Drug Strength Volume. See example in RXG-23.",
      "length": "0",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "25": {
      "field_id": "RXG.25",
      "name": "Give Barcode Identifier",
      "description": "This field contains the pharmacy system's assigned barcode number for the give occurrence. For IV orders, many pharmacy systems generate a barcode number to identify a specific bag/bottle of the order. This number can be an instance identifier; unique for the patient, drug combination, and schedule instance or it may be just a drug identifier.\n\nThe composition and use of the barcode number is dependent on application negotiation. An example of this field follows: The barcode number is in the following format, 9XXXXXXX000. The number '9' is a constant, XXXXXXX is seven (7) characters for a unique identifier assigned or derived from the patient account and order ID and 000 is the zero-filled three (3) character IV bottle number.\n\nThe maximum length of the first component of this field is 40 characters to allow for the maximum existing barcode length in use today. The second component contains the description of the item being coded and the third component may define the barcode type.\n\n12345678901^IV bottle^3X9",
      "length": "0",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "26": {
      "field_id": "RXG.26",
      "name": "Pharmacy Order Type",
      "description": "The Pharmacy Order Type field defines the general category of pharmacy order which may be used to determine the processing path the order will take. Refer to HL7 Table 0480 Pharmacy Order Types for valid values.\n\nThis field may also be used for grouping of related orders for processing and/or reports. For example, Medication Administration Records (MARs) often group large volume solutions, medications and small volume solutions differently based upon site-specific workflow.\n\nUsage Rule: This field is optional for all Pharmacy transactions. When not populated, a default value of \"M\" is assumed.",
      "length": "1",
      "data_type": "ID - Coded Value For Hl7 Defined Tables",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "27": {
      "field_id": "RXG.27",
      "name": "Dispense To Pharmacy",
      "description": "This field is retained for backward compatibility only as of v27. The information formerly communicated using this field should now be communicated using the PRT segment. The reader is referred to chapter 7 for a description of that segment.\n\nThis field specifies the pharmacy that will dispense the prescription.",
      "length": "0",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    },
    "28": {
      "field_id": "RXG.28",
      "name": "Dispense To Pharmacy Address",
      "description": "This field is retained for backward compatibility only as of v27. The information formerly communicated using this field should now be communicated using the PRT segment. The reader is referred to chapter 7 for a description of that segment.\n\nThis field specifies the address of the dispensing facility or the patient's location where the dispensing will occur.",
      "length": "0",
      "data_type": "XAD - Extended Address",
      "optionality": "Backward Compatibility",
      "repeatability": "Not repeatable"
    },
    "29": {
      "field_id": "RXG.29",
      "name": "Deliver-to Patient Location",
      "description": "This field specifies the location of the patient to whom the pharmaceutical substance is to be delivered.",
      "length": "0",
      "data_type": "PL - Person Location",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "RXG.3",
      "name": "Quantity/Timing",
      "description": "Attention: The RXG-3 field was retained for backward compatibilty only as of v2.5 and the detail was withdrawn and removed from the standard as of v2.7.\n\nNote: The contents of fields 3-8 should be identical to the comparable fields in the RXE (RXE-2 thru 5).",
      "length": "0",
      "data_type": "ST - String Data",
      "optionality": "Withdrawn",
      "repeatability": "Not repeatable"
    },
    "30": {
      "field_id": "RXG.30",
      "name": "Deliver-to Address",
      "description": "This field specifies the address, either mailing or physical, to which the prescription should be mailed or delivered.",
      "length": "0",
      "data_type": "XAD - Extended Address",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "31": {
      "field_id": "RXG.31",
      "name": "Give Tag Identifier",
      "description": "This field contains an identifier for the individual product instance for the dispense occurrence. This may represent a barcode, RFID or other means of automatically-readable product instance. Repetitions represent the same instance where more than one barcode, RFID or other identification is present.\n\nFor example, the medication preparer, e.g., a semi-automated system, can inform the nurse that \"for the 8.am administration event, the medication that has been assigned and available at the patient bedside has the barcode BBBBBBBBBBB.\" The nurse would scan the barcode to ensure that the right medication is being administered.\n\nThis differs from RXG-25 Give Barcode Identifier in that RXG-25 may include other workflow content or the product at various levels of granularity. RXG-31 specifically identifies the product instance.",
      "length": "0",
      "data_type": "EI - Entity Identifier",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    },
    "32": {
      "field_id": "RXG.32",
      "name": "Dispense Amount",
      "description": "This field contains the amount to be dispensed as encoded by the pharmacy or treatment supplier",
      "length": "0",
      "data_type": "NM - Numeric",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "33": {
      "field_id": "RXG.33",
      "name": "Dispense Units",
      "description": "This field contains the units for the dispense amount as encoded by the pharmacy or treatment supplier. This field is required if the units are not implied by the actual dispense code. This must be in simple units that reflect the actual quantity of the substance dispensed. It does not include compound units",
      "length": "0",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Conditional",
      "repeatability": "Not repeatable"
    },
    "4": {
      "field_id": "RXG.4",
      "name": "Give Code",
      "description": "This field is the identifier of the medical substance/treatment ordered to be given to the patient; it is equivalent to OBR-4-Universal service ID in function. See the RXE segment for a complete definition of the RXE-2-Give code. If the substance given is a vaccine, CVX codes may be used to code this field (see HL7 Table 0292 - Vaccines administered).",
      "length": "0",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "RXG.5",
      "name": "Give Amount - Minimum",
      "description": "This field contains the ordered amount as encoded by the pharmacy/treatment supplier. In a variable dose order, this is the minimum ordered amount. In a non-varying dose order, this is the exact amount of the order.\nNote: This field is not a duplication of the first component of the quantity/timing field, since in non-pharmacy/treatment orders, that component can be used to specify multiples of an ordered amount.\n\nAnother way to say this is that, for pharmacy/treatment orders, the quantity component of the quantity/timing field refers to what is to be given out at each service interval; and thus, in terms of the RX order, that first component always defaults to 1. Hence, in the actual execution of the order, the value of 1 in the first component of the quantity/timing field always refers to one administration of the amount specified in this field (the requested Give Amount field).",
      "length": "0",
      "data_type": "NM - Numeric",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "6": {
      "field_id": "RXG.6",
      "name": "Give Amount - Maximum",
      "description": "In a variable dose order, this is the maximum ordered amount. In a non-varying dose, this field is not used.",
      "length": "0",
      "data_type": "NM - Numeric",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "7": {
      "field_id": "RXG.7",
      "name": "Give Units",
      "description": "This field contains the units for the give amount.\n\nA table of standard units that contains compound units is needed. Until such a table is agreed on, a user-defined table is needed for each site.\n\nNote: These units can be a \"compound quantity;\" i.e., the units may contain the word \"per.\" For example, micrograms per KG (micg/kg) is an acceptable value, which means that the units are micrograms per KG (of body weight).",
      "length": "0",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "8": {
      "field_id": "RXG.8",
      "name": "Give Dosage Form",
      "description": "The dosage form indicates the manner in which the medication or treatment is aggregated for dispensing, e.g., tablets, capsules, suppositories. In some cases, this information is implied by the give code in RXE-2-Give Code. Use the RXE-6-Give Dosage Form when the give code does not specify the dosage form.",
      "length": "0",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "9": {
      "field_id": "RXG.9",
      "name": "Administration Notes",
      "description": "This field contains notes to the person administering the medication/treatment (may include the ordering provider's original notes, as well as any notes from the formulary or the pharmacy or treatment supplier). If coded, a user-defined table must be used. If free text, place a null in the first component and the text in the second, e.g., |^this is a free text administration note|.",
      "length": "0",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Optional",
      "repeatability": "Repeatable indefinitely"
    }
  }
}