{
  "segment_id": "RXR",
  "short_description": "Pharmacy/treatment Route",
  "description": "The Pharmacy/Treatment Route segment contains the alternative combination of route, site, administration device, and administration method that are prescribed as they apply to a particular order. The pharmacy, treatment staff and/or nursing staff has a choice between the routes based on either their professional judgment or administration instructions provided by the physician.",
  "fields": {
    "1": {
      "field_id": "RXR.1",
      "name": "Route",
      "description": "This field is the route of administration.\n\nSome current \"route codes,\" such as some of the NDC-derived codes include the site already. In such cases, the entire code can be included in this field as a \"locally-defined code\" for the CE data type. Refer to User-Defined Table 0162 - Route of Administration for valid values.",
      "length": "0",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "RXR.2",
      "name": "Administration Site",
      "description": "This field contains the site of the administration route. When using a post-coordinated code table in this field, RXR-6 Administration Site may be used to modify the meaning of this field.\n\nRefer to HL7 Table 0550 - Body Parts for valid values. Other appropriate external code sets (e.g., SNOMED) may also be employed.",
      "length": "0",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "3": {
      "field_id": "RXR.3",
      "name": "Administration Device",
      "description": "This field contains the mechanical device used to aid in the administration of the drug or other treatment. Common examples are IV-sets of different types. Refer to User-defined Table 0164 - Administration device for valid entries.",
      "length": "0",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "4": {
      "field_id": "RXR.4",
      "name": "Administration Method",
      "description": "This field identifies the specific method requested for the administration of the drug or treatment to the patient. Refer To User-defined Table 0165 - Administration Method for valid values.",
      "length": "0",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "5": {
      "field_id": "RXR.5",
      "name": "Routing Instruction",
      "description": "This field provides instruction on administration routing, especially in cases where more than one route of administration is possible. A typical case would be designating which IV line should be used when more than one IV line is a possible route for injection.",
      "length": "0",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    },
    "6": {
      "field_id": "RXR.6",
      "name": "Administration Site Modifier",
      "description": "This field contains a modifier which modifies the meaning of RXR-2 Administration Site.\n\nThe code table used in this field is dependent upon the code table used in RXR-2 Administration site. If RXR-2 employs HL7 Table 0550 - Body Parts, then this field may only be populated with values from HL7 Table 0495 - Body Parts Modifier. In the case of other code sets (e.g., SNOMED) in RXR-2, RXR-6 may only be populated if modifiers are defined within, or related to, that code set.\n\nCondition Rule: This field may only be populated if RXR-2 Administration Site is populated. This field is not required if RXR-2 is populated.",
      "length": "0",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Optional",
      "repeatability": "Not repeatable"
    }
  }
}