{
  "segment_id": "UAC",
  "short_description": "User Authentication Credential Segment",
  "description": "This optional segment provides user authentication credentials, a Kerberos Service Ticket or SAML assertion, to be used by the receiving system to obtain user identification data. Refer to HL7 Table 0615 - User Authentication Credential Type Code. It is to be used in when the receiving application system requires the sending system to provide end-user identification for accountability or access control in interactive applications. Since user authentication implementations often limit the time period for validity of the session authentication credentials, this segment is not intended for use in non-interactive applications.\n\nIt is possible that various user authentication credential standards' data may be communicated. Kerberos and SAML are two such standards. A user authentication credential is an encapsulated data (ED type) element, as defined by standards, with no HL7-relevant structure.\n\nNote: The UAC segment is defined for use within simple protocols, such as MLLP, that do not have user authentication semantics. Implementations that use WSDL/SOAP, or similar protocols, to envelope HL7 should employ the user authentication semantics and data structures available within the scope of those protocols rather than the UAC segment.\n\nIf the receiving system accepts the user credentials in the UAC segment, no specific acknowledgement is required. However, if the receiving system detects an error while processing the UAC segment, its acknowledgment message shall report it to the sender via an MSA and ERR segment pair:\n- The ERR-3 (error code) field value is 207 to signify an application error\n- The ERR-7 (diagnostic information) field reports the specific error. Examples of possible errors are:\n- User credentials expected but not provided\n- User credentials invalid\n- User credentials expired\n- User credentials from an unknown or untrusted source\n- User unknown\n- User not allowed to create or access data on the receiving system.\n- User not allowed to initiate a processing function on the receiving system.\n\nWhen an MSA and ERR segment pair is reported to the sender, an application data response shall not occur. In such cases it is correct to assume that the sending application's user is not authorized to get the data.\n\nThe processing rules for the ERR segment are outside of HL7's scope.",
  "fields": {
    "1": {
      "field_id": "UAC.1",
      "name": "User Authentication Credential Type Code",
      "description": "This an identifier code for the type of user authentication credential. Refer to HL7 Table 0615 – User Authentication Credential Type Code for valid values.",
      "length": "0",
      "data_type": "CWE - Coded With Exceptions",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    },
    "2": {
      "field_id": "UAC.2",
      "name": "User Authentication Credential",
      "description": "This is user credential data as supplied by the sender's operating platform. The content and structure of this is defined by other standards and contain no HL7-relevant data.",
      "length": "0",
      "data_type": "ED - Encapsulated Data",
      "optionality": "Required",
      "repeatability": "Not repeatable"
    }
  }
}